[
  {
    "id": 1,
    "sentence": "The bakery owner fired his assistant because she kept burning the ___",
    "straight": [
      "bread",
      "pastries",
      "cookies"
    ],
    "punny": [
      "dough"
    ],
    "original_sentence": "The baker quit his job because he couldn't make enough ___",
    "original_straight": [
      "money",
      "bread",
      "profit"
    ],
    "original_punny": [
      "dough"
    ],
    "repair_explanation": "Changed from the overused 'baker quitting' setup to a more specific scenario about burning food. This makes 'dough' more surprising since you don't typically think of burning money, creating a better punchline.",
    "claudecode_explanation": "\"Dough\" means money and bread dough. Burning dough/money isn't a common idiom though — 'burning through dough' would be better. The setup is fresh but the phrasing slightly misses.",
    "claudecode_rating": 5
  },
  {
    "id": 2,
    "sentence": "The electrician was shocked when he couldn't handle the ___",
    "straight": [
      "workload",
      "pressure",
      "demands"
    ],
    "punny": [
      "current"
    ],
    "original_sentence": "The electrician was fired because he couldn't handle the ___",
    "original_straight": [
      "workload",
      "pressure",
      "stress"
    ],
    "original_punny": [
      "current",
      "watts",
      "voltage"
    ],
    "repair_explanation": "Added 'shocked' to enhance the electrical theme and focused on 'current' as the strongest pun, since it works both as electrical current and current situation/workload.",
    "claudecode_explanation": "\"Shocked\" in the setup is already an electrical pun, and \"current\" adds another. Overstuffed with puns — having wordplay in both the setup AND blank reduces the surprise of the punchline.",
    "claudecode_rating": 5
  },
  {
    "id": 4,
    "sentence": "The broke musician had to live off his ___",
    "straight": [
      "savings",
      "inheritance",
      "parents"
    ],
    "punny": [
      "notes"
    ],
    "original_sentence": "The musician couldn't pay rent so he was living on the ___",
    "original_straight": [
      "street",
      "streets",
      "couch"
    ],
    "original_punny": [
      "notes",
      "bass"
    ],
    "repair_explanation": "Changed to 'live off his notes' which works more naturally than 'living on the notes' - both musical notes and banknotes make sense as something to live off of.",
    "claudecode_explanation": "\"Notes\" as musical notes and banknotes. \"Live off his notes\" works for both meanings. Clean double meaning, natural phrasing.",
    "claudecode_rating": 5
  },
  {
    "id": 5,
    "sentence": "The gardener's career was really ___",
    "straight": [
      "successful",
      "thriving",
      "impressive"
    ],
    "punny": [
      "blooming"
    ],
    "original_sentence": "The gardener was promoted because his work was ___",
    "original_straight": [
      "excellent",
      "good",
      "great",
      "impressive"
    ],
    "original_punny": [
      "blooming",
      "growing",
      "flourishing"
    ],
    "repair_explanation": "Simplified to focus on 'blooming' as the strongest pun, and made the setup less predictable while maintaining the natural double meaning of both career success and plant growth.",
    "claudecode_explanation": "\"Blooming\" means flourishing and literally blooming (plants). Simple, clean, but extremely predictable for a gardener joke.",
    "claudecode_rating": 5
  },
  {
    "id": 7,
    "sentence": "The optometrist's startup failed because he lacked ___",
    "straight": [
      "funding",
      "experience",
      "planning"
    ],
    "punny": [
      "vision"
    ],
    "original_sentence": "The eye doctor's business failed because he lost his ___",
    "original_straight": [
      "customers",
      "clients",
      "money",
      "funding"
    ],
    "original_punny": [
      "vision",
      "focus",
      "sight"
    ],
    "repair_explanation": "Changed to 'startup' and 'lacked vision' to make the business context stronger and the pun less predictable, while 'vision' still works perfectly for both business foresight and eyesight.",
    "claudecode_explanation": "\"Vision\" means business foresight and eyesight. The \"startup\" context makes both meanings equally strong. Nice irony that an eye doctor lacks vision.",
    "claudecode_rating": 7
  },
  {
    "id": 9,
    "sentence": "The librarian was overwhelmed because she had too much on her ___",
    "straight": [
      "plate",
      "mind",
      "schedule"
    ],
    "punny": [
      "shelves"
    ],
    "original_sentence": "The librarian was stressed because there was too much on her ___",
    "original_straight": [
      "plate",
      "mind",
      "schedule"
    ],
    "original_punny": [
      "shelves"
    ],
    "repair_explanation": "Changed 'stressed' to 'overwhelmed' to make the sentence flow more naturally with 'too much on her shelves' while maintaining the pun between library shelves and being overloaded with work.",
    "claudecode_explanation": "\"Too much on her shelves\" tries to rework the idiom \"too much on her plate\" but the substitution feels unnatural. Nobody says they have too much on their shelves to mean overworked.",
    "claudecode_rating": 4
  },
  {
    "id": 11,
    "sentence": "The fisherman quit because his job wasn't bringing in enough ___",
    "straight": [
      "income",
      "money",
      "profit"
    ],
    "punny": [
      "net",
      "catch"
    ],
    "original_sentence": "The fisherman quit because his job wasn't providing enough ___",
    "original_straight": [
      "income",
      "money",
      "pay",
      "salary"
    ],
    "original_punny": [
      "net",
      "catch"
    ],
    "repair_explanation": "Changed 'providing' to 'bringing in' to create a more natural phrase that works better with both the fishing context (bringing in nets/catch) and financial context (bringing in income).",
    "claudecode_explanation": "\"Net\" works as both fishing net and net income. \"Bringing in\" is a natural verb for both contexts. \"Catch\" also has dual meaning. Solid, clean puns.",
    "claudecode_rating": 6
  },
  {
    "id": 12,
    "sentence": "The geology student failed the exam because she didn't study ___",
    "straight": [
      "enough",
      "properly",
      "hard"
    ],
    "punny": [
      "hard"
    ],
    "original_sentence": "The geology professor was boring because he took everything for ___",
    "original_straight": [
      "granted"
    ],
    "original_punny": [
      "granite"
    ],
    "repair_explanation": "Switched from the tired 'taking for granite/granted' pun to 'hard' which works as both studying intensely and literally studying hard rocks. This creates a tighter, more natural double meaning.",
    "claudecode_explanation": "\"Hard\" is both a study adverb and a rock property, but it's simultaneously the straight AND punny answer — there's no surprise when the expected completion IS the pun.",
    "claudecode_rating": 3
  },
  {
    "id": 13,
    "sentence": "The locksmith moved away because he wanted to turn over a new ___",
    "straight": [
      "leaf",
      "page"
    ],
    "punny": [
      "key"
    ],
    "original_sentence": "The locksmith moved away because he wanted a fresh ___",
    "original_straight": [
      "start",
      "beginning",
      "chapter"
    ],
    "original_punny": [
      "key"
    ],
    "repair_explanation": "Changed to the idiom 'turn over a new leaf/key' because 'a fresh key' isn't a real expression. Now 'key' works as both the tool locksmiths use and as a replacement for 'leaf' in the common idiom about starting fresh.",
    "claudecode_explanation": "\"Turn over a new key\" replaces \"turn over a new leaf\" but the substitution feels forced. Nobody would naturally say \"turn over a new key.\" The idiom hack doesn't land.",
    "claudecode_rating": 4
  },
  {
    "id": 15,
    "sentence": "The clock maker was always late because he never had enough ___",
    "straight": [
      "notice",
      "warning",
      "preparation"
    ],
    "punny": [
      "time"
    ],
    "original_sentence": "The clock maker retired because he needed more ___",
    "original_straight": [
      "rest",
      "sleep",
      "relaxation"
    ],
    "original_punny": [
      "time",
      "hours"
    ],
    "repair_explanation": "Completely reframed the setup to create irony - a clock maker who makes time-telling devices is always late because he doesn't have enough time. This makes the pun more surprising and humorous rather than just obvious.",
    "claudecode_explanation": "\"Time\" for a clock maker is obvious but the irony of a clock maker not having enough time creates a nice paradox. The setup does the heavy lifting.",
    "claudecode_rating": 5
  },
  {
    "id": 16,
    "sentence": "The arborist's marriage failed because his wife said he was too ___",
    "straight": [
      "distant",
      "cold",
      "stubborn"
    ],
    "punny": [
      "shady",
      "wooden"
    ],
    "original_sentence": "The tree surgeon was stumped because the work was too ___",
    "original_straight": [
      "difficult",
      "hard",
      "challenging"
    ],
    "original_punny": [
      "shady",
      "rough",
      "knotty"
    ],
    "repair_explanation": "Moved from work context to personal relationship, making the tree-related personality descriptions more surprising and emotionally resonant. 'Wooden' (emotionless) and 'shady' (untrustworthy) work better in this intimate context.",
    "claudecode_explanation": "\"Shady\" means untrustworthy and tree shade. \"Wooden\" means emotionally stiff and made of wood. Both work perfectly in a relationship context. Creative framing.",
    "claudecode_rating": 7
  },
  {
    "id": 17,
    "sentence": "The wedding photographer was fired because the bride said her photos looked ___",
    "straight": [
      "terrible",
      "awful",
      "blurry"
    ],
    "punny": [
      "overexposed"
    ],
    "original_sentence": "The photographer had to quit because nothing was ___",
    "original_straight": [
      "working",
      "happening",
      "improving"
    ],
    "original_punny": [
      "developing",
      "clicking"
    ],
    "repair_explanation": "Shifted to a specific wedding scenario and focused on 'overexposed' which works as both a photography technical term and meaning too revealing/inappropriate. This creates a more scandalous and memorable punchline.",
    "claudecode_explanation": "\"Overexposed\" means too much light in photography and too revealing/scandalous. Both meanings work perfectly in the wedding photo context. Clever and slightly edgy.",
    "claudecode_rating": 7
  },
  {
    "id": 20,
    "sentence": "The divorce attorney's wife left him because she found him completely ___",
    "straight": [
      "boring",
      "insufferable",
      "selfish"
    ],
    "punny": [
      "objectionable"
    ],
    "original_sentence": "The lawyer's case was dismissed so he lost his ___",
    "original_straight": [
      "confidence",
      "composure",
      "cool"
    ],
    "original_punny": [
      "appeal",
      "brief"
    ],
    "repair_explanation": "Created ironic personal situation where a divorce lawyer gets divorced, and used 'objectionable' which works as both a legal courtroom term and meaning personally offensive. The irony makes the pun more satisfying.",
    "claudecode_explanation": "\"Objectionable\" means personally offensive and evokes the courtroom \"Objection!\" The irony of a divorce attorney getting divorced elevates this beyond a simple pun. Excellent.",
    "claudecode_rating": 8
  },
  {
    "id": 21,
    "sentence": "The boat builder quit because his business was ___",
    "straight": [
      "failing",
      "struggling",
      "declining"
    ],
    "punny": [
      "sinking",
      "going under"
    ],
    "original_sentence": "The boat builder had to bail because things were ___",
    "original_straight": [
      "tough",
      "bad",
      "difficult"
    ],
    "original_punny": [
      "sinking",
      "leaking"
    ],
    "repair_explanation": "The original had the pun in the setup ('bail') rather than the blank. Moving the wordplay to the answer makes 'sinking' and 'going under' work as both business failure and boat-related disasters.",
    "claudecode_explanation": "\"Sinking\" and \"going under\" both work as business failure and boat-related disasters. Clean but very predictable for a boat-themed joke.",
    "claudecode_rating": 5
  },
  {
    "id": 23,
    "sentence": "The orchestra conductor's performance left the audience feeling ___",
    "straight": [
      "emotional",
      "impressed",
      "touched"
    ],
    "punny": [
      "moved",
      "stirred"
    ],
    "original_sentence": "The orchestra conductor found his work quite ___",
    "original_straight": [
      "demanding",
      "difficult",
      "stressful"
    ],
    "original_punny": [
      "moving",
      "noteworthy",
      "composed"
    ],
    "repair_explanation": "The original was too predictable and had weak double meanings. Reframing around audience reaction makes 'moved' work as both emotionally affected and the physical conducting motions, creating a stronger pun.",
    "claudecode_explanation": "\"Moved\" means emotionally affected and physically moving (conducting gestures). \"Stirred\" works similarly. Both are decent but common emotional-physical puns.",
    "claudecode_rating": 5
  },
  {
    "id": 26,
    "sentence": "The bicycle couldn't stand on its own because it was ___",
    "straight": [
      "unstable",
      "wobbly",
      "broken"
    ],
    "punny": [
      "two-tired"
    ],
    "original_sentence": "The bicycle couldn't stand on its own because it was too ___",
    "original_straight": [
      "unstable",
      "wobbly",
      "unbalanced"
    ],
    "original_punny": [
      "tired",
      "exhausted"
    ],
    "repair_explanation": "The original missed the classic \"two-tired\" wordplay that sounds like \"too tired.\" Changed to use the hyphenated version that clearly plays on both meanings: having two tires and being exhausted.",
    "claudecode_explanation": "\"Two-tired\" sounds like \"too tired\" and means having two tires. The pun is tight and classic, though extremely well-known. Good execution of an old favorite.",
    "claudecode_rating": 6
  },
  {
    "id": 28,
    "sentence": "The chimney sweep's business was going up in ___",
    "straight": [
      "value",
      "profits",
      "success"
    ],
    "punny": [
      "smoke"
    ],
    "original_sentence": "The chimney sweep's career was going up in ___",
    "original_straight": [
      "flames"
    ],
    "original_punny": [
      "smoke",
      "soot"
    ],
    "repair_explanation": "Changed \"career\" to \"business\" and the context from failing to succeeding, so \"going up\" works positively for both the business growth and the literal direction smoke travels in chimneys.",
    "claudecode_explanation": "\"Going up in smoke\" idiomatically means failing, but the straight answers (value, profits, success) suggest the business is succeeding. The contradiction undermines the joke.",
    "claudecode_rating": 3
  },
  {
    "id": 29,
    "sentence": "The cucumber farmer was always getting into a ___",
    "straight": [
      "fight",
      "argument",
      "dispute"
    ],
    "punny": [
      "pickle"
    ],
    "original_sentence": "The vegetable farmer was always in a ___",
    "original_straight": [
      "hurry",
      "rush",
      "panic"
    ],
    "original_punny": [
      "pickle",
      "stew",
      "jam"
    ],
    "repair_explanation": "Focused on one strong pun instead of three weak ones, and specified \"cucumber farmer\" to make the pickle connection more direct. \"Getting into a pickle\" works for both trouble and what you do with cucumbers.",
    "claudecode_explanation": "\"Getting into a pickle\" means getting into trouble, and cucumbers become pickles. Specifying \"cucumber farmer\" makes the connection tight and natural.",
    "claudecode_rating": 6
  },
  {
    "id": 30,
    "sentence": "The electrician found the power outage completely ___",
    "straight": [
      "unexpected",
      "surprising",
      "baffling"
    ],
    "punny": [
      "shocking"
    ],
    "original_sentence": "The electrician's work was absolutely ___",
    "original_straight": [
      "perfect",
      "flawless",
      "excellent"
    ],
    "original_punny": [
      "shocking",
      "electrifying"
    ],
    "repair_explanation": "Reframed around a power outage to make the electrical context more specific and meaningful. \"Shocking\" now refers to both the surprise of the outage and the electrical phenomenon, making the pun feel fresh rather than overused.",
    "claudecode_explanation": "\"Shocking\" means surprising and relates to electric shock. Overused pun word, but the power outage scenario gives it a slightly fresher context.",
    "claudecode_rating": 5
  },
  {
    "id": 31,
    "sentence": "The personal trainer had trouble lifting his clients' ___",
    "straight": [
      "confidence",
      "motivation",
      "morale"
    ],
    "punny": [
      "spirits"
    ],
    "original_sentence": "The gym owner couldn't work out the ___",
    "original_straight": [
      "details",
      "problems",
      "issues"
    ],
    "original_punny": [
      "kinks",
      "weights"
    ],
    "repair_explanation": "Completely reframed to focus on a trainer helping clients rather than a gym owner with business problems. \"Lifting spirits\" works perfectly for both emotional encouragement and the physical lifting done in gyms.",
    "claudecode_explanation": "\"Lifting spirits\" means boosting morale and physical lifting. Both meanings map perfectly to a personal trainer's job. Natural and satisfying.",
    "claudecode_rating": 6
  },
  {
    "id": 32,
    "sentence": "The acupuncturist's practice was full of pressure ___",
    "straight": [
      "situations",
      "moments",
      "challenges"
    ],
    "punny": [
      "points"
    ],
    "original_sentence": "The acupuncturist's career had too many ___",
    "original_straight": [
      "problems",
      "issues",
      "setbacks"
    ],
    "original_punny": [
      "points",
      "needles",
      "pricks"
    ],
    "repair_explanation": "The original setup was too vague about what kind of career problems existed. The new version creates a clearer double meaning where 'pressure points' are both stressful situations and literal acupuncture targets.",
    "claudecode_explanation": "\"Pressure points\" works as both stressful situations in a practice and acupuncture pressure points. Tight compound pun where both words contribute.",
    "claudecode_rating": 6
  },
  {
    "id": 33,
    "sentence": "The perfume maker's bankruptcy was no surprise - she'd lost her ___",
    "straight": [
      "focus",
      "direction",
      "edge"
    ],
    "punny": [
      "scents",
      "fragrance"
    ],
    "original_sentence": "The perfume maker had a nose for ___",
    "original_straight": [
      "business",
      "trouble",
      "opportunity"
    ],
    "original_punny": [
      "scents",
      "fragrance"
    ],
    "repair_explanation": "Changed from a predictable positive setup to a surprising negative one. Now the double meaning is sharper - losing your 'scents' (sense) explains the business failure, while literally losing your sense of smell would doom a perfume maker.",
    "claudecode_explanation": "\"Scents\" is a homophone for \"sense.\" A perfume maker losing her scents/sense explains bankruptcy perfectly in both readings. Clean and surprising.",
    "claudecode_rating": 7
  },
  {
    "id": 34,
    "sentence": "When the magician quit his job, he vanished without a ___",
    "straight": [
      "word",
      "notice",
      "goodbye"
    ],
    "punny": [
      "trick"
    ],
    "original_sentence": "The magician got frustrated and disappeared without a ___",
    "original_straight": [
      "word",
      "sound",
      "warning"
    ],
    "original_punny": [
      "trace",
      "trick"
    ],
    "repair_explanation": "The original was weak because 'trace' doesn't have a strong magic-specific meaning. 'Trick' works better as both a magic performance and something missing (like 'without a hitch'), plus it's more natural for someone to quit 'without a trick' up their sleeve.",
    "claudecode_explanation": "\"Without a trick\" tries to work as both magic performance and the phrase \"without a trace/hitch,\" but \"without a trick\" isn't an established expression. The substitution doesn't land.",
    "claudecode_rating": 4
  },
  {
    "id": 36,
    "sentence": "The baker was stressed because he was always in a ___",
    "straight": [
      "rush",
      "hurry",
      "panic"
    ],
    "punny": [
      "jam"
    ],
    "original_sentence": "The baker felt the pressure because he was really in a ___",
    "original_straight": [
      "rush",
      "hurry",
      "bind"
    ],
    "original_punny": [
      "jam"
    ],
    "repair_explanation": "The original was functional but I refined it slightly to make the stress connection clearer and more natural. Being 'always in a jam' flows better than 'really in a jam' for this context.",
    "claudecode_explanation": "\"In a jam\" means in trouble and refers to fruit preserves a baker would make. Classic idiom, works naturally, though predictable.",
    "claudecode_rating": 5
  },
  {
    "id": 37,
    "sentence": "The cartographer got lost on his way to work, proving he was completely ___",
    "straight": [
      "hopeless",
      "confused",
      "disoriented"
    ],
    "punny": [
      "off the map",
      "uncharted"
    ],
    "original_sentence": "The cartographer's career went off the ___",
    "original_straight": [
      "rails",
      "track",
      "deep end"
    ],
    "original_punny": [
      "map",
      "charts"
    ],
    "repair_explanation": "Flipped from career troubles to personal irony. A cartographer who gets lost is both literally 'off the map' and figuratively hopeless, creating a more immediate and relatable contradiction.",
    "claudecode_explanation": "A cartographer who gets lost is inherently funny. \"Off the map\" works as both crazy/extreme and literally not on any map. Good irony in the scenario.",
    "claudecode_rating": 6
  },
  {
    "id": 38,
    "sentence": "The music store was struggling financially so it had to sell all its ___",
    "straight": [
      "inventory",
      "equipment",
      "instruments"
    ],
    "punny": [
      "notes",
      "chords"
    ],
    "original_sentence": "The music store was struggling so it was about to close its ___",
    "original_straight": [
      "doors",
      "shop",
      "business"
    ],
    "original_punny": [
      "notes",
      "chords"
    ],
    "repair_explanation": "The original phrase 'close its notes/chords' wasn't a natural expression. Changed to 'sell all its notes/chords' which works both for musical items and financial promissory notes/debt agreements.",
    "claudecode_explanation": "\"Notes\" works as financial notes and musical notes, but \"selling notes\" is more natural for music than finance. \"Chords\" has no financial meaning at all.",
    "claudecode_rating": 4
  },
  {
    "id": 39,
    "sentence": "The locksmith turned prison warden kept losing inmates because he couldn't keep them under ___",
    "straight": [
      "surveillance",
      "control",
      "watch"
    ],
    "punny": [
      "lock",
      "key"
    ],
    "original_sentence": "The prison warden was having a hard time keeping things under ___",
    "original_straight": [
      "control",
      "wraps"
    ],
    "original_punny": [
      "lock",
      "key"
    ],
    "repair_explanation": "Added the locksmith background to make the pun more surprising and ironic. A locksmith-turned-warden who can't keep prisoners 'under lock and key' creates a professional contradiction that makes the failure funnier.",
    "claudecode_explanation": "\"Under lock and key\" means secure imprisonment, and a locksmith literally works with locks and keys. Fun character mashup creates the dual meaning.",
    "claudecode_rating": 6
  },
  {
    "id": 42,
    "sentence": "The marine biologist was struggling to understand the ocean's ___",
    "straight": [
      "mysteries",
      "complexity",
      "secrets"
    ],
    "punny": [
      "depth",
      "depths"
    ],
    "original_sentence": "The marine biologist couldn't fathom the ___",
    "original_straight": [
      "problem",
      "situation",
      "answer"
    ],
    "original_punny": [
      "depth",
      "depths"
    ],
    "repair_explanation": "The original had the pun in 'fathom' rather than the blank. Moved the wordplay to the fill-in so 'depth' works both as physical ocean measurement and metaphorical complexity.",
    "claudecode_explanation": "\"Depth\" means profundity/complexity and ocean depth. Both meanings work but the pun is completely predictable for a marine biologist joke.",
    "claudecode_rating": 4
  },
  {
    "id": 43,
    "sentence": "The baseball pitcher was surprisingly afraid of ___",
    "straight": [
      "failure",
      "crowds",
      "pressure"
    ],
    "punny": [
      "bats"
    ],
    "original_sentence": "The baseball player was a pitcher who was afraid of ___",
    "original_straight": [
      "failure",
      "losing",
      "rejection"
    ],
    "original_punny": [
      "bats"
    ],
    "repair_explanation": "Minor adjustment to make the setup flow more naturally while preserving the double meaning of bats (baseball equipment and flying animals).",
    "claudecode_explanation": "\"Bats\" means baseball bats and flying mammals. Simple reversal of expectations — a pitcher afraid of bats is surprising and funny.",
    "claudecode_rating": 6
  },
  {
    "id": 44,
    "sentence": "The carpenter did great work but always struggled with the ___",
    "straight": [
      "paperwork",
      "scheduling",
      "measurements"
    ],
    "punny": [
      "screws",
      "nuts"
    ],
    "original_sentence": "The carpenter nailed the interview but screwed up the ___",
    "original_straight": [
      "paperwork",
      "details",
      "followup"
    ],
    "original_punny": [
      "job",
      "boards"
    ],
    "repair_explanation": "The original had puns in the setup rather than the blank. Restructured so the wordplay is in the fill-in, where 'screws' and 'nuts' work as both carpentry hardware and slang for problems/crazy situations.",
    "claudecode_explanation": "\"Screws\" and \"nuts\" are both hardware and slang for messing up/being crazy. The combination works but the innuendo feels unintentional.",
    "claudecode_rating": 5
  },
  {
    "id": 45,
    "sentence": "The astronomer's career prospects were looking ___",
    "straight": [
      "bleak",
      "uncertain",
      "dim"
    ],
    "punny": [
      "up",
      "stellar"
    ],
    "original_sentence": "The astronomer's career was looking ___",
    "original_straight": [
      "bleak",
      "grim",
      "bad"
    ],
    "original_punny": [
      "up",
      "stellar"
    ],
    "repair_explanation": "Added 'prospects were' to make the sentence flow more naturally and avoid the awkward phrasing. The puns still work perfectly - astronomers look 'up' at stars while careers look 'up' when improving, and 'stellar' means both excellent and star-related.",
    "claudecode_explanation": "\"Stellar\" means excellent and relates to stars. For an astronomer, career prospects looking stellar works perfectly in both senses.",
    "claudecode_rating": 6
  },
  {
    "id": 48,
    "sentence": "The ice cream vendor was having a rough ___",
    "straight": [
      "day",
      "week",
      "time"
    ],
    "punny": [
      "melt",
      "freeze"
    ],
    "original_sentence": "The ice cream vendor had a meltdown during the ___",
    "original_straight": [
      "meeting",
      "interview",
      "presentation"
    ],
    "original_punny": [
      "summer",
      "heat wave"
    ],
    "repair_explanation": "Moved the pun from the setup to the blank where it belongs. Now 'melt' works as both a difficult situation and what happens to ice cream, while 'freeze' means being stuck/paralyzed and what ice cream should do.",
    "claudecode_explanation": "\"Rough melt\" and \"rough freeze\" are not natural expressions. Neither completes the sentence in a way that makes sense idiomatically. The pun fails.",
    "claudecode_rating": 2
  },
  {
    "id": 50,
    "sentence": "The marathon runner was completely out of ___",
    "straight": [
      "luck",
      "options",
      "time"
    ],
    "punny": [
      "breath",
      "steam",
      "gas"
    ],
    "original_sentence": "The sprinter felt run down and out of ___",
    "original_straight": [
      "luck",
      "options",
      "ideas"
    ],
    "original_punny": [
      "breath",
      "steam",
      "gas"
    ],
    "repair_explanation": "Removed 'run down' from the setup since it was stealing the pun's thunder, and changed to 'marathon runner' to make the endurance context clearer. Now the pun words in the blank have stronger double meanings related to both exhaustion and running fuel/energy.",
    "claudecode_explanation": "\"Out of gas\" works for running out of energy and literal fuel, but the other options (breath, steam) are essentially straight answers too. The pun structure is muddled.",
    "claudecode_rating": 4
  },
  {
    "id": 51,
    "sentence": "The firefighter's marriage was getting pretty ___",
    "straight": [
      "rocky",
      "tense",
      "difficult"
    ],
    "punny": [
      "heated",
      "hot"
    ],
    "original_sentence": "The fireman's relationship was always on the ___",
    "original_straight": [
      "rocks",
      "edge",
      "brink"
    ],
    "original_punny": [
      "flames",
      "fire"
    ],
    "repair_explanation": "Changed the setup to avoid the obvious 'on fire' phrase and used 'heated/hot' which work better as both relationship descriptors (passionate/argumentative) and fire-related terms. This creates more natural wordplay than the original forced connection.",
    "claudecode_explanation": "\"Heated\" means angry and hot-temperature. \"Hot\" is similar. Both are obvious for a firefighter joke. Functional but zero surprise.",
    "claudecode_rating": 5
  },
  {
    "id": 53,
    "sentence": "The novelist's latest work had a really strong ___",
    "straight": [
      "ending",
      "message",
      "theme"
    ],
    "punny": [
      "binding",
      "spine"
    ],
    "original_sentence": "The author's story was bound to have a good ___",
    "original_straight": [
      "ending",
      "plot",
      "outcome"
    ],
    "original_punny": [
      "binding",
      "spine"
    ],
    "repair_explanation": "Removed 'bound to' from the setup since it was redundant with the pun answers. Now 'binding' works as both book construction and story cohesion, while 'spine' means both the book's backbone and the story's central strength.",
    "claudecode_explanation": "\"Binding\" works as book binding and compelling/binding agreement. \"Spine\" means book spine and backbone/courage. Two clean puns — spine is the stronger one.",
    "claudecode_rating": 6
  },
  {
    "id": 54,
    "sentence": "The banker was feeling unsteady and needed to check his ___",
    "straight": [
      "footing",
      "stability",
      "equilibrium"
    ],
    "punny": [
      "balance"
    ],
    "original_sentence": "The banker wanted to check his ___",
    "original_straight": [
      "email",
      "phone",
      "messages"
    ],
    "original_punny": [
      "balance",
      "account"
    ],
    "repair_explanation": "The original was too predictable and obvious for a banker. Adding 'feeling unsteady' creates a clear physical context where 'balance' works both as checking one's physical balance and checking one's bank balance.",
    "claudecode_explanation": "\"Balance\" means financial balance and physical balance. Both meanings are equally strong in context. Clean, tight, natural phrasing.",
    "claudecode_rating": 6
  },
  {
    "id": 57,
    "sentence": "The poker player lost his house but at least he still had a good ___",
    "straight": [
      "reputation",
      "attitude",
      "outlook"
    ],
    "punny": [
      "hand"
    ],
    "original_sentence": "The poker player lost his house but kept his ___",
    "original_straight": [
      "composure",
      "cool",
      "dignity"
    ],
    "original_punny": [
      "cards",
      "chips",
      "hand"
    ],
    "repair_explanation": "The original worked but was slightly awkward. Adding 'good' makes the sentence flow more naturally while maintaining the double meaning of poker hand and having a good situation/advantage despite losses.",
    "claudecode_explanation": "\"Hand\" means poker hand and physical hand. Losing his house (full house in poker?) but keeping a good hand adds a clever poker layer.",
    "claudecode_rating": 6
  },
  {
    "id": 58,
    "sentence": "The coffee shop owner's energy was drained, so she decided to get a new ___",
    "straight": [
      "assistant",
      "manager",
      "employee"
    ],
    "punny": [
      "filter"
    ],
    "original_sentence": "The coffee shop owner felt drained and needed a ___",
    "original_straight": [
      "break",
      "vacation",
      "rest"
    ],
    "original_punny": [
      "filter",
      "refill"
    ],
    "repair_explanation": "The original punny words were weak because 'filter' and 'refill' don't naturally complete 'needed a ___' in a personal context. Changing to 'get a new filter' works both for coffee equipment and metaphorically getting a fresh perspective/energy boost.",
    "claudecode_explanation": "\"Filter\" means coffee filter and a new perspective/filter on life. But \"get a new filter\" for changing one's outlook is a stretch. The coffee meaning dominates.",
    "claudecode_rating": 4
  },
  {
    "id": 59,
    "sentence": "The carpet installer's career was completely ___",
    "straight": [
      "finished",
      "ruined",
      "destroyed"
    ],
    "punny": [
      "unraveled"
    ],
    "original_sentence": "The carpet installer's career was really coming ___",
    "original_straight": [
      "along",
      "together",
      "around"
    ],
    "original_punny": [
      "unraveled",
      "unwoven"
    ],
    "repair_explanation": "The original phrase 'coming unraveled' was awkward. Simplifying to 'completely unraveled' creates cleaner grammar while maintaining the double meaning of carpet fibers unraveling and a career falling apart.",
    "claudecode_explanation": "\"Unraveled\" means fell apart and carpet literally unraveling. The idiom maps perfectly to the profession. Clean and natural.",
    "claudecode_rating": 6
  },
  {
    "id": 60,
    "sentence": "The soap maker was in a real ___",
    "straight": [
      "mess",
      "bind",
      "pickle"
    ],
    "punny": [
      "lather"
    ],
    "original_sentence": "The soap maker finally came clean about his ___",
    "original_straight": [
      "past",
      "crimes",
      "mistakes"
    ],
    "original_punny": [
      "formula",
      "lather"
    ],
    "repair_explanation": "The original had the pun in the setup ('came clean') rather than the blank. Moving the wordplay to 'in a lather' creates a proper fill-in-the-blank pun that means both being agitated/worked up and literally being covered in soap foam.",
    "claudecode_explanation": "\"In a lather\" is a real idiom meaning agitated, and soap lather is literal. Both meanings work naturally for a soap maker. Nice use of a less common idiom.",
    "claudecode_rating": 6
  },
  {
    "id": 61,
    "sentence": "The nuclear physicist's emotional breakdown happened right at ___",
    "straight": [
      "home",
      "dinner",
      "the meeting"
    ],
    "punny": [
      "work",
      "the reactor",
      "the plant"
    ],
    "original_sentence": "The nuclear physicist had a meltdown at ___",
    "original_straight": [
      "home",
      "dinner",
      "the meeting"
    ],
    "original_punny": [
      "work",
      "the reactor",
      "the plant"
    ],
    "repair_explanation": "The original was actually quite good but 'meltdown' in the setup made the pun too obvious. Changing to 'emotional breakdown' preserves the double meaning while making the nuclear workplace answers more surprising.",
    "claudecode_explanation": "\"At work,\" \"the reactor,\" and \"the plant\" — none of these have a meaningful double sense. A nuclear physicist's breakdown at a plant is literal, not punny.",
    "claudecode_rating": 3
  },
  {
    "id": 63,
    "sentence": "After years of road work, the construction worker felt completely ___",
    "straight": [
      "exhausted",
      "worn out",
      "drained"
    ],
    "punny": [
      "flat",
      "rolled"
    ],
    "original_sentence": "The road construction worker felt paved over and ___",
    "original_straight": [
      "ignored",
      "forgotten",
      "dismissed"
    ],
    "original_punny": [
      "flat",
      "rolled"
    ],
    "repair_explanation": "The original 'paved over and ___' was clunky phrasing that didn't flow naturally. The new setup lets 'flat' and 'rolled' work as both emotional states and road construction terms.",
    "claudecode_explanation": "\"Flat\" means tired/depleted and road surface. \"Rolled\" means steamrolled emotionally and road rolling. Both work, with \"rolled\" being the stronger pun.",
    "claudecode_rating": 5
  },
  {
    "id": 64,
    "sentence": "The mountain climber captain felt he was getting in over his ___",
    "straight": [
      "head",
      "abilities",
      "skill level"
    ],
    "punny": [
      "depth",
      "summit"
    ],
    "original_sentence": "The ocean liner captain felt he was in deep ___",
    "original_straight": [
      "trouble",
      "debt",
      "despair"
    ],
    "original_punny": [
      "water",
      "seas"
    ],
    "repair_explanation": "The ocean liner setup was too obvious since captains are literally in deep water. Switching to mountain climbing makes the depth/summit answers unexpected while 'getting in over his head' remains a natural idiom.",
    "claudecode_explanation": "\"In over his depth\" isn't the right idiom (it's \"out of his depth\"), and \"summit\" doesn't fit the phrase at all. The sentence structure is broken.",
    "claudecode_rating": 2
  },
  {
    "id": 65,
    "sentence": "The massage therapist felt like she was under constant ___",
    "straight": [
      "stress",
      "strain",
      "scrutiny"
    ],
    "punny": [
      "pressure"
    ],
    "original_sentence": "The submarine captain felt under too much ___",
    "original_straight": [
      "stress",
      "strain",
      "scrutiny"
    ],
    "original_punny": [
      "pressure",
      "water"
    ],
    "repair_explanation": "The submarine setup was too literal since submarines are actually under pressure. A massage therapist deals with literal pressure on clients while also potentially feeling stressed, making the double meaning more clever.",
    "claudecode_explanation": "\"Pressure\" means stress and massage pressure. Both meanings are strong and the sentence reads naturally. Simple but effective.",
    "claudecode_rating": 6
  },
  {
    "id": 67,
    "sentence": "The boxer found himself trapped in a tight ___",
    "straight": [
      "situation",
      "spot",
      "bind"
    ],
    "punny": [
      "corner"
    ],
    "original_sentence": "The painter found himself in a ___",
    "original_straight": [
      "bind",
      "situation",
      "predicament"
    ],
    "original_punny": [
      "corner"
    ],
    "repair_explanation": "The painter setup was too predictable since 'painting yourself into a corner' is a common idiom. Boxing creates a fresh context where being in a 'corner' works both as a difficult situation and the literal corner of a boxing ring.",
    "claudecode_explanation": "\"Tight corner\" is both a boxing ring corner and the idiom for a difficult situation. Both meanings work but it's a common, unremarkable pun.",
    "claudecode_rating": 5
  },
  {
    "id": 68,
    "sentence": "After the butcher slipped and fell backwards onto his own knife, customers said he really got ___",
    "straight": [
      "hurt",
      "injured",
      "wounded"
    ],
    "punny": [
      "cut up",
      "chopped"
    ],
    "original_sentence": "The butcher who backed into the meat grinder got a little behind in his ___",
    "original_straight": [
      "work",
      "orders",
      "schedule"
    ],
    "original_punny": [
      "rump",
      "cuts"
    ],
    "repair_explanation": "Simplified the setup and changed the punchline to focus on being 'cut up' (emotionally upset vs. literally cut). Removes the overly graphic meat grinder imagery while keeping the dark humor more accessible.",
    "claudecode_explanation": "\"Cut up\" means physically injured and very amused (slang). Dark humor that works, but the overly graphic setup about falling on a knife is distracting.",
    "claudecode_rating": 5
  },
  {
    "id": 70,
    "sentence": "The origami teacher decided the job was ___",
    "straight": [
      "stressful",
      "overwhelming",
      "exhausting"
    ],
    "punny": [
      "folding"
    ],
    "original_sentence": "The origami teacher's job was too ___",
    "original_straight": [
      "stressful",
      "demanding",
      "difficult"
    ],
    "original_punny": [
      "folding",
      "creased"
    ],
    "repair_explanation": "The original 'too folding' was grammatically awkward. Changed to 'the job was folding' so 'folding' works both as origami technique and as slang for 'failing/going under.'",
    "claudecode_explanation": "\"Folding\" means quitting (folding one's hand) and paper folding in origami. Clean dual meaning — concise setup, satisfying punchline.",
    "claudecode_rating": 6
  },
  {
    "id": 71,
    "sentence": "The boat repair shop was struggling until the owner finally caught ___",
    "straight": [
      "a break",
      "some luck",
      "an opportunity"
    ],
    "punny": [
      "wind",
      "the current"
    ],
    "original_sentence": "The boating store had its best ___",
    "original_straight": [
      "year",
      "quarter",
      "month"
    ],
    "original_punny": [
      "sail"
    ],
    "repair_explanation": "Changed from a generic sales pun to nautical metaphors about success. 'Catching wind' or 'catching the current' both mean gaining momentum in business while using actual sailing terminology, making the connection more clever.",
    "claudecode_explanation": "\"Caught wind\" means heard about an opportunity and caught literal wind for sailing. Good use of the idiom in a nautical context.",
    "claudecode_rating": 6
  },
  {
    "id": 72,
    "sentence": "The plastic surgeon refused to cut ___",
    "straight": [
      "recklessly",
      "without permission",
      "too deeply"
    ],
    "punny": [
      "corners"
    ],
    "original_sentence": "The surgeon was very careful not to cut ___",
    "original_straight": [
      "deeply",
      "carelessly",
      "hastily"
    ],
    "original_punny": [
      "corners"
    ],
    "repair_explanation": "Changed to 'plastic surgeon refused to cut' which makes the corner-cutting idiom more impactful - a plastic surgeon who won't cut corners is being extra careful about aesthetics and results.",
    "claudecode_explanation": "\"Cut corners\" means taking shortcuts, and a plastic surgeon literally cuts. The irony of a surgeon who refuses to cut corners is sharp.",
    "claudecode_rating": 6
  },
  {
    "id": 73,
    "sentence": "The yoga instructor found the new schedule too much of a ___",
    "straight": [
      "challenge",
      "burden",
      "hassle"
    ],
    "punny": [
      "stretch"
    ],
    "original_sentence": "The yoga instructor was too flexible about the ___",
    "original_straight": [
      "rules",
      "schedule",
      "requirements"
    ],
    "original_punny": [
      "poses",
      "stretches"
    ],
    "repair_explanation": "The original had the pun in the setup word 'flexible' rather than the blank. Reframed so 'stretch' works as both a yoga pose and meaning 'difficult challenge' in the phrase 'too much of a stretch.'",
    "claudecode_explanation": "\"Stretch\" means exaggeration/challenge and yoga stretching. Both meanings work naturally. Concise and clean.",
    "claudecode_rating": 6
  },
  {
    "id": 74,
    "sentence": "The weightlifter couldn't decide whether to quit, so his coach told him to put his ___",
    "straight": [
      "doubts aside",
      "fears behind him",
      "worries away"
    ],
    "punny": [
      "foot down",
      "weights down"
    ],
    "original_sentence": "The weightlifter decided to put his ___",
    "original_straight": [
      "mind",
      "heart",
      "effort"
    ],
    "original_punny": [
      "foot down",
      "weights down"
    ],
    "repair_explanation": "The original setup was incomplete and awkward. The new version creates a decision-making context where 'put his foot down' (make a firm decision) works naturally, while 'weights down' plays on the literal weightlifting action.",
    "claudecode_explanation": "\"Put his foot down\" and \"put his weights down\" — the blank needs to contain the punchline but neither phrase completes naturally. Structurally broken.",
    "claudecode_rating": 3
  },
  {
    "id": 75,
    "sentence": "The pet store went bankrupt when all the parrots flew the ___",
    "straight": [
      "away",
      "out"
    ],
    "punny": [
      "coop"
    ],
    "original_sentence": "The pet shop owner was doing well until the birds flew the ___",
    "original_straight": [
      "away",
      "off"
    ],
    "original_punny": [
      "coop"
    ],
    "repair_explanation": "Made it more specific with 'parrots' and 'went bankrupt' to create a clearer cause-and-effect story, making the business failure more dramatic and the pun more satisfying.",
    "claudecode_explanation": "\"Flew the coop\" means escaped and is literal for birds in a coop. The specificity of parrots adds character. Both meanings are equally strong.",
    "claudecode_rating": 7
  },
  {
    "id": 77,
    "sentence": "The detective found the mystery difficult to ___",
    "straight": [
      "solve",
      "understand",
      "figure out"
    ],
    "punny": [
      "crack"
    ],
    "original_sentence": "The detective's work was hard to ___",
    "original_straight": [
      "manage",
      "handle",
      "complete"
    ],
    "original_punny": [
      "case",
      "crack"
    ],
    "repair_explanation": "Changed from 'work was hard to' to 'mystery difficult to' because you crack cases/mysteries, not work. This makes 'crack' work both as solving a mystery and breaking something open.",
    "claudecode_explanation": "\"Crack\" means solve a mystery and crack open. Standard detective idiom, clean but unremarkable and overused.",
    "claudecode_rating": 5
  },
  {
    "id": 78,
    "sentence": "The exhausted clockmaker had been working around the ___",
    "straight": [
      "problem",
      "deadline",
      "issue"
    ],
    "punny": [
      "clock"
    ],
    "original_sentence": "The clock repairman worked around the ___",
    "original_straight": [
      "problem",
      "issue",
      "obstacle"
    ],
    "original_punny": [
      "clock"
    ],
    "repair_explanation": "Added 'exhausted' and 'had been working' to emphasize the continuous effort, making the 'around the clock' idiom feel more earned and the pun more natural.",
    "claudecode_explanation": "\"Around the clock\" means nonstop and literally around a clock. The irony of a clockmaker working around the clock is a nice paradox.",
    "claudecode_rating": 6
  },
  {
    "id": 79,
    "sentence": "After years of cutting timber, the lumberjack realized he'd been so focused on his daily quota that he couldn't see the forest for the ___",
    "straight": [
      "bigger picture",
      "long-term impact",
      "environmental cost"
    ],
    "punny": [
      "trees"
    ],
    "original_sentence": "The lumberjack felt he couldn't see the forest for the ___",
    "original_straight": [
      "details",
      "paperwork",
      "problems"
    ],
    "original_punny": [
      "trees"
    ],
    "repair_explanation": "The original felt like just restating a proverb. The new setup creates a meaningful context about losing sight of environmental impact while being focused on individual trees, making the idiom feel fresh and relevant.",
    "claudecode_explanation": "\"Can't see the forest for the trees\" is a well-known idiom. The lumberjack context adds literal meaning, but the setup is far too long and the punchline is too familiar to surprise anyone.",
    "claudecode_rating": 4
  },
  {
    "id": 80,
    "sentence": "The archaeologist was terrible at ___ anything recent",
    "straight": [
      "understanding",
      "appreciating",
      "handling"
    ],
    "punny": [
      "dating"
    ],
    "original_sentence": "The archaeologist's dating life was ___",
    "original_straight": [
      "terrible",
      "nonexistent",
      "complicated"
    ],
    "original_punny": [
      "ancient",
      "old"
    ],
    "repair_explanation": "The original pun was weak because 'ancient/old' describing a dating life doesn't create a strong double meaning. The new setup makes 'dating' the pun word itself, playing on both romantic dating and archaeological carbon dating.",
    "claudecode_explanation": "\"Dating\" means romantic dating and archaeological dating (carbon dating, etc.). The archaeologist being terrible at dating anything recent is a clever twist that makes both meanings work.",
    "claudecode_rating": 7
  },
  {
    "id": 81,
    "sentence": "The roofer found the advanced mathematics course was over his ___",
    "straight": [
      "ability",
      "skill level",
      "comprehension"
    ],
    "punny": [
      "head"
    ],
    "original_sentence": "The roofer's career was over his ___",
    "original_straight": [
      "budget",
      "limit",
      "capacity"
    ],
    "original_punny": [
      "head"
    ],
    "repair_explanation": "The original setup was confusing because 'career was over his head' doesn't make grammatical sense. The new version creates a clear scenario where 'over his head' naturally means both 'too difficult to understand' and literally above where a roofer works.",
    "claudecode_explanation": "\"Over his head\" means beyond understanding and physically above (where roofers work). Both meanings work. Decent but predictable.",
    "claudecode_rating": 5
  },
  {
    "id": 82,
    "sentence": "The egg farmer always told ___ jokes",
    "straight": [
      "silly",
      "corny",
      "bad"
    ],
    "punny": [
      "cracked"
    ],
    "original_sentence": "The egg farmer's jokes were always ___",
    "original_straight": [
      "bad",
      "terrible",
      "awful"
    ],
    "original_punny": [
      "cracked"
    ],
    "repair_explanation": "The original phrasing 'jokes were cracked' was grammatically awkward. Changing it to 'told cracked jokes' makes the sentence flow naturally while maintaining the double meaning of cracked eggs and crazy/funny jokes.",
    "claudecode_explanation": "\"Cracked\" means crazy/hilarious jokes and cracked eggs. Simple, clean, natural phrasing. Gets the job done.",
    "claudecode_rating": 5
  },
  {
    "id": 83,
    "sentence": "The candle shop's Black Friday sale was absolutely ___",
    "straight": [
      "chaotic",
      "insane",
      "overwhelming"
    ],
    "punny": [
      "lit",
      "wicked"
    ],
    "original_sentence": "The candle maker's schedule was completely ___",
    "original_straight": [
      "full",
      "packed",
      "booked"
    ],
    "original_punny": [
      "lit",
      "wicked"
    ],
    "repair_explanation": "Changed to a Black Friday sale scenario where 'lit' (exciting/busy) and 'wicked' (awesome) feel more natural as modern slang, while keeping the candle connection strong.",
    "claudecode_explanation": "\"Lit\" means exciting (slang) and candles being lit. \"Wicked\" means awesome (slang) and candle wicks. Two solid puns in one joke — the slang-to-literal mapping is clever.",
    "claudecode_rating": 7
  },
  {
    "id": 84,
    "sentence": "The demolition company's first job completely ___",
    "straight": [
      "failed",
      "backfired",
      "went wrong"
    ],
    "punny": [
      "bombed",
      "imploded"
    ],
    "original_sentence": "The demolition expert's career really ___",
    "original_straight": [
      "suffered",
      "declined",
      "failed"
    ],
    "original_punny": [
      "bombed",
      "collapsed"
    ],
    "repair_explanation": "Changed to 'first job' to make failure more believable and added 'imploded' as another demolition-related pun option, creating more variety in the wordplay.",
    "claudecode_explanation": "\"Bombed\" means failed spectacularly and explosive demolition. \"Imploded\" also works for both failure and demolition. The irony of a demolition company's job bombing is fun.",
    "claudecode_rating": 6
  },
  {
    "id": 85,
    "sentence": "The wine maker's problems were slowly ___",
    "straight": [
      "worsening",
      "escalating",
      "developing"
    ],
    "punny": [
      "fermenting",
      "aging"
    ],
    "original_sentence": "The wine maker's problems were ___",
    "original_straight": [
      "serious",
      "growing",
      "mounting"
    ],
    "original_punny": [
      "fermenting",
      "aging"
    ],
    "repair_explanation": "Added 'slowly' to make the time progression clearer and more natural. This strengthens how 'fermenting' and 'aging' work both as wine processes and as problems developing over time.",
    "claudecode_explanation": "\"Fermenting\" means brewing/building up and wine fermentation. \"Aging\" means getting worse over time and wine aging. Both are clean dual meanings.",
    "claudecode_rating": 6
  },
  {
    "id": 86,
    "sentence": "The podiatrist's motto was 'always put your best ___'",
    "straight": [
      "effort forward",
      "work forward",
      "ideas forward"
    ],
    "punny": [
      "foot forward"
    ],
    "original_sentence": "The podiatrist always put his best foot ___",
    "original_straight": [
      "first",
      "out"
    ],
    "original_punny": [
      "forward"
    ],
    "repair_explanation": "Changed to a motto format to make the idiom completion feel more natural and less predictable. The setup now frames it as his professional philosophy rather than just describing his behavior.",
    "claudecode_explanation": "\"Put your best foot forward\" is the idiom, and a podiatrist specializes in feet. Clean and natural, though just dropping an existing idiom into a profession context.",
    "claudecode_rating": 6
  },
  {
    "id": 87,
    "sentence": "The geologist's presentation rocked because his research was really ___",
    "straight": [
      "thorough",
      "impressive",
      "groundbreaking"
    ],
    "punny": [
      "solid",
      "rock solid"
    ],
    "original_sentence": "The geologist'site rocked because it was really ___",
    "original_straight": [
      "popular",
      "successful",
      "impressive"
    ],
    "original_punny": [
      "solid",
      "stone cold"
    ],
    "repair_explanation": "Fixed the typo and awkward phrasing by making it about a presentation with research quality. This creates a clearer connection between 'solid' meaning both reliable research and literally describing rocks.",
    "claudecode_explanation": "\"Rocked\" in the setup is already a geology pun, and \"solid/rock solid\" adds more. Having puns in both the setup and blank overstuffs the joke and kills the surprise.",
    "claudecode_rating": 4
  },
  {
    "id": 88,
    "sentence": "The glue factory worker's day got off to a ___",
    "straight": [
      "rough start",
      "bad beginning",
      "difficult start"
    ],
    "punny": [
      "sticky start"
    ],
    "original_sentence": "The glue factory worker got stuck in a ___",
    "original_straight": [
      "situation",
      "problem",
      "jam"
    ],
    "original_punny": [
      "bind",
      "sticky situation"
    ],
    "repair_explanation": "Changed to 'sticky start' which is less predictable than the original options while maintaining the double meaning of adhesive properties and a problematic beginning.",
    "claudecode_explanation": "\"Sticky start\" combines sticky (glue) with rough start, but \"sticky start\" isn't a natural expression. The phrase feels manufactured.",
    "claudecode_rating": 4
  },
  {
    "id": 89,
    "sentence": "The mirror salesman's biggest weakness was too much ___",
    "straight": [
      "pride",
      "ego",
      "confidence"
    ],
    "punny": [
      "self-reflection"
    ],
    "original_sentence": "The mirror salesman could really see himself in the ___",
    "original_straight": [
      "company",
      "industry",
      "position"
    ],
    "original_punny": [
      "reflection",
      "glass"
    ],
    "repair_explanation": "Reframed as a character flaw to make 'self-reflection' work as both excessive introspection (a weakness) and literally looking at oneself in mirrors, creating a more surprising twist.",
    "claudecode_explanation": "\"Self-reflection\" means introspection and literally seeing yourself reflected in mirrors. Both meanings are equally strong. Tight, surprising, and natural. One of the best repairs.",
    "claudecode_rating": 8
  },
  {
    "id": 91,
    "sentence": "The elevator mechanic's career was full of ___",
    "straight": [
      "challenges",
      "surprises",
      "opportunities"
    ],
    "punny": [
      "ups and downs"
    ],
    "original_sentence": "The elevator mechanic's career had its ___",
    "original_straight": [
      "moments",
      "challenges",
      "difficulties"
    ],
    "original_punny": [
      "ups and downs"
    ],
    "repair_explanation": "Changed 'had its' to 'was full of' to make the sentence flow more naturally and feel less forced. The pun remains the same but now works better grammatically.",
    "claudecode_explanation": "\"Ups and downs\" means good and bad periods and elevator movement. Classic idiom play — clean but completely predictable.",
    "claudecode_rating": 5
  },
  {
    "id": 92,
    "sentence": "The vegetarian was so energetic when discussing nutrition that people said he was full of ___",
    "straight": [
      "enthusiasm",
      "energy",
      "passion"
    ],
    "punny": [
      "beans"
    ],
    "original_sentence": "The vegetarian couldn't stop talking about food so people thought he was full of ___",
    "original_straight": [
      "nonsense",
      "himself",
      "it"
    ],
    "original_punny": [
      "beans"
    ],
    "repair_explanation": "Reframed the setup to focus on being energetic rather than just talking, which naturally leads to 'full of beans' meaning both energetic/lively and literally full of the vegetarian staple food.",
    "claudecode_explanation": "\"Full of beans\" is a real idiom meaning energetic (or full of nonsense), and a vegetarian literally eats beans. The idiom usage is authentic and the connection is natural.",
    "claudecode_rating": 7
  },
  {
    "id": 93,
    "sentence": "The pastry chef's winning streak meant she was really on a ___",
    "straight": [
      "hot streak",
      "good run",
      "tear"
    ],
    "punny": [
      "roll"
    ],
    "original_sentence": "The pastry chef was on a ___",
    "original_straight": [
      "diet",
      "break",
      "deadline"
    ],
    "original_punny": [
      "roll"
    ],
    "repair_explanation": "Added context about a winning streak to make 'on a roll' feel more natural and less predictable, while maintaining the clear double meaning with bread rolls.",
    "claudecode_explanation": "\"On a roll\" means doing well and bread/pastry rolls. Clean idiom play for a pastry chef. Standard but effective.",
    "claudecode_rating": 6
  },
  {
    "id": 94,
    "sentence": "The railroad worker's weak excuse failed to gain any ___",
    "straight": [
      "credibility",
      "support",
      "momentum"
    ],
    "punny": [
      "traction"
    ],
    "original_sentence": "The railroad worker's excuse didn't gain any ___",
    "original_straight": [
      "credibility",
      "support",
      "sympathy"
    ],
    "original_punny": [
      "traction"
    ],
    "repair_explanation": "Changed 'didn't gain' to 'failed to gain' for better flow and added 'weak' to emphasize why the excuse would fail to gain traction, making both meanings clearer.",
    "claudecode_explanation": "\"Traction\" means support/momentum and railroad/wheel traction. Both meanings work naturally in the sentence.",
    "claudecode_rating": 6
  },
  {
    "id": 95,
    "sentence": "The chicken farmer's ambitious plans never seemed to ___",
    "straight": [
      "work out",
      "succeed",
      "come together"
    ],
    "punny": [
      "hatch",
      "fly"
    ],
    "original_sentence": "The chicken farmer's plans didn't ___",
    "original_straight": [
      "work",
      "succeed",
      "materialize"
    ],
    "original_punny": [
      "hatch",
      "fly"
    ],
    "repair_explanation": "Added 'ambitious' and changed to 'never seemed to' for better rhythm and to emphasize the ongoing failure, making both puns about unrealized potential feel more natural.",
    "claudecode_explanation": "\"Hatch\" means come to fruition and eggs hatching. \"Fly\" means succeed and what chickens famously can't do. Two decent puns with the chicken connection.",
    "claudecode_rating": 6
  },
  {
    "id": 97,
    "sentence": "The florist's new business was surprisingly ___",
    "straight": [
      "struggling",
      "failing",
      "unsuccessful"
    ],
    "punny": [
      "blooming",
      "rosy"
    ],
    "original_sentence": "The florist's business was ___",
    "original_straight": [
      "thriving",
      "successful",
      "profitable"
    ],
    "original_punny": [
      "blooming",
      "rosy"
    ],
    "repair_explanation": "The original was too predictable - of course a florist's business would be 'blooming.' Adding 'surprisingly' and flipping to negative straight answers creates actual surprise when the punny answer reveals the business is doing well despite expectations.",
    "claudecode_explanation": "\"Blooming\" and \"rosy\" both mean positive and relate to flowers. Clean but extremely predictable for a florist joke.",
    "claudecode_rating": 5
  },
  {
    "id": 98,
    "sentence": "The seamstress was hanging by a ___",
    "straight": [
      "moment",
      "second",
      "hair"
    ],
    "punny": [
      "thread"
    ],
    "original_sentence": "The thread maker was at the end of his ___",
    "original_straight": [
      "patience",
      "wits",
      "tolerance"
    ],
    "original_punny": [
      "rope",
      "thread"
    ],
    "repair_explanation": "Changed from 'thread maker' to 'seamstress' for clearer profession connection, and used 'hanging by a thread' idiom instead of 'end of rope' to make the thread connection more direct and natural.",
    "claudecode_explanation": "\"Hanging by a thread\" means barely surviving and sewing thread. Classic idiom that maps perfectly to seamstress work.",
    "claudecode_rating": 6
  },
  {
    "id": 99,
    "sentence": "The blacksmith's timing was always ___",
    "straight": [
      "perfect",
      "excellent",
      "impeccable"
    ],
    "punny": [
      "striking"
    ],
    "original_sentence": "The blacksmith struck while the iron was ___",
    "original_straight": [
      "available",
      "ready",
      "there"
    ],
    "original_punny": [
      "hot"
    ],
    "repair_explanation": "The original just completed a famous idiom with no surprise. This version makes 'striking' the pun word, playing on both 'striking timing' (impressive) and the literal striking action blacksmiths do with hammers.",
    "claudecode_explanation": "\"Striking\" means remarkable and hammering metal on an anvil. Both meanings are active and vivid. Good for a blacksmith.",
    "claudecode_rating": 6
  },
  {
    "id": 101,
    "sentence": "The coin collector hated ___",
    "straight": [
      "disruption",
      "instability",
      "uncertainty"
    ],
    "punny": [
      "change"
    ],
    "original_sentence": "The coin collector thought change was ___",
    "original_straight": [
      "difficult",
      "hard",
      "challenging"
    ],
    "original_punny": [
      "good",
      "valuable"
    ],
    "repair_explanation": "Moved 'change' from the setup to the punchline where it belongs, and flipped the sentiment - now the irony is that a coin collector (who loves coins/change) hates change (alteration), creating a proper contradiction-based pun.",
    "claudecode_explanation": "\"Change\" means change in routine/life and monetary change (coins). Nice irony — a coin collector who hates change. Both meanings are strong.",
    "claudecode_rating": 6
  },
  {
    "id": 102,
    "sentence": "The optometrist's business strategy was clearly ___",
    "straight": [
      "brilliant",
      "genius",
      "excellent"
    ],
    "punny": [
      "shortsighted",
      "out of focus"
    ],
    "original_sentence": "The optometrist's ideas were often ___",
    "original_straight": [
      "ignored",
      "dismissed",
      "rejected"
    ],
    "original_punny": [
      "shortsighted",
      "out of focus"
    ],
    "repair_explanation": "Added 'clearly' for irony and flipped the straight answers to positive ones, making the punny answers more surprising since they contradict the positive setup while maintaining the vision/planning double meaning.",
    "claudecode_explanation": "\"Shortsighted\" means lacking foresight and a vision condition. For an optometrist's business strategy to be shortsighted is perfectly ironic. Clean dual meaning.",
    "claudecode_rating": 6
  },
  {
    "id": 103,
    "sentence": "After dental surgery, the patient found the doctor's pills hard to ___",
    "straight": [
      "take",
      "manage",
      "handle"
    ],
    "punny": [
      "swallow",
      "digest"
    ],
    "original_sentence": "The dentist's advice was hard to ___",
    "original_straight": [
      "follow",
      "accept",
      "understand"
    ],
    "original_punny": [
      "swallow",
      "digest"
    ],
    "repair_explanation": "The original had no real connection between dental advice and swallowing/digesting. Now it's about post-surgery medication, making both the literal difficulty swallowing pills and the figurative difficulty accepting medicine work together.",
    "claudecode_explanation": "\"Hard to swallow\" means hard to accept and literally difficult to swallow after dental surgery. The post-surgery context makes the literal meaning work perfectly.",
    "claudecode_rating": 6
  },
  {
    "id": 104,
    "sentence": "When the cobbler got mugged, he was lucky the thieves didn't steal his ___",
    "straight": [
      "tools",
      "wallet",
      "shoes"
    ],
    "punny": [
      "sole",
      "heels"
    ],
    "original_sentence": "The shoe repairman had to save his ___",
    "original_straight": [
      "money",
      "energy",
      "resources"
    ],
    "original_punny": [
      "sole",
      "heels"
    ],
    "repair_explanation": "Changed from a vague 'saving' scenario to a specific mugging situation where not losing your 'sole/soul' becomes both literal (shoe part) and figurative (spiritual essence), making the double meaning sharper and more surprising.",
    "claudecode_explanation": "\"Sole\" sounds like \"soul\" — thieves didn't steal his sole/soul. For a cobbler, sole is literal. \"Heels\" means bad people and shoe heels. Fun scenario but somewhat forced.",
    "claudecode_rating": 5
  },
  {
    "id": 105,
    "sentence": "The surgeon-comedian had the audience in ___",
    "straight": [
      "tears",
      "hysterics",
      "awe"
    ],
    "punny": [
      "stitches"
    ],
    "original_sentence": "The comedian had the audience in ___",
    "original_straight": [
      "tears",
      "hysterics"
    ],
    "original_punny": [
      "stitches"
    ],
    "repair_explanation": "The original just used the idiom 'in stitches' without real double meaning. Adding 'surgeon' creates a professional context where 'stitches' means both uncontrollable laughter and literal medical sutures.",
    "claudecode_explanation": "\"In stitches\" means laughing hard and surgical stitches. The compound identity of surgeon-comedian makes both meanings fire simultaneously. Simple and effective.",
    "claudecode_rating": 7
  },
  {
    "id": 106,
    "sentence": "The loan officer's jokes were so bad they earned zero ___",
    "straight": [
      "laughs",
      "applause",
      "smiles"
    ],
    "punny": [
      "interest"
    ],
    "original_sentence": "The banker's excuses just didn't add ___",
    "original_straight": [
      "up",
      "value",
      "anything"
    ],
    "original_punny": [
      "interest"
    ],
    "repair_explanation": "Shifted from excuses to jokes, making 'earning zero interest' work both financially (no profit) and socially (no engagement), while creating a more natural conversational flow than the awkward 'add interest' phrasing.",
    "claudecode_explanation": "\"Interest\" means audience engagement and financial interest. A loan officer's bad jokes earning zero interest — both meanings are equally strong. Clean.",
    "claudecode_rating": 7
  },
  {
    "id": 107,
    "sentence": "After the plumber's divorce, his love life went down the ___",
    "straight": [
      "tubes",
      "toilet"
    ],
    "punny": [
      "drain"
    ],
    "original_sentence": "The plumber's business went down the ___",
    "original_straight": [
      "tubes",
      "toilet"
    ],
    "original_punny": [
      "drain"
    ],
    "repair_explanation": "Added a personal angle (divorce) to make the familiar 'down the drain' pun feel fresher and more emotionally resonant, while keeping the tight plumbing connection intact.",
    "claudecode_explanation": "\"Down the drain\" means wasted/ruined and literal plumbing drains. A plumber's love life going down the drain is fitting. Classic idiom play.",
    "claudecode_rating": 5
  },
  {
    "id": 108,
    "sentence": "The glass maker's lies were completely ___",
    "straight": [
      "obvious",
      "exposed",
      "detected"
    ],
    "punny": [
      "transparent",
      "clear"
    ],
    "original_sentence": "The window installer's future was ___",
    "original_straight": [
      "uncertain",
      "bleak",
      "grim"
    ],
    "original_punny": [
      "clear",
      "transparent"
    ],
    "repair_explanation": "Switched from future predictions to lies being exposed, making 'transparent/clear' work as both glass properties and the idea that his deception was see-through, creating a more clever and ironic twist.",
    "claudecode_explanation": "\"Transparent\" means obviously false and see-through like glass. A glass maker whose lies are transparent — the irony is perfect. Tight dual meaning.",
    "claudecode_rating": 7
  },
  {
    "id": 109,
    "sentence": "The drummer was struggling to find his ___",
    "straight": [
      "confidence",
      "motivation",
      "purpose"
    ],
    "punny": [
      "rhythm",
      "beat"
    ],
    "original_sentence": "The drummer couldn't beat the ___",
    "original_straight": [
      "competition",
      "deadline",
      "odds"
    ],
    "original_punny": [
      "rhythm",
      "drums"
    ],
    "repair_explanation": "The original had the pun word 'beat' in the setup and created a logical contradiction (drummers should be able to beat drums). The repair moves the wordplay to the blank where 'rhythm/beat' works as both musical timing and life's natural flow.",
    "claudecode_explanation": "\"Finding his rhythm/beat\" means finding his groove in life and musical rhythm. But for a drummer, these words are so closely tied to the profession that there's little surprise.",
    "claudecode_rating": 4
  },
  {
    "id": 110,
    "sentence": "The apiarist's pickup lines were absolutely ___",
    "straight": [
      "terrible",
      "cheesy",
      "awkward"
    ],
    "punny": [
      "sweet",
      "buzzing"
    ],
    "original_sentence": "The bee keeper's business was really ___",
    "original_straight": [
      "successful",
      "profitable",
      "thriving"
    ],
    "original_punny": [
      "buzzing",
      "sweet"
    ],
    "repair_explanation": "Changed from business success to pickup lines, making 'sweet' work as both honey-related and charming/romantic, while 'buzzing' suggests both bee sounds and creating excitement, adding romantic comedy to the bee theme.",
    "claudecode_explanation": "\"Sweet\" means charming and honey-sweet (bees make honey). \"Buzzing\" means exciting and bee buzzing. Decent but neither pun is particularly surprising for a beekeeper joke.",
    "claudecode_rating": 5
  },
  {
    "id": 111,
    "sentence": "The math teacher needed therapy because she couldn't stop bringing work ___",
    "straight": [
      "home",
      "everywhere",
      "along"
    ],
    "punny": [
      "problems"
    ],
    "original_sentence": "The math book was sad because it had too many ___",
    "original_straight": [
      "pages",
      "chapters",
      "errors"
    ],
    "original_punny": [
      "problems"
    ],
    "repair_explanation": "Changed from the overused 'sad math book' setup to a more relatable teacher scenario. The pun is tighter because 'bringing work problems home' naturally flows while maintaining the math/emotional problems double meaning.",
    "claudecode_explanation": "\"Problems\" means personal issues (therapy) and math problems. The ambiguity is perfect — she can't stop bringing her work problems home, and both readings make complete sense. Clever.",
    "claudecode_rating": 7
  },
  {
    "id": 112,
    "sentence": "After the power outage, the lamp store owner's mood was surprisingly ___",
    "straight": [
      "cheerful",
      "upbeat",
      "positive"
    ],
    "punny": [
      "bright",
      "lit"
    ],
    "original_sentence": "The lamp store's future was looking ___",
    "original_straight": [
      "grim",
      "uncertain",
      "bleak"
    ],
    "original_punny": [
      "bright",
      "lit"
    ],
    "repair_explanation": "Added the power outage context to create irony and make 'surprisingly bright/lit' more unexpected. The contrast between no power and a bright mood makes the pun more clever and less predictable.",
    "claudecode_explanation": "After a power outage, a lamp store would be dark, not bright or lit. The setup contradicts the punchline — his mood shouldn't be \"surprisingly bright\" since that would be expected, not surprising.",
    "claudecode_rating": 3
  },
  {
    "id": 114,
    "sentence": "The loan officer's dating life suffered because he kept calculating the ___",
    "straight": [
      "costs",
      "risks",
      "odds"
    ],
    "punny": [
      "interest"
    ],
    "original_sentence": "The banker quit because he lost all ___",
    "original_straight": [
      "motivation",
      "confidence",
      "patience"
    ],
    "original_punny": [
      "interest"
    ],
    "repair_explanation": "Shifted from a generic 'banker quits' to a more specific dating scenario. 'Calculating interest' works both as romantic interest and financial interest, creating a fresher angle on the classic banking pun.",
    "claudecode_explanation": "\"Interest\" means romantic interest and financial interest rate. Same pun as joke 106 but in a dating context. Repetitive within this set.",
    "claudecode_rating": 5
  },
  {
    "id": 120,
    "sentence": "The stand-up comedian avoided breakfast meetings because eggs always ___",
    "straight": [
      "heckled",
      "interrupted",
      "complained"
    ],
    "punny": [
      "crack"
    ],
    "original_sentence": "The eggs refused to trade jokes because they might ___",
    "original_straight": [
      "argue",
      "fight",
      "panic"
    ],
    "original_punny": [
      "crack"
    ],
    "repair_explanation": "Reframed as a comedian's perspective to make the setup more natural and surprising. 'Eggs always crack' works as both heckling/laughing at jokes and physically breaking, with better comedic timing.",
    "claudecode_explanation": "\"Crack\" means crack jokes and crack eggs. But a comedian avoiding cracking doesn't make sense — comedians want to make people crack up. The logic is backwards.",
    "claudecode_rating": 3
  },
  {
    "id": 123,
    "sentence": "The comedian loved gardening because it helped him develop new ___",
    "straight": [
      "ideas",
      "routines",
      "material"
    ],
    "punny": [
      "plots"
    ],
    "original_sentence": "The comedian loved gardening because it always gave him new ___",
    "original_straight": [
      "ideas",
      "topics",
      "material"
    ],
    "original_punny": [
      "plots"
    ],
    "repair_explanation": "Changed 'gave him new' to 'helped him develop new' to make 'plots' sound more natural in comedy context, since comedians develop plots/storylines rather than just receive them.",
    "claudecode_explanation": "\"Plots\" means comedy plots/storylines and garden plots. Developing new plots works naturally in both contexts. Good dual meaning.",
    "claudecode_rating": 6
  },
  {
    "id": 124,
    "sentence": "The electrician's argument was convincing because it carried a lot of ___",
    "straight": [
      "power",
      "force",
      "energy"
    ],
    "punny": [
      "charge"
    ],
    "original_sentence": "The electrician’s argument was convincing because it carried a lot of ___",
    "original_straight": [
      "power",
      "force",
      "energy"
    ],
    "original_punny": [
      "charge"
    ],
    "repair_explanation": "This joke is already well-crafted and doesn't need repair. The double meaning of 'charge' (electrical charge and argumentative force) works naturally in both contexts.",
    "claudecode_explanation": "\"Charge\" means emotional force/persuasiveness and electrical charge. Both meanings are strong in context. Clean and natural.",
    "claudecode_rating": 6
  },
  {
    "id": 126,
    "sentence": "The opera singer's apartment hunt failed because every place felt too ___",
    "straight": [
      "small",
      "expensive",
      "noisy"
    ],
    "punny": [
      "flat"
    ],
    "original_sentence": "The musician got fired because his performance was always a bit too ___",
    "original_straight": [
      "late",
      "messy",
      "rough"
    ],
    "original_punny": [
      "flat"
    ],
    "repair_explanation": "Changed from a firing scenario to apartment hunting, making 'too flat' work as both lacking character/boring and being a flat (apartment). The opera singer context maintains the musical connection while creating a fresh angle.",
    "claudecode_explanation": "\"Flat\" means an apartment (British English) and off-pitch/flat singing. An opera singer finding every place too flat — the dual meaning is brilliant and unexpected.",
    "claudecode_rating": 8
  },
  {
    "id": 127,
    "sentence": "The geometry teacher loved the beach because it had so many perfect ___",
    "straight": [
      "views",
      "spots",
      "curves"
    ],
    "punny": [
      "angles"
    ],
    "original_sentence": "The geometry teacher left the beach because there were too many ___",
    "original_straight": [
      "people",
      "waves",
      "seagulls"
    ],
    "original_punny": [
      "angles"
    ],
    "repair_explanation": "The original had no clear reason why a beach would have 'too many angles.' The repair makes both meanings work: beaches naturally have many visual angles/perspectives, and a geometry teacher would appreciate finding perfect angles in nature.",
    "claudecode_explanation": "\"Angles\" means geometric angles and visual angles/perspectives. The beach connection is decent but the pun is mild — both meanings aren't equally surprising.",
    "claudecode_rating": 5
  },
  {
    "id": 128,
    "sentence": "The baker quit because the job required too much ___",
    "straight": [
      "effort",
      "work",
      "stress"
    ],
    "punny": [
      "kneading"
    ],
    "original_sentence": "The baker changed careers because the hours were too ___",
    "original_straight": [
      "long",
      "brutal",
      "demanding"
    ],
    "original_punny": [
      "kneading"
    ],
    "repair_explanation": "The original 'hours were too kneading' was grammatically broken. Changing to 'required too much kneading' makes it grammatically correct while preserving the kneading/needing homophone pun.",
    "claudecode_explanation": "\"Kneading\" sounds like \"needing\" but \"too much kneading\" doesn't naturally map to \"too much needing.\" The homophone connection is there but the sentence doesn't support both readings.",
    "claudecode_rating": 4
  },
  {
    "id": 129,
    "sentence": "The baker's financial plan was simple: make more ___",
    "straight": [
      "money",
      "profit",
      "income"
    ],
    "punny": [
      "dough"
    ],
    "original_sentence": "The baker’s financial plan was simple: make more ___",
    "original_straight": [
      "money",
      "profit",
      "income"
    ],
    "original_punny": [
      "dough"
    ],
    "repair_explanation": "This joke was already well-constructed with a clean setup and natural double meaning. No repair needed - both the money slang and baking ingredient meanings work perfectly.",
    "claudecode_explanation": "\"Dough\" means money and bread dough. This is the most overused pun in comedy and appears multiple times in this set. No freshness.",
    "claudecode_rating": 4
  },
  {
    "id": 130,
    "sentence": "The lawyer's comedy career flopped because all his material was too ___",
    "straight": [
      "technical",
      "dry",
      "complicated"
    ],
    "punny": [
      "brief"
    ],
    "original_sentence": "The lawyer kept his jokes short because he specialized in the ___",
    "original_straight": [
      "basics",
      "summary",
      "overview"
    ],
    "original_punny": [
      "brief"
    ],
    "repair_explanation": "Changed from a positive trait (specializing in briefs) to a comedy failure (material too brief), making the irony sharper. The contradiction between needing longer material for comedy success versus lawyer's habit of being brief creates better tension.",
    "claudecode_explanation": "\"Brief\" means short/concise and a legal brief. A lawyer's comedy material being too brief — both meanings work perfectly and the career crossover adds irony.",
    "claudecode_rating": 7
  },
  {
    "id": 131,
    "sentence": "The dentist hired candidates who had experience with ___",
    "straight": [
      "procedures",
      "patients",
      "equipment"
    ],
    "punny": [
      "fillings"
    ],
    "original_sentence": "The dentist’s favorite type of job candidate was someone with good ___",
    "original_straight": [
      "skills",
      "focus",
      "experience"
    ],
    "original_punny": [
      "fillings"
    ],
    "repair_explanation": "The original tried to force 'fillings' to sound like 'feelings' but they're too different. The repair focuses on the literal meaning - dentists actually work with fillings, making it a natural job requirement rather than a forced homophone.",
    "claudecode_explanation": "\"Fillings\" means dental fillings and filling positions/roles. But \"experience with fillings\" only naturally reads as dental fillings. The hiring meaning is a stretch.",
    "claudecode_rating": 4
  },
  {
    "id": 132,
    "sentence": "The guitarist loved traffic because it gave him time to practice his ___",
    "straight": [
      "scales",
      "chords",
      "timing"
    ],
    "punny": [
      "jams"
    ],
    "original_sentence": "The musician hated driving to rehearsal because of all the ___",
    "original_straight": [
      "cars",
      "delays",
      "congestion"
    ],
    "original_punny": [
      "jams"
    ],
    "repair_explanation": "Flipped from hating traffic to loving it, creating an unexpected positive spin. Now the musician benefits from traffic jams to practice musical jams, making both meanings work harmoniously rather than one being negative.",
    "claudecode_explanation": "\"Jams\" means traffic jams and musical jam sessions. A guitarist loving traffic because of jams — clever scenario that makes both meanings work simultaneously.",
    "claudecode_rating": 6
  },
  {
    "id": 133,
    "sentence": "The drummer was great at making ___",
    "straight": [
      "music",
      "noise",
      "sounds"
    ],
    "punny": [
      "beats"
    ],
    "original_sentence": "The drummer got hired because he had excellent ___",
    "original_straight": [
      "timing",
      "control",
      "practice"
    ],
    "original_punny": [
      "beats"
    ],
    "repair_explanation": "The original had no real double meaning since 'beats' only worked in the musical sense. Now 'beats' works as both drum rhythms and as slang for making/creating something cool or impressive.",
    "claudecode_explanation": "\"Beats\" as drum beats and... making beats. There's no real second meaning here — both uses are essentially musical. This isn't a pun, just a literal statement.",
    "claudecode_rating": 3
  },
  {
    "id": 134,
    "sentence": "The librarian's romance novels were gathering dust on the ___",
    "straight": [
      "table",
      "counter",
      "desk"
    ],
    "punny": [
      "shelf"
    ],
    "original_sentence": "The librarian loved suspense because it always kept her on the ___",
    "original_straight": [
      "edge",
      "hook",
      "seat"
    ],
    "original_punny": [
      "shelf"
    ],
    "repair_explanation": "The original forced connection between 'on the shelf' and suspense didn't work. Now 'on the shelf' works both literally (where books sit) and idiomatically (unused/neglected), creating a proper double meaning about neglected romance novels.",
    "claudecode_explanation": "\"On the shelf\" means left unpursued (said of relationships) and literal library shelves. The idiom fits naturally with both the romance and librarian contexts.",
    "claudecode_rating": 6
  },
  {
    "id": 135,
    "sentence": "The chef quit because he couldn't stand the ___",
    "straight": [
      "pressure",
      "stress",
      "hours"
    ],
    "punny": [
      "heat"
    ],
    "original_sentence": "The chef got promoted because he could handle the kitchen ___",
    "original_straight": [
      "pressure",
      "stress",
      "rush"
    ],
    "original_punny": [
      "heat"
    ],
    "repair_explanation": "The original was too obvious since 'kitchen heat' is already a common idiom. By changing to 'couldn't stand the heat,' it references the famous saying while maintaining the literal/figurative double meaning more cleverly.",
    "claudecode_explanation": "\"Couldn't stand the heat\" references the saying \"if you can't stand the heat, get out of the kitchen.\" Classic, well-known, and the chef context makes it literal too.",
    "claudecode_rating": 6
  },
  {
    "id": 136,
    "sentence": "The carpenter's band never got popular because their music was too ___",
    "straight": [
      "rough",
      "raw",
      "unpolished"
    ],
    "punny": [
      "wooden"
    ],
    "original_sentence": "The carpenter’s favorite music was anything with a good ___",
    "original_straight": [
      "rhythm",
      "melody",
      "hook"
    ],
    "original_punny": [
      "saw"
    ],
    "repair_explanation": "The original 'saw' connection was forced and obscure. 'Wooden' works much better as both a carpentry material and as meaning stiff/awkward performance, creating a natural double meaning for why a carpenter's band might fail.",
    "claudecode_explanation": "\"Wooden\" means stiff/uninspired (performance) and literally made of wood. Both meanings work well in the carpenter-musician crossover.",
    "claudecode_rating": 6
  },
  {
    "id": 138,
    "sentence": "The fisherman stayed optimistic because he knew there was always another ___",
    "straight": [
      "opportunity",
      "chance",
      "day"
    ],
    "punny": [
      "catch"
    ],
    "original_sentence": "The fisherman stayed optimistic because he always focused on the ___",
    "original_straight": [
      "future",
      "goal",
      "plan"
    ],
    "original_punny": [
      "catch"
    ],
    "repair_explanation": "The original 'focused on the catch' was awkward phrasing that didn't clearly convey optimism. 'Another catch' works both as another fish to catch and as another opportunity/chance, making the optimism clear.",
    "claudecode_explanation": "\"Catch\" means opportunity/good thing and fishing catch. \"Always another catch\" works as both optimism about fish and about life. Clean but mild.",
    "claudecode_rating": 5
  },
  {
    "id": 139,
    "sentence": "The house painter was so easygoing because he always went with the ___",
    "straight": [
      "plan",
      "mood",
      "consensus"
    ],
    "punny": [
      "flow"
    ],
    "original_sentence": "The painter got along with everyone because he always went with the ___",
    "original_straight": [
      "plan",
      "process",
      "schedule"
    ],
    "original_punny": [
      "flow"
    ],
    "repair_explanation": "Added 'house painter' to make the paint connection stronger, since 'flow' is more specifically relevant to paint application than general artistry. This makes both meanings of 'flow' work better.",
    "claudecode_explanation": "\"Flow\" means going along with things and... paint flow? The connection between \"flow\" and house painting is weak. Paint flows, but that's not what \"went with the flow\" means.",
    "claudecode_rating": 4
  },
  {
    "id": 140,
    "sentence": "The artist was great at relationships because he knew how to ___ people in",
    "straight": [
      "bring",
      "pull",
      "win"
    ],
    "punny": [
      "draw"
    ],
    "original_sentence": "The artist was great at relationships because he knew how to ___",
    "original_straight": [
      "compromise",
      "listen",
      "adapt"
    ],
    "original_punny": [
      "draw"
    ],
    "repair_explanation": "Added 'people in' to complete the phrasal verb 'draw in,' making the relationship meaning clearer while maintaining the artistic double meaning. Now both senses work naturally in the sentence.",
    "claudecode_explanation": "\"Draw people in\" means attract/engage and literally drawing (art). Both meanings work well and the phrasing is natural.",
    "claudecode_rating": 6
  },
  {
    "id": 141,
    "sentence": "The therapist who treated musicians always took detailed ___",
    "straight": [
      "records",
      "observations",
      "reports"
    ],
    "punny": [
      "notes"
    ],
    "original_sentence": "The therapist who treated musicians said most problems came down to ___",
    "original_straight": [
      "habits",
      "stress",
      "expectations"
    ],
    "original_punny": [
      "notes"
    ],
    "repair_explanation": "Changed from the awkward 'problems came down to notes' to 'took detailed notes,' which is natural phrasing that works perfectly for both therapy notes and musical notes.",
    "claudecode_explanation": "\"Notes\" means therapy session notes and musical notes. A therapist treating musicians taking detailed notes — both readings are natural and simultaneous.",
    "claudecode_rating": 6
  },
  {
    "id": 142,
    "sentence": "The detective specialized in bakery thefts because every case left a clear ___",
    "straight": [
      "trail",
      "path",
      "trace"
    ],
    "punny": [
      "crumb"
    ],
    "original_sentence": "The detective loved bread cases because every clue left a clear ___",
    "original_straight": [
      "sign",
      "mark",
      "path"
    ],
    "original_punny": [
      "crumb"
    ],
    "repair_explanation": "Changed 'bread cases' to 'bakery thefts' for clearer context, and 'left a clear crumb' works better than the original since crumb trails are actual evidence in bakery crimes while also being detective clues.",
    "claudecode_explanation": "\"Crumb\" is a trail/clue and literal bread crumbs. The bakery theft detective concept is fun but \"left a clear crumb\" isn't natural phrasing — it should be \"crumb trail.\"",
    "claudecode_rating": 5
  },
  {
    "id": 145,
    "sentence": "The cameraman never panicked during chaos because he always stayed in ___",
    "straight": [
      "control",
      "character",
      "line"
    ],
    "punny": [
      "focus"
    ],
    "original_sentence": "The cameraman stayed calm because he always kept things in ___",
    "original_straight": [
      "order",
      "control",
      "check"
    ],
    "original_punny": [
      "focus"
    ],
    "repair_explanation": "The original was too predictable with 'kept things in focus.' Changed to 'stayed in focus' which sounds more natural and makes the pun less obvious while maintaining both meanings.",
    "claudecode_explanation": "\"In focus\" means concentrated/calm and camera focus. Both meanings work well for a cameraman staying composed during chaos.",
    "claudecode_rating": 6
  },
  {
    "id": 146,
    "sentence": "The tailor was terrible at debates because his arguments always came ___",
    "straight": [
      "undone",
      "apart",
      "loose"
    ],
    "punny": [
      "unraveled"
    ],
    "original_sentence": "The tailor loved arguments because he always had a strong ___",
    "original_straight": [
      "point",
      "case",
      "reason"
    ],
    "original_punny": [
      "seam"
    ],
    "repair_explanation": "The original failed because 'strong seam' has no meaning in argument contexts. 'Unraveled' works perfectly - arguments unravel (fall apart) and seams literally unravel in tailoring.",
    "claudecode_explanation": "\"Came unraveled\" means fell apart logically and fabric unraveling. Classic idiom that maps perfectly to a tailor.",
    "claudecode_rating": 6
  },
  {
    "id": 147,
    "sentence": "The musician's relationship ended badly - they were constantly out of ___",
    "straight": [
      "sync",
      "step",
      "sorts"
    ],
    "punny": [
      "tune"
    ],
    "original_sentence": "The musician’s breakup was polite but final: the relationship was out of ___",
    "original_straight": [
      "time",
      "options",
      "luck"
    ],
    "original_punny": [
      "tune"
    ],
    "repair_explanation": "Simplified the setup to make 'out of tune' flow more naturally. The original was wordy and the pun works better with 'constantly out of tune' describing ongoing relationship discord.",
    "claudecode_explanation": "\"Out of tune\" means not in sync (relationship) and musically off-key. Both work but it's a very predictable musician relationship joke.",
    "claudecode_rating": 5
  },
  {
    "id": 148,
    "sentence": "The cow became a philosopher because she loved to ___",
    "straight": [
      "ponder",
      "reflect",
      "contemplate"
    ],
    "punny": [
      "ruminate"
    ],
    "original_sentence": "The goat became a motivational speaker because he was good at chewing on ___",
    "original_straight": [
      "ideas",
      "topics",
      "questions"
    ],
    "original_punny": [
      "cud"
    ],
    "repair_explanation": "Changed from goat/cud to cow/ruminate. 'Ruminate' perfectly means both literal chewing (what cows do) and deep thinking (what philosophers do), creating a natural double meaning.",
    "claudecode_explanation": "\"Ruminate\" means to think deeply and is the biological term for a cow chewing cud. Both meanings are strong, the word is unexpected, and it's genuinely witty. Excellent word choice.",
    "claudecode_rating": 7
  },
  {
    "id": 149,
    "sentence": "The chess master's risky strategy backfired - it was a terrible ___",
    "straight": [
      "mistake",
      "decision",
      "blunder"
    ],
    "punny": [
      "gambit"
    ],
    "original_sentence": "The chess player stayed humble because pride is a dangerous ___",
    "original_straight": [
      "habit",
      "weakness",
      "flaw"
    ],
    "original_punny": [
      "gambit"
    ],
    "repair_explanation": "The original was fine but predictable. Reframed to show a failed gambit, making both chess and general strategy meanings work while adding narrative tension about the outcome.",
    "claudecode_explanation": "\"Gambit\" is literally a chess term, so saying a chess master's strategy was a terrible gambit is circular — it's using a chess word to describe chess. No real double meaning.",
    "claudecode_rating": 4
  },
  {
    "id": 150,
    "sentence": "The baker's favorite comedy shows were the ones that really made the audience ___",
    "straight": [
      "laugh",
      "smile",
      "chuckle"
    ],
    "punny": [
      "rise"
    ],
    "original_sentence": "The baker’s favorite kind of comedy was anything that rose to the ___",
    "original_straight": [
      "top",
      "occasion",
      "moment"
    ],
    "original_punny": [
      "yeast"
    ],
    "repair_explanation": "The original forced 'yeast' into an unnatural phrase. Changed to use 'rise' which works both as making an audience 'rise' (stand up in applause/laughter) and connects to bread rising in baking.",
    "claudecode_explanation": "\"Rise\" means stand up in excitement and bread rising. The audience rising connects to comedy, and baker rising connects to baking. Decent crossover.",
    "claudecode_rating": 5
  },
  {
    "id": 151,
    "sentence": "The fisherman avoided certain restaurants because the waiters always tried to reel him ___",
    "straight": [
      "back",
      "over",
      "around"
    ],
    "punny": [
      "in"
    ],
    "original_sentence": "The fisherman hated elevators because they always seemed to reel him ___",
    "original_straight": [
      "in",
      "back",
      "around"
    ],
    "original_punny": [
      "up"
    ],
    "repair_explanation": "Fixed the awkward 'reel up' phrasing by using the natural fishing expression 'reel in' and changing the context to restaurants trying to 'reel in' customers, which works perfectly for both meanings.",
    "claudecode_explanation": "\"Reel in\" means to persuade/attract and fishing reeling. But restaurant waiters \"reeling in\" customers is already using the fishing metaphor — so the fisherman context doesn't add a new meaning.",
    "claudecode_rating": 4
  },
  {
    "id": 152,
    "sentence": "The accountant's camping hobby was expensive because she always bought the most expensive ___",
    "straight": [
      "gear",
      "equipment",
      "supplies"
    ],
    "punny": [
      "cents"
    ],
    "original_sentence": "The accountant liked camping because it helped her keep track of her ___",
    "original_straight": [
      "supplies",
      "gear",
      "food"
    ],
    "original_punny": [
      "tents"
    ],
    "repair_explanation": "The original had no clear accounting connection with 'tents.' Changed to use 'cents' which sounds like 'tents' and directly relates to her accounting profession dealing with money.",
    "claudecode_explanation": "\"Cents\" is supposed to sound like \"tents\" for camping, but cents and tents don't actually sound alike. This pun simply doesn't work.",
    "claudecode_rating": 2
  },
  {
    "id": 153,
    "sentence": "The comedian quit the bakery because his jokes there always seemed to ___",
    "straight": [
      "fail",
      "bomb",
      "flop"
    ],
    "punny": [
      "fall flat"
    ],
    "original_sentence": "The comedian opened a bakery because the jokes finally started to ___",
    "original_straight": [
      "work",
      "land",
      "connect"
    ],
    "original_punny": [
      "roll"
    ],
    "repair_explanation": "Fixed the backwards logic by having him quit (not open) the bakery because jokes 'fall flat' - which works as both comedy failure and flat bread/pastries in baking.",
    "claudecode_explanation": "\"Fall flat\" means fail and flat as in unleavened bread. The baker context makes the literal meaning work. Standard idiom play.",
    "claudecode_rating": 5
  },
  {
    "id": 154,
    "sentence": "The orchestra director loved having a good ___",
    "straight": [
      "rhythm",
      "tempo",
      "beat"
    ],
    "punny": [
      "rest"
    ],
    "original_sentence": "The orchestra’s worst enemy was a sudden ___",
    "original_straight": [
      "delay",
      "problem",
      "setback"
    ],
    "original_punny": [
      "pause"
    ],
    "repair_explanation": "Changed from negative 'worst enemy' to positive context since musical rests aren't bad. Now 'rest' works as both a musical notation and taking a break, making both meanings positive.",
    "claudecode_explanation": "\"Rest\" means relaxation and a musical rest (a pause notation). Both meanings work naturally for an orchestra director.",
    "claudecode_rating": 5
  },
  {
    "id": 155,
    "sentence": "The cat became a lawyer because it was always good at making valid ___",
    "straight": [
      "arguments",
      "points",
      "claims"
    ],
    "punny": [
      "paws"
    ],
    "original_sentence": "The cat became a lawyer because it loved raising ___",
    "original_straight": [
      "issues",
      "questions",
      "concerns"
    ],
    "original_punny": [
      "paws"
    ],
    "repair_explanation": "The original 'raising paws' had no clear legal meaning. Changed to 'making valid paws' which sounds like 'valid points' - a clear legal concept - while cats literally make/have paws.",
    "claudecode_explanation": "\"Paws\" sounds like \"pause\" but \"making valid paws\" isn't a phrase. \"Making a valid pause\" barely works either. The sentence doesn't support both readings.",
    "claudecode_rating": 3
  },
  {
    "id": 156,
    "sentence": "The dog became a therapist because it was great at helping people work through their ___",
    "straight": [
      "issues",
      "problems",
      "conflicts"
    ],
    "punny": [
      "ruff"
    ],
    "original_sentence": "The dog became a judge because it was good at seeing both ___",
    "original_straight": [
      "sides",
      "views",
      "positions"
    ],
    "original_punny": [
      "barks"
    ],
    "repair_explanation": "The original 'seeing both barks' made no sense in any context. Changed to use 'ruff' which sounds like 'rough' (as in rough patches/problems) while being a dog sound, creating a proper double meaning.",
    "claudecode_explanation": "\"Ruff\" sounds like \"rough\" and is a dog bark sound. But \"work through their ruff\" isn't natural English. Forced homophone.",
    "claudecode_rating": 3
  },
  {
    "id": 157,
    "sentence": "The bee started a small company and called it a buzzing ___",
    "straight": [
      "startup",
      "venture",
      "business"
    ],
    "punny": [
      "hive"
    ],
    "original_sentence": "The bee started a small company and called it a real ___",
    "original_straight": [
      "startup",
      "venture",
      "business"
    ],
    "original_punny": [
      "hive"
    ],
    "repair_explanation": "The original 'real hive' was awkward phrasing. Changed to 'buzzing hive' which flows naturally - businesses can be described as 'buzzing' with activity, and bees literally make hives buzz.",
    "claudecode_explanation": "\"Hive\" means a busy workplace hub and a bee hive. \"Buzzing hive\" works for both an active business and bee colony. Decent though expected.",
    "claudecode_rating": 5
  },
  {
    "id": 158,
    "sentence": "The geologist's comedy career took off because all his jokes were ___",
    "straight": [
      "solid",
      "strong",
      "reliable"
    ],
    "punny": [
      "gneiss"
    ],
    "original_sentence": "The geologist’s jokes were solid because they always had a good ___",
    "original_straight": [
      "point",
      "structure",
      "base"
    ],
    "original_punny": [
      "foundation"
    ],
    "repair_explanation": "The original was decent but predictable with 'foundation.' Changed to use 'gneiss' (a type of rock) which sounds like 'nice' - making his jokes both literally rock-related and colloquially good.",
    "claudecode_explanation": "\"Gneiss\" is a type of metamorphic rock that sounds like \"nice.\" For a geologist's comedy being gneiss/nice — it's a clever homophone that most people wouldn't see coming.",
    "claudecode_rating": 6
  },
  {
    "id": 159,
    "sentence": "The beer critic quit philosophy school because he preferred studying the ___",
    "straight": [
      "practical",
      "tangible",
      "immediate"
    ],
    "punny": [
      "draft"
    ],
    "original_sentence": "The bartender became a philosopher because he spent years pondering the ___",
    "original_straight": [
      "meaning",
      "purpose",
      "truth"
    ],
    "original_punny": [
      "draft"
    ],
    "repair_explanation": "Switched to a beer critic leaving academia for practical beer study, making the career change more believable. The contrast between abstract philosophical drafts and concrete beer drafts creates a funnier professional pivot.",
    "claudecode_explanation": "\"Draft\" means beer on draft and a philosophical/written draft. A beer critic preferring to study drafts over philosophical drafts — both meanings are clean and the career switch is fun.",
    "claudecode_rating": 6
  },
  {
    "id": 160,
    "sentence": "The fisherman opened a stationery shop and said he was really ___ in customers",
    "straight": [
      "bringing",
      "drawing",
      "pulling"
    ],
    "punny": [
      "reeling"
    ],
    "original_sentence": "The fisherman opened a stationery shop and said the sales were really ___",
    "original_straight": [
      "good",
      "steady",
      "strong"
    ],
    "original_punny": [
      "reeling"
    ],
    "repair_explanation": "The original 'sales were really reeling' was problematic because 'reeling' typically means struggling or staggering. Changed to 'reeling in customers' which works positively for both fishing (reeling in fish) and business (attracting customers).",
    "claudecode_explanation": "\"Reeling in\" means attracting customers and fishing reeling. The scenario of a fisherman opening a stationery shop is odd enough to be amusing. Works but the mashup feels random.",
    "claudecode_rating": 4
  },
  {
    "id": 162,
    "sentence": "The fish got a job at the produce market because it was great with ___",
    "straight": [
      "weighing",
      "measuring",
      "portions"
    ],
    "punny": [
      "scales"
    ],
    "original_sentence": "The fish got a job in accounting because it was great with ___",
    "original_straight": [
      "numbers",
      "details",
      "records"
    ],
    "original_punny": [
      "scales"
    ],
    "repair_explanation": "Moved from accounting to produce market where scales are actually used for weighing, making the fish scales/weighing scales connection much more natural and relevant.",
    "claudecode_explanation": "\"Scales\" means fish scales and weighing scales at a produce market. Both meanings are natural and the job crossover makes sense.",
    "claudecode_rating": 6
  },
  {
    "id": 163,
    "sentence": "The baker got promoted because his work always rose to the ___",
    "straight": [
      "occasion",
      "challenge",
      "standard"
    ],
    "punny": [
      "proof"
    ],
    "original_sentence": "The baker got promoted because he always delivered under ___",
    "original_straight": [
      "pressure",
      "stress",
      "deadlines"
    ],
    "original_punny": [
      "proof"
    ],
    "repair_explanation": "Changed from the unnatural 'under proof' to 'rose to the proof' which plays on bread rising during proofing and meeting the test/proof of quality expectations.",
    "claudecode_explanation": "\"Proof\" means proving competence and proofing dough (the rising stage). The word \"rose\" in the setup reinforces the baking meaning. Layered.",
    "claudecode_rating": 5
  },
  {
    "id": 164,
    "sentence": "The poet became a sailor because he loved working with ___",
    "straight": [
      "ropes",
      "lines",
      "rigging"
    ],
    "punny": [
      "verse"
    ],
    "original_sentence": "The poet quit carpentry because every board had too much ___",
    "original_straight": [
      "damage",
      "wear",
      "splintering"
    ],
    "original_punny": [
      "verse"
    ],
    "repair_explanation": "Completely reframed from carpentry to sailing, where 'verse' sounds like 'verse' (poetry lines) but also connects to nautical terminology, and 'lines' works for both ship rigging and poetry.",
    "claudecode_explanation": "\"Verse\" means poetry verse and... there's no sailing-related meaning of verse. \"Adverse\" or \"traverse\" would need to be the word. This pun doesn't work.",
    "claudecode_rating": 2
  },
  {
    "id": 165,
    "sentence": "The electrician's favorite kind of story had a powerful ___",
    "straight": [
      "ending",
      "message",
      "impact"
    ],
    "punny": [
      "charge"
    ],
    "original_sentence": "The electrician’s favorite kind of story had a shocking ___",
    "original_straight": [
      "ending",
      "twist",
      "reveal"
    ],
    "original_punny": [
      "charge"
    ],
    "repair_explanation": "Removed the redundant 'shocking' which was already an electrical pun, replacing it with 'powerful' which works for both electrical power and compelling storytelling without being redundant.",
    "claudecode_explanation": "\"Charge\" means emotional power and electrical charge. Same pun as joke 124. Clean but repetitive within this set.",
    "claudecode_rating": 5
  },
  {
    "id": 166,
    "sentence": "The librarian loved reading because she could never stop after one ___",
    "straight": [
      "page",
      "book",
      "story"
    ],
    "punny": [
      "chapter"
    ],
    "original_sentence": "The librarian hated dieting because she could never stop after one ___",
    "original_straight": [
      "snack",
      "meal",
      "bite"
    ],
    "original_punny": [
      "chapter"
    ],
    "repair_explanation": "The original connected dieting to reading through 'chapter,' but chapters aren't diet-related. Changed to reading context where 'chapter' naturally fits both meanings - book sections and the inability to stop reading.",
    "claudecode_explanation": "\"Chapter\" means book chapter and... that's it. A librarian who loves reading and can't stop after one chapter is just a literal statement. No double meaning.",
    "claudecode_rating": 2
  },
  {
    "id": 167,
    "sentence": "The gardener refused to gossip because he didn't want to spread ___",
    "straight": [
      "rumors",
      "stories",
      "lies"
    ],
    "punny": [
      "dirt"
    ],
    "original_sentence": "The gardener refused to gossip because he didn’t want to spread ___",
    "original_straight": [
      "rumors",
      "stories",
      "lies"
    ],
    "original_punny": [
      "mulch"
    ],
    "repair_explanation": "Replaced 'mulch' with 'dirt' because it creates a stronger double meaning - gardeners literally spread dirt, and 'spreading dirt' is a common idiom for gossip, making both meanings work perfectly.",
    "claudecode_explanation": "\"Spread dirt\" means spread gossip and literally spread soil/dirt. The gardener refusing to gossip because he doesn't want to spread dirt — both idiom and literal readings work.",
    "claudecode_rating": 6
  },
  {
    "id": 168,
    "sentence": "The barber quit law school because he preferred making a clean ___",
    "straight": [
      "living",
      "start",
      "break"
    ],
    "punny": [
      "cut"
    ],
    "original_sentence": "The barber loved debate because he always made a sharp ___",
    "original_straight": [
      "argument",
      "point",
      "case"
    ],
    "original_punny": [
      "cut"
    ],
    "repair_explanation": "Created a career change narrative from law to barbering, with 'clean cut' working both as a precise legal severance and a neat haircut. This setup feels more natural and the double meaning is tighter.",
    "claudecode_explanation": "\"Clean cut\" means neat/presentable and a clean haircut. Both meanings are natural for a barber. Good idiom play.",
    "claudecode_rating": 6
  },
  {
    "id": 169,
    "sentence": "The dentist loved spicy food even though it always inflamed his ___",
    "straight": [
      "tongue",
      "mouth",
      "throat"
    ],
    "punny": [
      "gums"
    ],
    "original_sentence": "The dentist hated gossip because it always got under his ___",
    "original_straight": [
      "skin",
      "nerves",
      "mood"
    ],
    "original_punny": [
      "gums"
    ],
    "repair_explanation": "Changed from hating gossip to loving spicy food despite consequences, making the scenario more relatable and physical. 'Inflamed gums' works both as a dental condition and the natural result of eating spicy food.",
    "claudecode_explanation": "\"Gums\" in dental context just means gums — there's no second meaning. A dentist's gums being inflamed is purely literal. This is not a pun.",
    "claudecode_rating": 2
  },
  {
    "id": 170,
    "sentence": "The judge loved writing because it let him pass ___",
    "straight": [
      "time",
      "judgment",
      "days"
    ],
    "punny": [
      "sentence"
    ],
    "original_sentence": "The judge loved gardening because it let him pass ___",
    "original_straight": [
      "time",
      "judgment",
      "days"
    ],
    "original_punny": [
      "sentence"
    ],
    "repair_explanation": "Changed from gardening to writing because 'sentence' has no gardening meaning. In writing context, 'pass sentence' works as both delivering legal judgment and completing grammatical sentences.",
    "claudecode_explanation": "\"Pass sentence\" means deliver a legal judgment and write/complete a sentence. Both meanings are strong and the judge-to-writer connection creates a satisfying dual reading.",
    "claudecode_rating": 7
  },
  {
    "id": 171,
    "sentence": "The fisherman became a therapist because he was experienced at helping others ___",
    "straight": [
      "escape",
      "break free",
      "get loose"
    ],
    "punny": [
      "unhook"
    ],
    "original_sentence": "The fisherman became a therapist because he was good at helping people ___",
    "original_straight": [
      "relax",
      "heal",
      "cope"
    ],
    "original_punny": [
      "unhook"
    ],
    "repair_explanation": "Changed 'good at helping people' to 'experienced at helping others' and adjusted the straight answers to focus on breaking free/escaping, making 'unhook' work naturally as both releasing fish and helping people detach from problems.",
    "claudecode_explanation": "\"Unhook\" means release from emotional baggage and unhooking fish. The therapy meaning is a stretch — nobody says they need to be \"unhooked\" in therapy.",
    "claudecode_rating": 4
  },
  {
    "id": 172,
    "sentence": "The orchestra was well-prepared because they'd rehearsed every ___",
    "straight": [
      "piece",
      "section",
      "movement"
    ],
    "punny": [
      "note"
    ],
    "original_sentence": "The orchestra stayed calm because they’d practiced every possible ___",
    "original_straight": [
      "issue",
      "problem",
      "mistake"
    ],
    "original_punny": [
      "note"
    ],
    "repair_explanation": "Removed the forced 'stayed calm' setup and focused on preparation through rehearsal, making 'note' work naturally as both musical notes they practice and important details they've covered.",
    "claudecode_explanation": "\"Note\" for an orchestra is just literal — they rehearsed every musical note. There's no second meaning being activated. Not a pun.",
    "claudecode_rating": 2
  },
  {
    "id": 173,
    "sentence": "The comedian became a gardener because he enjoyed developing fresh ___",
    "straight": [
      "material",
      "content",
      "ideas"
    ],
    "punny": [
      "lines"
    ],
    "original_sentence": "The comedian became a gardener because he loved planting new ___",
    "original_straight": [
      "ideas",
      "seeds",
      "plans"
    ],
    "original_punny": [
      "lines"
    ],
    "repair_explanation": "Changed 'planting new' to 'developing fresh' to make the connection more natural, since comedians develop material/lines and gardeners develop plant lines/rows.",
    "claudecode_explanation": "\"Lines\" means comedy lines/material and garden rows/lines. A comedian developing fresh lines in a garden — the dual meaning works but is a stretch for garden \"lines.\"",
    "claudecode_rating": 4
  },
  {
    "id": 174,
    "sentence": "The chef learned that success requires knowing when to ___",
    "straight": [
      "adapt",
      "compromise",
      "yield"
    ],
    "punny": [
      "swallow"
    ],
    "original_sentence": "The chef stayed humble because pride is hard to ___",
    "original_straight": [
      "manage",
      "control",
      "avoid"
    ],
    "original_punny": [
      "swallow"
    ],
    "repair_explanation": "Moved away from the predictable 'pride is hard to swallow' idiom to create a fresh context where 'swallow' works as both accepting difficult feedback and the chef's literal swallowing/tasting.",
    "claudecode_explanation": "\"Swallow\" means accept/tolerate and physically swallowing food. But \"knowing when to swallow\" is an awkward phrase that doesn't sound natural in either context.",
    "claudecode_rating": 3
  },
  {
    "id": 175,
    "sentence": "The programmer became a baker because both jobs involve working with ___",
    "straight": [
      "batches",
      "processes",
      "recipes"
    ],
    "punny": [
      "dough"
    ],
    "original_sentence": "The programmer became a baker because both jobs require good ___",
    "original_straight": [
      "timing",
      "planning",
      "patience"
    ],
    "original_punny": [
      "loops"
    ],
    "repair_explanation": "Replaced 'loops' (which doesn't meaningfully apply to baking) with 'dough' - programmers work with code (sounds like 'dough') and bakers literally work with dough, creating a proper double meaning.",
    "claudecode_explanation": "\"Dough\" means money and bread dough. But programmers don't particularly work with money — the connection is generic. Another repetitive dough pun.",
    "claudecode_rating": 3
  },
  {
    "id": 176,
    "sentence": "The carpenter became a jazz musician because he was already an expert at making tight ___",
    "straight": [
      "connections",
      "fits",
      "bonds"
    ],
    "punny": [
      "joints"
    ],
    "original_sentence": "The carpenter became a musician because he already loved making good ___",
    "original_straight": [
      "sounds",
      "melodies",
      "music"
    ],
    "original_punny": [
      "joints"
    ],
    "repair_explanation": "The original had 'joints' without a clear musical meaning. Jazz musicians do 'jam' at joints (clubs), but 'making joints' isn't musical. The new version uses 'tight joints' which works for precise carpentry connections and tight musical collaborations/rhythm sections.",
    "claudecode_explanation": "\"Joints\" means woodworking joints and jazz joints (clubs/venues). A carpenter making tight joints transitioning to jazz — both meanings are clean and the crossover is creative.",
    "claudecode_rating": 6
  },
  {
    "id": 177,
    "sentence": "The therapist loved working at the circus because the performers were refreshingly ___",
    "straight": [
      "honest",
      "direct",
      "genuine"
    ],
    "punny": [
      "clownish"
    ],
    "original_sentence": "The therapist quit the circus because the clients were too ___",
    "original_straight": [
      "difficult",
      "chaotic",
      "dramatic"
    ],
    "original_punny": [
      "clownish"
    ],
    "repair_explanation": "The original setup was negative (quit because clients were 'too clownish'), making it predictable. Flipping to positive ('loved working because they were refreshingly clownish') creates irony - clownish behavior is usually unprofessional, but at a circus it's refreshingly appropriate.",
    "claudecode_explanation": "\"Clownish\" means silly and literally like clowns at the circus. But a therapist calling patients \"refreshingly clownish\" is professionally inappropriate and the sentence feels unnatural.",
    "claudecode_rating": 3
  },
  {
    "id": 179,
    "sentence": "The astronaut struggled as a therapist because he gave clients too much emotional ___",
    "straight": [
      "distance",
      "detachment",
      "coldness"
    ],
    "punny": [
      "space"
    ],
    "original_sentence": "The astronaut became a therapist because he understood emotional ___",
    "original_straight": [
      "distance",
      "privacy",
      "time"
    ],
    "original_punny": [
      "space"
    ],
    "repair_explanation": "The original was too predictable with the common astronaut-space connection. Making him 'struggle' because he gives 'too much space' creates better irony - astronauts work in vast space, but good therapists need to balance giving emotional space with engagement.",
    "claudecode_explanation": "\"Space\" means emotional distance and outer space. An astronaut giving too much emotional space — the irony is perfect and both meanings are equally strong. Clever and natural.",
    "claudecode_rating": 7
  },
  {
    "id": 180,
    "sentence": "The shoe designer's philosophy was that every person should follow their ___",
    "straight": [
      "dreams",
      "passion",
      "heart"
    ],
    "punny": [
      "sole"
    ],
    "original_sentence": "The shoe designer stayed optimistic because every failure was a step toward the ___",
    "original_straight": [
      "goal",
      "finish",
      "result"
    ],
    "original_punny": [
      "sole"
    ],
    "repair_explanation": "The original forced 'sole' into an awkward 'step toward the sole' construction. The new version uses the natural phrase 'follow your soul' with 'sole' as a homophone, making both the shoe connection and the inspirational meaning work seamlessly.",
    "claudecode_explanation": "\"Sole\" sounds like \"soul.\" Following your sole/soul — both the shoe and spiritual meanings work. Clean homophone pun, nicely motivational tone.",
    "claudecode_rating": 5
  },
  {
    "id": 181,
    "sentence": "The electrician's dance moves were full of surprising ___",
    "straight": [
      "spins",
      "twists",
      "moves"
    ],
    "punny": [
      "turns"
    ],
    "original_sentence": "The electrician’s autobiography was full of surprising ___",
    "original_straight": [
      "stories",
      "facts",
      "chapters"
    ],
    "original_punny": [
      "turns"
    ],
    "repair_explanation": "The original connection between 'turns' and electrical work was too weak. Dancing naturally involves 'turns' as moves, while electricians work with 'turns' of wire in coils and transformers. Both meanings now fit the context perfectly.",
    "claudecode_explanation": "\"Turns\" means dance turns and electrical... turns? Electrical turns aren't a thing. The connection to electrician work is too weak.",
    "claudecode_rating": 3
  },
  {
    "id": 183,
    "sentence": "The lawyer's favorite coffee order was always a large ___",
    "straight": [
      "latte",
      "americano",
      "cappuccino"
    ],
    "punny": [
      "brief"
    ],
    "original_sentence": "The lawyer loved coffee because it helped him build a stronger ___",
    "original_straight": [
      "case",
      "argument",
      "plan"
    ],
    "original_punny": [
      "brief"
    ],
    "repair_explanation": "The original setup forced a connection between coffee and legal work that didn't exist naturally. The new version works because 'brief' is both a legal document and a type of short/strong coffee drink, making both meanings fit the coffee order context.",
    "claudecode_explanation": "\"Brief\" means a legal brief and brief/short. But \"a large brief\" is an oxymoron — a brief can't be large. The sentence contradicts itself.",
    "claudecode_rating": 2
  },
  {
    "id": 184,
    "sentence": "The musician's complaint was simple: the venue had terrible ___",
    "straight": [
      "sound",
      "lighting",
      "staff"
    ],
    "punny": [
      "tone"
    ],
    "original_sentence": "The musician’s complaint was simple: the venue had terrible ___",
    "original_straight": [
      "sound",
      "lighting",
      "staff"
    ],
    "original_punny": [
      "tone"
    ],
    "repair_explanation": "This joke actually works well as-is. 'Tone' naturally refers to both musical sound quality and the general atmosphere/attitude of a venue, making it a solid double meaning that doesn't need repair.",
    "claudecode_explanation": "\"Tone\" for a musician in a venue means both acoustic tone and atmosphere tone, but these are essentially the same thing. No real double meaning.",
    "claudecode_rating": 3
  },
  {
    "id": 185,
    "sentence": "The butcher's wife never worried about his job because he had nerves of ___",
    "straight": [
      "steel",
      "iron",
      "stone"
    ],
    "punny": [
      "veal"
    ],
    "original_sentence": "The butcher stayed calm because he had nerves of ___",
    "original_straight": [
      "steel",
      "iron",
      "stone"
    ],
    "original_punny": [
      "meat"
    ],
    "repair_explanation": "Changed from 'meat' to 'veal' for a tighter sound-alike pun with 'steel,' and reframed to focus on the wife's perspective, making the scenario more relatable and conversational.",
    "claudecode_explanation": "\"Veal\" is supposed to sound like \"steel\" (nerves of steel) but veal and steel don't sound similar enough. This homophone doesn't work.",
    "claudecode_rating": 3
  },
  {
    "id": 186,
    "sentence": "The food critic loved working at the bakery because all the feedback was surprisingly ___",
    "straight": [
      "positive",
      "helpful",
      "constructive"
    ],
    "punny": [
      "sweet"
    ],
    "original_sentence": "The author quit the bakery because every review was too ___",
    "original_straight": [
      "harsh",
      "negative",
      "mean"
    ],
    "original_punny": [
      "crusty"
    ],
    "repair_explanation": "Flipped from negative to positive feedback and changed 'crusty' to 'sweet' for a more natural bakery connection, making the double meaning (kind feedback vs. sweet baked goods) more seamless.",
    "claudecode_explanation": "\"Sweet\" means positive/kind feedback and sweet-tasting baked goods. Both meanings work in the bakery context. Clean but predictable.",
    "claudecode_rating": 5
  },
  {
    "id": 187,
    "sentence": "The cyclist's philosophy professor said he needed to break the ___",
    "straight": [
      "habit",
      "pattern",
      "routine"
    ],
    "punny": [
      "cycle"
    ],
    "original_sentence": "The cyclist loved philosophy because it helped him find his ___",
    "original_straight": [
      "direction",
      "path",
      "purpose"
    ],
    "original_punny": [
      "cycle"
    ],
    "repair_explanation": "The original 'find his cycle' wasn't natural philosophical language. The new version works because 'break the cycle' is a common philosophical/psychological phrase about breaking patterns, while also referencing the bicycle cycle that cyclists use.",
    "claudecode_explanation": "\"Break the cycle\" means end a repetitive pattern and break a bicycle. Both meanings work well — the philosopher advising the cyclist creates a fun dual reading.",
    "claudecode_rating": 6
  },
  {
    "id": 188,
    "sentence": "The teacher became a gardener because she wanted to find her ___",
    "straight": [
      "purpose",
      "passion",
      "calling"
    ],
    "punny": [
      "roots"
    ],
    "original_sentence": "The teacher became a gardener because grading papers was making her lose her ___",
    "original_straight": [
      "patience",
      "sleep",
      "mind"
    ],
    "original_punny": [
      "roots"
    ],
    "repair_explanation": "The original used 'lose her roots' which isn't a natural idiom. Changed to 'find her roots' which works both literally (gardening with plant roots) and metaphorically (finding one's origins/grounding).",
    "claudecode_explanation": "\"Roots\" means heritage/origins and plant roots. \"Find her roots\" works in both the personal and gardening senses. Standard but effective.",
    "claudecode_rating": 5
  },
  {
    "id": 189,
    "sentence": "The stand-up comedian opened a bank because customers always left with more ___",
    "straight": [
      "money",
      "cash",
      "savings"
    ],
    "punny": [
      "interest"
    ],
    "original_sentence": "The comedian became a banker because he was great at earning ___",
    "original_straight": [
      "money",
      "profits",
      "income"
    ],
    "original_punny": [
      "interest"
    ],
    "repair_explanation": "Reframed to focus on customer outcomes rather than the comedian's skills, making the pun feel more surprising and creating a clearer cause-and-effect relationship between comedy and banking.",
    "claudecode_explanation": "\"Interest\" means engagement/curiosity and financial interest. A comedian's bank where customers leave with more interest — clever scenario where both meanings are strong.",
    "claudecode_rating": 6
  },
  {
    "id": 190,
    "sentence": "The librarian's favorite books to recommend were the heavy ___",
    "straight": [
      "classics",
      "textbooks",
      "novels"
    ],
    "punny": [
      "volumes"
    ],
    "original_sentence": "The librarian’s favorite kind of workout was lifting heavy ___",
    "original_straight": [
      "boxes",
      "weights",
      "bags"
    ],
    "original_punny": [
      "volumes"
    ],
    "repair_explanation": "The original awkwardly tried to connect workout terminology with books. Reframed as book recommendations where 'heavy volumes' works naturally as both weighty books and large book volumes.",
    "claudecode_explanation": "\"Volumes\" means book volumes and loudness/amount. \"Heavy volumes\" works as both weighty books and significant amounts. Decent.",
    "claudecode_rating": 5
  },
  {
    "id": 191,
    "sentence": "The musician loved carpentry because both crafts require good ___",
    "straight": [
      "precision",
      "technique",
      "practice"
    ],
    "punny": [
      "composition"
    ],
    "original_sentence": "The musician loved woodworking because both crafts depend on good ___",
    "original_straight": [
      "practice",
      "timing",
      "focus"
    ],
    "original_punny": [
      "harmony"
    ],
    "repair_explanation": "The original used 'harmony' which has no real woodworking meaning. Changed to 'composition' which works for both musical composition and the composition/arrangement of wood pieces in carpentry.",
    "claudecode_explanation": "\"Composition\" means musical composition and structural composition. But carpentry composition isn't standard terminology — carpenters don't typically use that word. Forced.",
    "claudecode_rating": 3
  },
  {
    "id": 192,
    "sentence": "The baker's memoir was honest about the daily ___",
    "straight": [
      "work",
      "stress",
      "routine"
    ],
    "punny": [
      "grind"
    ],
    "original_sentence": "The baker’s memoir was honest about the daily ___",
    "original_straight": [
      "work",
      "stress",
      "routine"
    ],
    "original_punny": [
      "grind"
    ],
    "repair_explanation": "This joke already works perfectly with 'grind' meaning both the literal grinding of grains in baking and the metaphorical 'daily grind' of routine work. No repair needed.",
    "claudecode_explanation": "\"Grind\" means hard work/daily grind and grinding grain/flour. A baker's memoir about the daily grind — both meanings are equally natural. Clean.",
    "claudecode_rating": 6
  },
  {
    "id": 193,
    "sentence": "The wedding photographer refused to work divorces because they involved too much ___",
    "straight": [
      "drama",
      "conflict",
      "emotion"
    ],
    "punny": [
      "exposure"
    ],
    "original_sentence": "The photographer hated arguments because they always escalated into ___",
    "original_straight": [
      "drama",
      "conflict",
      "mess"
    ],
    "original_punny": [
      "exposure"
    ],
    "repair_explanation": "Created a more specific and relatable scenario (wedding vs. divorce photography) that makes the 'exposure' pun more pointed—both revealing embarrassing details and photographic technique.",
    "claudecode_explanation": "\"Exposure\" means emotional vulnerability and camera exposure. A wedding photographer refusing divorce work due to \"too much exposure\" — both readings are strong. Smart scenario.",
    "claudecode_rating": 7
  },
  {
    "id": 194,
    "sentence": "The orchestra conductor made an excellent judge because she never let anyone ___",
    "straight": [
      "interrupt",
      "object",
      "speak"
    ],
    "punny": [
      "rest"
    ],
    "original_sentence": "The judge was a great musician because he always knew when to call a ___",
    "original_straight": [
      "stop",
      "break",
      "pause"
    ],
    "original_punny": [
      "rest"
    ],
    "repair_explanation": "Flipped the professions and reframed around control/authority, making 'rest' work as both 'take it easy/relax' (judicial) and musical notation, while creating a more dynamic scenario about maintaining order.",
    "claudecode_explanation": "\"Rest\" means relaxation and a musical rest (pause). A conductor-judge who never lets anyone rest — the career crossover makes both meanings active.",
    "claudecode_rating": 6
  },
  {
    "id": 195,
    "sentence": "The chef stopped dating comedians because every meal ended with a ___",
    "straight": [
      "story",
      "performance",
      "routine"
    ],
    "punny": [
      "roast"
    ],
    "original_sentence": "The chef stopped dating comedians because every dinner came with a ___",
    "original_straight": [
      "joke",
      "story",
      "bit"
    ],
    "original_punny": [
      "punchline"
    ],
    "repair_explanation": "The original had no culinary double meaning for 'punchline.' Changed to 'roast' which works as both a cooking method (chef context) and a comedy format where comedians mock/tease people.",
    "claudecode_explanation": "\"Roast\" means a comedy roast and cooking a roast. Every meal with a comedian ending with a roast — both meanings fire perfectly. Tight and funny.",
    "claudecode_rating": 7
  },
  {
    "id": 196,
    "sentence": "The dentist became a gardener because he loved working with ___",
    "straight": [
      "plants",
      "soil",
      "flowers"
    ],
    "punny": [
      "roots"
    ],
    "original_sentence": "The dentist became a poet because he loved working with ___",
    "original_straight": [
      "words",
      "rhythm",
      "sound"
    ],
    "original_punny": [
      "verse"
    ],
    "repair_explanation": "The original 'verse' had no dental meaning. Changed to dentist-to-gardener with 'roots' which works as both tooth roots (dental) and plant roots (gardening), creating a natural double meaning.",
    "claudecode_explanation": "\"Roots\" means tooth roots and plant roots. A dentist becoming a gardener for roots — clean crossover but predictable and the same pun as joke 188.",
    "claudecode_rating": 5
  },
  {
    "id": 197,
    "sentence": "The electrician loved staying up-to-date because he always followed the ___",
    "straight": [
      "news",
      "trends",
      "times"
    ],
    "punny": [
      "current"
    ],
    "original_sentence": "The electrician hated indecision because it wasted too much ___",
    "original_straight": [
      "time",
      "energy",
      "effort"
    ],
    "original_punny": [
      "current"
    ],
    "repair_explanation": "The original setup about indecision was awkward and the connection weak. Reframed around staying informed, where 'current' naturally means both electrical current and current events/information.",
    "claudecode_explanation": "\"Current\" means current events and electrical current. An electrician following the current — clean but this is the same pun used in joke 243 and elsewhere. Repetitive.",
    "claudecode_rating": 5
  },
  {
    "id": 198,
    "sentence": "The baker was terrible at the gym because he could never do enough ___",
    "straight": [
      "pushups",
      "situps",
      "pullups"
    ],
    "punny": [
      "rolls"
    ],
    "original_sentence": "The baker quit the gym because every coach kept yelling about more ___",
    "original_straight": [
      "effort",
      "work",
      "training"
    ],
    "original_punny": [
      "reps"
    ],
    "repair_explanation": "The original 'reps' had no baking connection. Changed to 'rolls' which works as both exercise rolls (ab rolls, etc.) and the bread rolls a baker makes.",
    "claudecode_explanation": "\"Rolls\" means exercise rolls and bread rolls. A baker bad at gym rolls — fun scenario with clear dual meaning.",
    "claudecode_rating": 6
  },
  {
    "id": 199,
    "sentence": "The gardener's business thrived because customers never felt ___",
    "straight": [
      "unwelcome",
      "ignored",
      "rushed"
    ],
    "punny": [
      "uprooted"
    ],
    "original_sentence": "The gardener liked quiet conversations because they never got out of ___",
    "original_straight": [
      "hand",
      "control",
      "line"
    ],
    "original_punny": [
      "hand"
    ],
    "repair_explanation": "The original had 'hand' as both straight and punny answer with no real double meaning. 'Uprooted' works as both feeling displaced/unsettled and the literal gardening action of removing plants from soil.",
    "claudecode_explanation": "\"Uprooted\" means displaced/uncomfortable and plants being uprooted. Customers not feeling uprooted at a garden business — both meanings work. Fresh word choice.",
    "claudecode_rating": 6
  },
  {
    "id": 200,
    "sentence": "The violinist avoided spicy food because it made her playing too ___",
    "straight": [
      "shaky",
      "erratic",
      "unstable"
    ],
    "punny": [
      "sharp"
    ],
    "original_sentence": "The violinist stayed calm because panic would only make things more ___",
    "original_straight": [
      "messy",
      "hard",
      "worse"
    ],
    "original_punny": [
      "stringy"
    ],
    "repair_explanation": "The original 'stringy' was awkward and didn't work naturally in the sentence. 'Sharp' works as both overly intense/harsh playing and the musical term for playing above pitch.",
    "claudecode_explanation": "\"Sharp\" means spicy/intense and musically sharp (above correct pitch). Spicy food making violin playing sharp — both meanings are vivid and the causal link works.",
    "claudecode_rating": 6
  },
  {
    "id": 201,
    "sentence": "The banker's favorite genre was mystery because it kept him in ___",
    "straight": [
      "doubt",
      "suspense",
      "wonder"
    ],
    "punny": [
      "interest"
    ],
    "original_sentence": "The banker’s favorite genre was mystery because it kept him in ___",
    "original_straight": [
      "doubt",
      "suspense",
      "wonder"
    ],
    "original_punny": [
      "interest"
    ],
    "repair_explanation": "This joke was already working well with 'interest' meaning both engagement with mysteries and financial interest. No repair needed, just keeping the effective original.",
    "claudecode_explanation": "\"Interest\" means curiosity and financial interest. Yet another interest pun — fourth or fifth in this set. Even if it works, the repetition kills it.",
    "claudecode_rating": 4
  },
  {
    "id": 202,
    "sentence": "The carpenter's favorite kind of joke was one with a sharp ___",
    "straight": [
      "ending",
      "twist",
      "line"
    ],
    "punny": [
      "point"
    ],
    "original_sentence": "The carpenter’s favorite kind of joke was one with a sharp ___",
    "original_straight": [
      "ending",
      "twist",
      "line"
    ],
    "original_punny": [
      "point"
    ],
    "repair_explanation": "This joke was already working effectively with 'point' referring to both the punchline of a joke and the sharp tip of carpentry tools. No repair needed.",
    "claudecode_explanation": "\"Point\" means the point/purpose of a joke and a sharp tool point. Both meanings work for a carpenter who likes pointed jokes. Clean.",
    "claudecode_rating": 5
  },
  {
    "id": 203,
    "sentence": "The baker's astronomy hobby helped him perfect his ___",
    "straight": [
      "timing",
      "technique",
      "skills"
    ],
    "punny": [
      "rise"
    ],
    "original_sentence": "The baker loved astronomy because it always gave him a reason to rise before ___",
    "original_straight": [
      "sunrise",
      "dawn",
      "morning"
    ],
    "original_punny": [
      "daybreak"
    ],
    "repair_explanation": "The original had the pun word 'rise' in the setup instead of the blank, and 'daybreak' had no baking meaning. Now 'rise' works as both bread rising (baking) and celestial objects rising (astronomy).",
    "claudecode_explanation": "\"Rise\" means bread rising and astronomical rising. But \"astronomy helping perfect his rise\" doesn't make sense in either context. Forced connection.",
    "claudecode_rating": 3
  },
  {
    "id": 204,
    "sentence": "The lawyer loved camping because it taught him the importance of a good ___",
    "straight": [
      "foundation",
      "strategy",
      "plan"
    ],
    "punny": [
      "case"
    ],
    "original_sentence": "The lawyer loved camping because it taught him how to build a stronger ___",
    "original_straight": [
      "case",
      "argument",
      "defense"
    ],
    "original_punny": [
      "tent"
    ],
    "repair_explanation": "The original 'tent' had no legal meaning. Now 'case' works as both a legal case and a camping gear case/container, making both professions relevant to the pun.",
    "claudecode_explanation": "\"Case\" means legal case and camping case/container. But \"camping taught the importance of a good case\" is awkward — you'd say bag or pack, not case.",
    "claudecode_rating": 4
  },
  {
    "id": 205,
    "sentence": "The musician quit carpentry because every mistake hit a sour ___",
    "straight": [
      "spot",
      "point",
      "moment"
    ],
    "punny": [
      "note"
    ],
    "original_sentence": "The musician quit carpentry because every mistake sounded like a ___",
    "original_straight": [
      "problem",
      "error",
      "issue"
    ],
    "original_punny": [
      "note"
    ],
    "repair_explanation": "Changed 'sounded like' to 'hit a sour' to make the musical connection clearer and more natural. 'Sour note' is a common expression that works for both bad music and mistakes.",
    "claudecode_explanation": "\"Sour note\" means a mistake and a bad musical note. But the carpentry connection is weak — carpentry mistakes aren't typically described as hitting sour notes.",
    "claudecode_rating": 4
  },
  {
    "id": 206,
    "sentence": "The writer loved legal thrillers because they always ended with a satisfying ___",
    "straight": [
      "verdict",
      "ending",
      "result"
    ],
    "punny": [
      "sentence"
    ],
    "original_sentence": "The chef loved legal thrillers because they always ended with a satisfying ___",
    "original_straight": [
      "verdict",
      "ending",
      "result"
    ],
    "original_punny": [
      "sentence"
    ],
    "repair_explanation": "Changed 'chef' to 'writer' to make the setup relevant to both meanings of 'sentence' - now it connects writing (grammatical sentences) with legal outcomes (prison sentences).",
    "claudecode_explanation": "\"Sentence\" means legal sentence (punishment) and a written sentence. A writer loving legal thrillers for their satisfying sentences — both meanings are equally strong.",
    "claudecode_rating": 6
  },
  {
    "id": 207,
    "sentence": "The librarian loved her new apartment because it had great ___",
    "straight": [
      "lighting",
      "space",
      "character"
    ],
    "punny": [
      "volume"
    ],
    "original_sentence": "The librarian dated a baker and said the relationship had real ___",
    "original_straight": [
      "chemistry",
      "spark",
      "promise"
    ],
    "original_punny": [
      "volume"
    ],
    "repair_explanation": "Removed the forced baker relationship and made it about an apartment, where 'volume' naturally means both spaciousness and books (which a librarian would appreciate having room for).",
    "claudecode_explanation": "\"Volume\" means space/size of an apartment and book volumes. But \"great volume\" for an apartment means it's spacious, which is a stretch of the word's usage.",
    "claudecode_rating": 4
  },
  {
    "id": 208,
    "sentence": "The photographer was so focused on his work that he could barely hear his own ___",
    "straight": [
      "thoughts",
      "breathing",
      "heartbeat"
    ],
    "punny": [
      "shutter"
    ],
    "original_sentence": "The photographer loved silence because it helped him hear his own ___",
    "original_straight": [
      "thoughts",
      "mind",
      "ideas"
    ],
    "original_punny": [
      "shutter"
    ],
    "repair_explanation": "The original setup about silence was awkward because you don't \"hear your own shutter\" as a natural phrase. The new version creates a scenario where being so focused makes it hard to hear anything, including the camera's shutter clicking.",
    "claudecode_explanation": "\"Shutter\" is a camera part, not a homophone for \"shudder\" — they're different words with different spellings and slightly different pronunciations. The pun doesn't land.",
    "claudecode_rating": 3
  },
  {
    "id": 209,
    "sentence": "The electrician quit politics after his campaign completely lost ___",
    "straight": [
      "momentum",
      "support",
      "steam"
    ],
    "punny": [
      "power"
    ],
    "original_sentence": "The electrician hated politics because every debate ended in ___",
    "original_straight": [
      "conflict",
      "anger",
      "chaos"
    ],
    "original_punny": [
      "gridlock"
    ],
    "repair_explanation": "Changed from 'gridlock' to 'power' for a tighter electrical connection. 'Lost power' works perfectly for both electrical systems and political campaigns, making the double meaning more direct and punchy.",
    "claudecode_explanation": "\"Power\" means political power and electrical power. An electrician losing power in a campaign — both meanings are strong and the career switch is fun.",
    "claudecode_rating": 6
  },
  {
    "id": 210,
    "sentence": "The baker's favorite kind of bread was one that had plenty of time to ___",
    "straight": [
      "rise",
      "proof",
      "develop"
    ],
    "punny": [
      "settle"
    ],
    "original_sentence": "The baker’s favorite kind of disagreement was one that ended in ___",
    "original_straight": [
      "peace",
      "agreement",
      "silence"
    ],
    "original_punny": [
      "settlement"
    ],
    "repair_explanation": "The original had no real baking connection to 'settlement.' The new version uses 'settle' which works for both bread dough settling/resting during the baking process and as a way disagreements can be resolved.",
    "claudecode_explanation": "\"Settle\" means rest/prove (dough settling?) and settling down. But bread doesn't \"settle\" — it rises or proofs. The baking meaning doesn't work.",
    "claudecode_rating": 3
  },
  {
    "id": 211,
    "sentence": "The judge became a gardener because he loved making snap ___",
    "straight": [
      "decisions",
      "choices",
      "calls"
    ],
    "punny": [
      "judgments"
    ],
    "original_sentence": "The judge became a gardener because he enjoyed passing ___",
    "original_straight": [
      "time",
      "days",
      "hours"
    ],
    "original_punny": [
      "judgment"
    ],
    "repair_explanation": "The original 'passing judgment' had no gardening meaning. 'Snap judgments' works because judges make quick decisions, and snap peas/beans are common garden plants that gardeners grow and harvest.",
    "claudecode_explanation": "\"Snap judgments\" means quick decisions, which relates to a judge, but gardening has no connection to \"snap\" or \"judgments.\" The pun is one-sided.",
    "claudecode_rating": 4
  },
  {
    "id": 212,
    "sentence": "The barber's philosophy lectures were popular because he always made the ___",
    "straight": [
      "point",
      "connection",
      "argument"
    ],
    "punny": [
      "cut"
    ],
    "original_sentence": "The barber loved philosophy because it helped him find the meaning of a good ___",
    "original_straight": [
      "life",
      "day",
      "plan"
    ],
    "original_punny": [
      "cut"
    ],
    "repair_explanation": "Reframed to focus on his teaching style rather than what he finds. 'Made the cut' works as both succeeding/qualifying (philosophy) and literally cutting hair, creating a more natural and surprising punchline.",
    "claudecode_explanation": "\"Made the cut\" means qualified/succeeded and making a haircut. Both meanings work for a barber giving popular lectures. Clean idiom play.",
    "claudecode_rating": 6
  },
  {
    "id": 215,
    "sentence": "The banker became a beekeeper because he wanted to earn ___",
    "straight": [
      "money",
      "income",
      "profit"
    ],
    "punny": [
      "honey"
    ],
    "original_sentence": "The banker became a beekeeper because he preferred earning honest ___",
    "original_straight": [
      "money",
      "income",
      "profit"
    ],
    "original_punny": [
      "interest"
    ],
    "repair_explanation": "The original used 'interest' which has no connection to bees or beekeeping. Changed to 'honey' which works as both what bees produce and slang for money, making both professions relevant to the pun.",
    "claudecode_explanation": "\"Honey\" as slang for money is outdated and not widely used. The beekeeper connection is obvious but the pun relies on dead slang.",
    "claudecode_rating": 3
  },
  {
    "id": 216,
    "sentence": "The dentist's favorite kind of comedy always had a clean ___",
    "straight": [
      "ending",
      "finish",
      "wrap-up"
    ],
    "punny": [
      "bite"
    ],
    "original_sentence": "The dentist’s favorite kind of comedy always had a clean ___",
    "original_straight": [
      "ending",
      "finish",
      "wrap-up"
    ],
    "original_punny": [
      "bite"
    ],
    "repair_explanation": "This joke already works well - 'bite' functions as both dental terminology and comedic sharpness/edge, while 'clean' connects to both dental hygiene and clean comedy. No repair needed.",
    "claudecode_explanation": "\"Bite\" means sharpness/wit in comedy and dental bite. Both meanings are active — a dentist who likes comedy with a clean bite. Decent.",
    "claudecode_rating": 5
  },
  {
    "id": 217,
    "sentence": "The librarian loved fishing because she always got plenty of ___",
    "straight": [
      "fish",
      "catches",
      "trout"
    ],
    "punny": [
      "bites"
    ],
    "original_sentence": "The librarian loved cooking because recipes always came with clear ___",
    "original_straight": [
      "steps",
      "directions",
      "instructions"
    ],
    "original_punny": [
      "lines"
    ],
    "repair_explanation": "The original 'lines' connection was too generic and weak. Changed to fishing context where 'bites' works as both fish biting the hook and lines of text that librarians read, creating a stronger double meaning.",
    "claudecode_explanation": "\"Bites\" in fishing makes sense, but what's the library connection? A librarian fishing for bites has no meaningful library double meaning.",
    "claudecode_rating": 2
  },
  {
    "id": 218,
    "sentence": "The electrician quit the band because he couldn't handle the constant ___",
    "straight": [
      "noise",
      "chaos",
      "arguments"
    ],
    "punny": [
      "static"
    ],
    "original_sentence": "The electrician quit the band because he couldn’t handle the constant ___",
    "original_straight": [
      "noise",
      "chaos",
      "arguments"
    ],
    "original_punny": [
      "static"
    ],
    "repair_explanation": "This joke already works effectively - 'static' functions perfectly as both electrical interference (electrician's work) and band friction/complaints. The dual meaning is natural and the setup flows well.",
    "claudecode_explanation": "\"Static\" means complaints/friction and electrical static. An electrician quitting a band over constant static — both meanings are strong.",
    "claudecode_rating": 6
  },
  {
    "id": 219,
    "sentence": "The baker always checked the weather because humidity could ruin the ___",
    "straight": [
      "bread",
      "dough",
      "batch"
    ],
    "punny": [
      "proof"
    ],
    "original_sentence": "The baker’s least favorite weather was anything that ruined the ___",
    "original_straight": [
      "day",
      "plans",
      "traffic"
    ],
    "original_punny": [
      "proof"
    ],
    "repair_explanation": "The original was awkwardly phrased and didn't flow naturally. Reframed to focus on humidity affecting bread proofing, which makes the weather connection more logical and the sentence more conversational.",
    "claudecode_explanation": "\"Proof\" means bread proofing (rising stage) and evidence/proof. But the weather setup only connects to baking proof, not evidentiary proof. One-sided pun.",
    "claudecode_rating": 4
  },
  {
    "id": 220,
    "sentence": "The wildlife photographer was terrible at keeping secrets because he always gave away the ___",
    "straight": [
      "details",
      "information",
      "truth"
    ],
    "punny": [
      "shot"
    ],
    "original_sentence": "The photographer hated lies because they always showed up in the final ___",
    "original_straight": [
      "print",
      "image",
      "result"
    ],
    "original_punny": [
      "exposure"
    ],
    "repair_explanation": "Switched from 'exposure' to 'shot' and changed the scenario to wildlife photography. 'Gave away the shot' works as both revealing a secret and ruining a photo opportunity, making it more surprising and natural.",
    "claudecode_explanation": "\"Shot\" means a photograph and revealing a secret (gave away the shot). Both meanings work for a wildlife photographer. Decent.",
    "claudecode_rating": 5
  },
  {
    "id": 221,
    "sentence": "The judge was excellent at organizing because she could always crack the ___",
    "straight": [
      "problem",
      "mystery",
      "puzzle"
    ],
    "punny": [
      "case"
    ],
    "original_sentence": "The judge stayed calm because panic would only worsen the ___",
    "original_straight": [
      "situation",
      "conflict",
      "mess"
    ],
    "original_punny": [
      "case"
    ],
    "repair_explanation": "Reframed to focus on problem-solving skills rather than staying calm. 'Crack the case' works for both solving legal cases and opening/organizing physical cases, creating a more active and engaging scenario.",
    "claudecode_explanation": "\"Crack the case\" means solve it, which fits detectives, not judges. Judges don't crack cases. And the \"organizing\" setup doesn't connect. Mismatched.",
    "claudecode_rating": 3
  },
  {
    "id": 222,
    "sentence": "The comedian chef's restaurant failed because his jokes were too ___",
    "straight": [
      "crude",
      "offensive",
      "inappropriate"
    ],
    "punny": [
      "raw"
    ],
    "original_sentence": "The chef loved wordplay because it always made dinner more ___",
    "original_straight": [
      "fun",
      "enjoyable",
      "lively"
    ],
    "original_punny": [
      "seasoned"
    ],
    "repair_explanation": "Changed from 'seasoned' to 'raw' and flipped to a failure scenario. 'Too raw' works as both uncooked food and crude humor, creating a more surprising twist where the chef's comedy skills actually hurt his restaurant.",
    "claudecode_explanation": "\"Raw\" means crude/vulgar comedy and uncooked food. A comedian-chef whose jokes are too raw — both meanings work perfectly. Clever compound character.",
    "claudecode_rating": 6
  },
  {
    "id": 223,
    "sentence": "The musician became a baker because he loved working with ___",
    "straight": [
      "flour",
      "ingredients",
      "recipes"
    ],
    "punny": [
      "rolls"
    ],
    "original_sentence": "The musician became a baker because he loved a good ___",
    "original_straight": [
      "ending",
      "result",
      "finish"
    ],
    "original_punny": [
      "crescendo"
    ],
    "repair_explanation": "The original failed because 'crescendo' has no baking meaning. 'Rolls' works as both musical rolls (drum rolls, piano rolls) and bread rolls that bakers make.",
    "claudecode_explanation": "\"Rolls\" means bread rolls and drum rolls. A musician becoming a baker for rolls — clean crossover with dual meaning.",
    "claudecode_rating": 5
  },
  {
    "id": 224,
    "sentence": "The librarian got promoted because she always organized a strong ___",
    "straight": [
      "plan",
      "system",
      "proposal"
    ],
    "punny": [
      "case"
    ],
    "original_sentence": "The librarian got promoted because she always had a strong ___",
    "original_straight": [
      "plan",
      "work ethic",
      "record"
    ],
    "original_punny": [
      "case"
    ],
    "repair_explanation": "Added 'organized' to make the library connection clearer - librarians organize book cases, and organizing a strong case (argument) for promotion makes both meanings work naturally.",
    "claudecode_explanation": "\"Case\" means argument/proposal and... library case? Bookcases? The connection between a librarian organizing a strong case is too much of a stretch.",
    "claudecode_rating": 3
  },
  {
    "id": 226,
    "sentence": "The baker's favorite kind of detective story always had a crumbly ___",
    "straight": [
      "villain",
      "ending",
      "plot"
    ],
    "punny": [
      "crust"
    ],
    "original_sentence": "The baker’s favorite kind of detective story always had a flaky ___",
    "original_straight": [
      "villain",
      "ending",
      "plot"
    ],
    "original_punny": [
      "crust"
    ],
    "repair_explanation": "Changed 'flaky' to 'crumbly' so the pun word 'crust' works in both meanings - a crumbly crust is good in baking, and a crumbly character/plot element works for detective stories.",
    "claudecode_explanation": "\"Crust\" means bread crust and... surface layer of a mystery? \"Crumbly crust\" in detective fiction isn't a thing. This pun doesn't work.",
    "claudecode_rating": 2
  },
  {
    "id": 227,
    "sentence": "The photographer loved mystery novels because they always had great ___",
    "straight": [
      "suspense",
      "twists",
      "characters"
    ],
    "punny": [
      "exposure"
    ],
    "original_sentence": "The photographer loved mystery novels because they always developed a good ___",
    "original_straight": [
      "ending",
      "plot",
      "twist"
    ],
    "original_punny": [
      "negative"
    ],
    "repair_explanation": "Replaced 'negative' with 'exposure' and simplified the sentence structure - 'great exposure' works both for photography (good lighting/composition) and mysteries (getting widespread attention/publicity).",
    "claudecode_explanation": "\"Exposure\" means plot reveals and camera exposure. A photographer loving mystery novels for their exposure — both meanings work.",
    "claudecode_rating": 5
  },
  {
    "id": 228,
    "sentence": "The accountant avoided outdoor concerts because it was impossible to find a good ___",
    "straight": [
      "seat",
      "view",
      "spot"
    ],
    "punny": [
      "balance"
    ],
    "original_sentence": "The banker hated camping because it was hard to calculate the ___",
    "original_straight": [
      "cost",
      "risk",
      "effort"
    ],
    "original_punny": [
      "interest"
    ],
    "repair_explanation": "Completely reframed with 'balance' as the pun - accountants work with financial balance, and outdoor concerts make it hard to find physical balance on uneven ground.",
    "claudecode_explanation": "\"Balance\" means financial balance and physical balance. An accountant at an outdoor concert needing balance — both meanings are natural.",
    "claudecode_rating": 5
  },
  {
    "id": 229,
    "sentence": "The chef loved stand-up comedy because every good joke needed perfect ___",
    "straight": [
      "timing",
      "delivery",
      "practice"
    ],
    "punny": [
      "seasoning"
    ],
    "original_sentence": "The chef quit the comedy club because every joke needed better ___",
    "original_straight": [
      "timing",
      "delivery",
      "practice"
    ],
    "original_punny": [
      "seasoning"
    ],
    "repair_explanation": "Flipped the scenario so the chef appreciates comedy instead of quitting - now 'perfect seasoning' works both for cooking (adding spices) and comedy (the right amount of wit/timing to enhance a joke).",
    "claudecode_explanation": "\"Seasoning\" means experience/timing and food seasoning. But \"seasoning\" doesn't really mean comedic timing. This is a stretch.",
    "claudecode_rating": 3
  },
  {
    "id": 230,
    "sentence": "The librarian loved mystery novels because they always had such detailed ___",
    "straight": [
      "plots",
      "characters",
      "descriptions"
    ],
    "punny": [
      "indexes"
    ],
    "original_sentence": "The librarian loved romance novels because they always came with a happy ___",
    "original_straight": [
      "ending",
      "finish",
      "resolution"
    ],
    "original_punny": [
      "chapter"
    ],
    "repair_explanation": "Replaced 'chapter' with 'indexes' to create a real double meaning - libraries use detailed indexes for organization, and mystery novels often have detailed indexes of clues/evidence.",
    "claudecode_explanation": "\"Indexes\" means book indexes and clue indexes. But \"detailed indexes\" in a mystery novel isn't how anyone describes good mysteries. Forced.",
    "claudecode_rating": 2
  },
  {
    "id": 231,
    "sentence": "The electrician quit detective work because every mystery left him feeling ___",
    "straight": [
      "confused",
      "frustrated",
      "stumped"
    ],
    "punny": [
      "discharged"
    ],
    "original_sentence": "The electrician loved mystery because every clue felt like a charged ___",
    "original_straight": [
      "moment",
      "event",
      "incident"
    ],
    "original_punny": [
      "particle"
    ],
    "repair_explanation": "The original 'charged particle' made no sense as a metaphor for mystery clues. 'Discharged' works better - electrically it means losing charge, and professionally it means being dismissed/let go, which fits with quitting detective work.",
    "claudecode_explanation": "\"Discharged\" means released/fired and electrical discharge. Both meanings work for an electrician leaving detective work. Clean.",
    "claudecode_rating": 5
  },
  {
    "id": 236,
    "sentence": "The retirement calendar kept having panic attacks because all its days were ___",
    "straight": [
      "limited",
      "finite",
      "ending"
    ],
    "punny": [
      "numbered"
    ],
    "original_sentence": "The calendar was feeling anxious because its days were ___",
    "original_straight": [
      "busy",
      "full",
      "hectic"
    ],
    "original_punny": [
      "numbered"
    ],
    "repair_explanation": "Changed to a retirement calendar to make the anxiety more specific and poignant. The panic attacks amplify the emotional stakes while keeping the same clever double meaning.",
    "claudecode_explanation": "\"Days were numbered\" means running out of time and calendar days literally being numbered. The personification of a panicking retirement calendar adds charm.",
    "claudecode_rating": 6
  },
  {
    "id": 238,
    "sentence": "The broke baker's business plan was rejected because he had no ___",
    "straight": [
      "collateral",
      "assets",
      "equity"
    ],
    "punny": [
      "dough"
    ],
    "original_sentence": "The baker went to the bank for a loan because he needed ___",
    "original_straight": [
      "money",
      "cash",
      "capital"
    ],
    "original_punny": [
      "dough"
    ],
    "repair_explanation": "Reframed as a business plan rejection to make the scenario fresher and more dramatic. 'No dough' works perfectly for both lacking money and lacking baking ingredients.",
    "claudecode_explanation": "\"Dough\" means money and bread dough. Yet another dough pun. Even with a good setup, this pun is exhausted.",
    "claudecode_rating": 3
  },
  {
    "id": 240,
    "sentence": "The percussionist was arrested because he got into ___",
    "straight": [
      "fights",
      "arguments",
      "debt"
    ],
    "punny": [
      "treble"
    ],
    "original_sentence": "The drummer was arrested because he got into ___",
    "original_straight": [
      "fights",
      "arguments",
      "debt"
    ],
    "original_punny": [
      "treble"
    ],
    "repair_explanation": "Changed 'drummer' to 'percussionist' to better connect with 'treble' since drummers don't typically deal with treble clef or high-pitched sounds, while percussionists work with a wider range of instruments including those that produce treble tones.",
    "claudecode_explanation": "\"Treble\" sounds like \"trouble\" and is a musical term (treble clef). A percussionist getting into treble — fun homophone with the musical connection.",
    "claudecode_rating": 5
  },
  {
    "id": 243,
    "sentence": "The electrician stayed informed because he always followed the ___",
    "straight": [
      "news",
      "trends",
      "reports"
    ],
    "punny": [
      "current"
    ],
    "original_sentence": "The electrician was always up to date because he followed the ___",
    "original_straight": [
      "news",
      "trends",
      "reports"
    ],
    "original_punny": [
      "current"
    ],
    "repair_explanation": "Minor adjustment from 'was always up to date' to 'stayed informed' for more natural phrasing. The pun works perfectly - 'current' means both electrical current (electrician's work) and current events (staying informed).",
    "claudecode_explanation": "\"Current\" means current events and electrical current. Same pun as joke 197. Duplicate.",
    "claudecode_rating": 4
  },
  {
    "id": 247,
    "sentence": "The rubber band got detention for being too ___",
    "straight": [
      "disruptive",
      "rude",
      "sarcastic"
    ],
    "punny": [
      "snappy"
    ],
    "original_sentence": "The rubber band was confiscated in class because it was ___",
    "original_straight": [
      "distracting",
      "dangerous",
      "misused"
    ],
    "original_punny": [
      "snappy"
    ],
    "repair_explanation": "Simplified to detention rather than confiscation, making it more relatable. The 'too snappy' framing works better for both meanings - overly sarcastic behavior and the physical snapping action.",
    "claudecode_explanation": "\"Snappy\" means rude/irritable and a rubber band snapping. Both meanings work — a rubber band being too snappy in school is a fun personification.",
    "claudecode_rating": 6
  },
  {
    "id": 251,
    "sentence": "Everyone agreed the lamp was the most brilliant student because it was naturally ___",
    "straight": [
      "intelligent",
      "clever",
      "gifted"
    ],
    "punny": [
      "bright"
    ],
    "original_sentence": "The lamp was the smartest item in the room because it was ___",
    "original_straight": [
      "connected",
      "modern",
      "advanced"
    ],
    "original_punny": [
      "bright"
    ],
    "repair_explanation": "Reframed as a student rather than just 'smartest item' to create a more engaging scenario. 'Brilliant' in the setup enhances the pun by adding another light-related word.",
    "claudecode_explanation": "\"Bright\" means intelligent and luminous. A lamp being a brilliant/bright student — classic personification pun. Clean but very familiar.",
    "claudecode_rating": 5
  },
  {
    "id": 253,
    "sentence": "The pencil sharpener quit his job because he was tired of dealing with ___",
    "straight": [
      "difficult people",
      "complaints",
      "pressure"
    ],
    "punny": [
      "dull people"
    ],
    "original_sentence": "The pencil sharpener was tough to work with because he was always pointing out ___",
    "original_straight": [
      "errors",
      "mistakes",
      "flaws"
    ],
    "original_punny": [
      "mistakes"
    ],
    "repair_explanation": "The original had the pun in the setup rather than the blank, and 'mistakes' appeared in both straight and punny answers. Now 'dull people' works as both boring people (workplace frustration) and literally dull pencils that need sharpening.",
    "claudecode_explanation": "\"Dull people\" means boring people and dull pencils. A pencil sharpener dealing with dull people — both meanings are equally strong. Clever and concise.",
    "claudecode_rating": 7
  },
  {
    "id": 254,
    "sentence": "The demolition worker was fired because he couldn't ___",
    "straight": [
      "perform",
      "focus",
      "deliver"
    ],
    "punny": [
      "hack it"
    ],
    "original_sentence": "The construction worker was discharged because he couldn't ___",
    "original_straight": [
      "work",
      "focus",
      "lift"
    ],
    "original_punny": [
      "hack it"
    ],
    "repair_explanation": "Changed to demolition worker to make 'hack it' more relevant - hacking/chopping is central to demolition work. Now it works as both 'handle the job' and literally using hacking tools for demolition.",
    "claudecode_explanation": "\"Hack it\" means handle the job and hacking/chopping in demolition. Both meanings work for a fired demolition worker.",
    "claudecode_rating": 5
  },
  {
    "id": 258,
    "sentence": "The bee was having a bad hair day because his hair was full of ___",
    "straight": [
      "tangles",
      "knots",
      "static"
    ],
    "punny": [
      "honey"
    ],
    "original_sentence": "The bee was having a bad hair day because he used a honeycomb ___",
    "original_straight": [
      "shampoo",
      "gel",
      "conditioner"
    ],
    "original_punny": [
      "brush"
    ],
    "repair_explanation": "The original tried to put the pun word 'comb' in the setup. Now 'honey' works as both sticky hair product (causing bad hair day) and what bees produce, creating a cleaner double meaning.",
    "claudecode_explanation": "A bee's hair full of honey is just... literal. There's no second meaning. \"Full of honey\" doesn't mean anything beyond the literal.",
    "claudecode_rating": 2
  },
  {
    "id": 259,
    "sentence": "The tree was dreading its first day of school because it would have to ___",
    "straight": [
      "go",
      "depart",
      "attend"
    ],
    "punny": [
      "leave"
    ],
    "original_sentence": "The tree was worried about the autumn because it would have to ___",
    "original_straight": [
      "sleep",
      "freeze",
      "wait"
    ],
    "original_punny": [
      "leave"
    ],
    "repair_explanation": "Changed from autumn worry to first day of school, creating an unexpected and more relatable scenario. The anxiety about leaving home for school makes both meanings of 'leave' work perfectly.",
    "claudecode_explanation": "\"Leave\" sounds like \"leaf\" and means depart. A tree leaving/leafing on the first day of school — both meanings are activated by the homophone. Cute.",
    "claudecode_rating": 6
  },
  {
    "id": 260,
    "sentence": "The baseball player was terrible at serving dinner because he kept dropping the ___",
    "straight": [
      "food",
      "dishes",
      "silverware"
    ],
    "punny": [
      "home plate"
    ],
    "original_sentence": "The baseball player was a horrible cook because he always touched ___",
    "original_straight": [
      "raw meat",
      "hot pans",
      "dirty dishes"
    ],
    "original_punny": [
      "home plate"
    ],
    "repair_explanation": "The original connection between touching home plate and bad cooking was illogical. Now 'dropping the home plate' works both as a serving disaster (dinner plate) and baseball error (home plate base).",
    "claudecode_explanation": "\"Home plate\" is a baseball term and a dinner plate. Dropping the home plate while serving dinner — both meanings are vivid. Creative crossover.",
    "claudecode_rating": 6
  },
  {
    "id": 261,
    "sentence": "When the duck opened his medical invoice, he nearly choked on the ___",
    "straight": [
      "amount",
      "total",
      "cost"
    ],
    "punny": [
      "bill"
    ],
    "original_sentence": "The duck went to the doctor and was shocked by the ___",
    "original_straight": [
      "diagnosis",
      "news",
      "pain"
    ],
    "original_punny": [
      "bill"
    ],
    "repair_explanation": "Made the setup more specific and dramatic by having the duck actually open the invoice, creating a stronger reaction. The choking action adds physical comedy that makes the bill/beak pun more surprising.",
    "claudecode_explanation": "\"Bill\" means a financial invoice and a duck's bill. A duck choking on a bill — both meanings work perfectly. Classic and clean.",
    "claudecode_rating": 6
  },
  {
    "id": 262,
    "sentence": "The skeleton got kicked out of the gym for bringing no ___",
    "straight": [
      "membership card",
      "towel",
      "water bottle"
    ],
    "punny": [
      "body"
    ],
    "original_sentence": "The skeleton didn't go to the dance because he had no ___",
    "original_straight": [
      "date",
      "money",
      "car"
    ],
    "original_punny": [
      "body to go with"
    ],
    "repair_explanation": "Changed from the overused dance scenario to a gym setting where 'bringing no body' works both as having no physical form and violating a 'no body' rule, making the pun tighter and less predictable.",
    "claudecode_explanation": "\"No body\" means nobody (no person) and no physical body (skeleton). Dark humor that works on both levels simultaneously.",
    "claudecode_rating": 6
  },
  {
    "id": 263,
    "sentence": "The magician got frustrated in math class because he couldn't make the ___",
    "straight": [
      "equations work",
      "numbers add up",
      "formulas balance"
    ],
    "punny": [
      "problems disappear"
    ],
    "original_sentence": "The magician got frustrated in math class because he couldn't handle the ___",
    "original_straight": [
      "equations",
      "numbers",
      "formulas"
    ],
    "original_punny": [
      "problems"
    ],
    "repair_explanation": "The original had no real magic connection. Now 'make the problems disappear' works as both solving math problems and performing a classic magic trick of making things vanish.",
    "claudecode_explanation": "\"Problems disappear\" connects math problems and magic disappearing. Clever concept but the blank is a phrase rather than a single word, which weakens the fill-in-the-blank structure.",
    "claudecode_rating": 4
  },
  {
    "id": 265,
    "sentence": "The computer went to the doctor because it caught a ___",
    "straight": [
      "bug",
      "glitch",
      "malfunction"
    ],
    "punny": [
      "virus"
    ],
    "original_sentence": "The computer went to the doctor because it had a ___",
    "original_straight": [
      "glitch",
      "short circuit",
      "fan issue"
    ],
    "original_punny": [
      "virus"
    ],
    "repair_explanation": "Changed 'had' to 'caught' to make the biological virus meaning more natural and active. This makes the double meaning flow better since you 'catch' both computer viruses and biological viruses.",
    "claudecode_explanation": "\"Virus\" means computer virus and medical virus. Classic, extremely well-known joke. Overused but the pun is undeniably clean.",
    "claudecode_rating": 5
  },
  {
    "id": 268,
    "sentence": "The eye doctor was the most popular guy in town because he had great ___",
    "straight": [
      "personality",
      "charisma",
      "social skills"
    ],
    "punny": [
      "contacts"
    ],
    "original_sentence": "The eye doctor was the most popular guy in town because he had good ___",
    "original_straight": [
      "jokes",
      "stories",
      "friends"
    ],
    "original_punny": [
      "contacts"
    ],
    "repair_explanation": "Changed 'good' to 'great' for more natural flow and updated the straight answers to better reflect what makes someone popular socially, creating a cleaner contrast with the punny answer.",
    "claudecode_explanation": "\"Contacts\" means social connections and contact lenses. An eye doctor with great contacts — both meanings are strong and natural.",
    "claudecode_rating": 6
  },
  {
    "id": 270,
    "sentence": "The vampire was a real pain in the ___",
    "straight": [
      "butt",
      "rear",
      "side"
    ],
    "punny": [
      "neck"
    ],
    "original_sentence": "The vampire was a pain in the ___",
    "original_straight": [
      "butt",
      "rear",
      "class"
    ],
    "original_punny": [
      "neck"
    ],
    "repair_explanation": "Added 'real' to make the phrase flow more naturally as 'real pain in the neck' is the more common expression. This small change makes the pun land more smoothly.",
    "claudecode_explanation": "\"Pain in the neck\" means annoying person and vampire biting necks. Classic and clean. Both meanings are immediately clear.",
    "claudecode_rating": 6
  },
  {
    "id": 274,
    "sentence": "The thunder cloud got fired from its job because it kept ___",
    "straight": [
      "slacking off",
      "being late",
      "causing trouble"
    ],
    "punny": [
      "striking"
    ],
    "original_sentence": "The thunder cloud was unemployed and looking for ___",
    "original_straight": [
      "work",
      "purpose",
      "assistance"
    ],
    "original_punny": [
      "lightning"
    ],
    "repair_explanation": "Completely reframed around 'striking' which works as both lightning strikes and labor strikes/work stoppages. This creates a proper double meaning where the original 'lightning' had no clear employment connection.",
    "claudecode_explanation": "\"Striking\" means going on labor strikes and lightning strikes. A thunder cloud that kept striking — both meanings are strong. Creative personification with a real dual meaning.",
    "claudecode_rating": 7
  },
  {
    "id": 275,
    "sentence": "The pig couldn't get a job in construction because he was a terrible ___",
    "straight": [
      "worker",
      "employee",
      "builder"
    ],
    "punny": [
      "bore"
    ],
    "original_sentence": "The pigs were bad roommates because they were absolute ___",
    "original_straight": [
      "slobs",
      "messy",
      "dirty"
    ],
    "original_punny": [
      "bores"
    ],
    "repair_explanation": "Reframed around construction work where 'bore' means both a drilling tool and a dull person. This gives both meanings clear relevance to the setup, unlike the original where being 'boring' didn't connect to being a bad roommate.",
    "claudecode_explanation": "\"Bore\" means boring person and drilling/boring. Also sounds like \"boar\" (pig). The pig connection through boar/bore homophone is clever but requires a mental leap.",
    "claudecode_rating": 5
  },
  {
    "id": 276,
    "sentence": "The banana went to the doctor because it wasn't ___",
    "straight": [
      "feeling well",
      "doing well",
      "getting better"
    ],
    "punny": [
      "peeling well"
    ],
    "original_sentence": "The banana went to the hospital because it wasn't ___",
    "original_straight": [
      "healthy",
      "strong",
      "improving"
    ],
    "original_punny": [
      "peeling well"
    ],
    "repair_explanation": "Changed 'hospital' to 'doctor' to make the setup more natural and conversational. The original was already decent, but this flows better as something someone would actually say.",
    "claudecode_explanation": "\"Peeling well\" sounds like \"feeling well.\" A banana not peeling well — classic homophone that works for both health and banana skin. Clean kid-friendly pun.",
    "claudecode_rating": 6
  },
  {
    "id": 279,
    "sentence": "The butcher's business was failing because his prices were too ___",
    "straight": [
      "expensive",
      "costly",
      "steep"
    ],
    "punny": [
      "high steaks"
    ],
    "original_sentence": "The butcher was worried about his business because the stakes were ___",
    "original_straight": [
      "risky",
      "expensive",
      "dangerous"
    ],
    "original_punny": [
      "high"
    ],
    "repair_explanation": "The original had the pun in the setup rather than the answer. Now 'high steaks' works as both 'high stakes' (expensive prices) and literally high-priced steaks, putting the wordplay where it belongs.",
    "claudecode_explanation": "\"High steaks\" sounds like \"high stakes\" and refers to expensive steak cuts. Both meanings work perfectly in a butcher's business context.",
    "claudecode_rating": 6
  },
  {
    "id": 282,
    "sentence": "The gym by the harbor stayed in business because of all the local ___",
    "straight": [
      "residents",
      "workers",
      "sailors"
    ],
    "punny": [
      "mussels"
    ],
    "original_sentence": "The seafood restaurant was strong because it had plenty of ___",
    "original_straight": [
      "customers",
      "money",
      "reviews"
    ],
    "original_punny": [
      "mussels"
    ],
    "repair_explanation": "Moved from a seafood restaurant to a harbor gym, making the mussels/muscles pun work better since gyms actually need muscles to succeed, and harbor locations would have actual mussels nearby.",
    "claudecode_explanation": "\"Mussels\" sounds like \"muscles.\" A harbor gym with local mussels/muscles — the homophone is perfect and the scenario makes both meanings equally valid.",
    "claudecode_rating": 7
  },
  {
    "id": 284,
    "sentence": "When the grape was stepped on, it let out a little ___",
    "straight": [
      "squeak",
      "cry",
      "yelp"
    ],
    "punny": [
      "wine"
    ],
    "original_sentence": "The grape let out a small scream when it was stepped on, just a little ___",
    "original_straight": [
      "squeak",
      "cry",
      "yelp"
    ],
    "original_punny": [
      "wine"
    ],
    "repair_explanation": "Simplified the setup to be more direct and natural. The pun was already strong - 'wine' sounds like 'whine' and grapes literally become wine when crushed.",
    "claudecode_explanation": "\"Wine\" sounds like \"whine.\" A stepped-on grape letting out a little wine/whine — both meanings work. Classic, well-known joke executed cleanly.",
    "claudecode_rating": 6
  },
  {
    "id": 285,
    "sentence": "The river was getting confused about where to go because it couldn't find its ___",
    "straight": [
      "path",
      "direction",
      "course"
    ],
    "punny": [
      "mouth"
    ],
    "original_sentence": "The river couldn't speak clearly because it had water in its ___",
    "original_straight": [
      "ears",
      "lungs",
      "eyes"
    ],
    "original_punny": [
      "mouth"
    ],
    "repair_explanation": "The original setup was awkward and unnatural. Now 'mouth' works as both where a river ends (river mouth) and what you need to speak/ask for directions, creating a cleaner double meaning.",
    "claudecode_explanation": "\"Mouth\" means a river mouth (geographical) and a literal mouth. A confused river that can't find its mouth — the personification is charming.",
    "claudecode_rating": 5
  },
  {
    "id": 288,
    "sentence": "The cobbler's boots joined the choir to find their ___",
    "straight": [
      "voice",
      "harmony",
      "rhythm"
    ],
    "punny": [
      "soles"
    ],
    "original_sentence": "The shoes went to church to save their ___",
    "original_straight": [
      "owner",
      "reputation",
      "marriage"
    ],
    "original_punny": [
      "soles"
    ],
    "repair_explanation": "Switched from generic church to a choir setting where 'finding your soles/souls' works as both discovering musical soul and literally the shoe parts, plus adds the cobbler context for extra shoe relevance.",
    "claudecode_explanation": "\"Soles\" sounds like \"souls.\" Cobbler's boots joining a choir to find their soles/souls — the choir context activates the spiritual meaning while cobbler activates the shoe meaning. Creative scenario.",
    "claudecode_rating": 7
  },
  {
    "id": 290,
    "sentence": "Sir Lancelot's armor was rusty because he'd been pulling too many ___",
    "straight": [
      "double shifts",
      "long hours",
      "overtime shifts"
    ],
    "punny": [
      "knight shifts"
    ],
    "original_sentence": "The knight was exhausted because he had been working the ___",
    "original_straight": [
      "weekend",
      "holidays",
      "overtime"
    ],
    "original_punny": [
      "night shift"
    ],
    "repair_explanation": "Made the pun more explicit by using 'knight shifts' as the punny answer instead of hiding it in the setup, and added the armor detail to reinforce the medieval context while making the overwork angle funnier.",
    "claudecode_explanation": "\"Knight shifts\" sounds like \"night shifts\" and refers to a knight working. Rusty armor from overwork — the homophone is tight and the medieval scenario is fun.",
    "claudecode_rating": 7
  },
  {
    "id": 294,
    "sentence": "The dentist looked ___",
    "straight": [
      "tired",
      "worried",
      "upset"
    ],
    "punny": [
      "down in the mouth"
    ],
    "original_sentence": "The dentist was depressed because he looked down in the ___",
    "original_straight": [
      "dumps",
      "dirt",
      "mud"
    ],
    "original_punny": [
      "mouth"
    ],
    "repair_explanation": "The original forced an awkward construction. By making the idiom 'down in the mouth' the complete answer rather than splitting it, the pun flows naturally while maintaining both meanings.",
    "claudecode_explanation": "\"Down in the mouth\" means sad and a dentist literally looks down in mouths. Classic idiom play that maps perfectly to the profession.",
    "claudecode_rating": 6
  },
  {
    "id": 297,
    "sentence": "The teenager's parents weren't worried about her goth phase because the moon was going through one ___",
    "straight": [
      "simultaneously",
      "right now",
      "at the same time"
    ],
    "punny": [
      "too"
    ],
    "original_sentence": "The moon was moody because it was going through a ___",
    "original_straight": [
      "breakup",
      "depression",
      "crisis"
    ],
    "original_punny": [
      "phase"
    ],
    "repair_explanation": "Changed from predictable moon-phase setup to a clever parallel between teenage phases and lunar phases. The word 'too' creates a perfect double meaning - both 'also' and sounds like 'two' (referencing the pair going through phases together).",
    "claudecode_explanation": "The pun word \"phase\" is in the setup, not in the blank. The blank is just \"too\" which carries no double meaning. Structurally broken as a fill-in-the-blank joke.",
    "claudecode_rating": 2
  },
  {
    "id": 298,
    "sentence": "The geologist's marriage fell apart just like tectonic plates - there were constant ___",
    "straight": [
      "arguments",
      "conflicts",
      "disagreements"
    ],
    "punny": [
      "shifts"
    ],
    "original_sentence": "The tectonic plates broke up because there was too much ___",
    "original_straight": [
      "anger",
      "fighting",
      "distance"
    ],
    "original_punny": [
      "friction"
    ],
    "repair_explanation": "Reframed to directly parallel geological and relationship dynamics. 'Shifts' works better than friction because tectonic plates shift/move, and relationship 'shifts' (changes in dynamics) cause breakups. Creates a tighter metaphorical connection.",
    "claudecode_explanation": "\"Shifts\" means relationship changes and tectonic plate shifts. The geology-marriage parallel works and both meanings are clear.",
    "claudecode_rating": 6
  },
  {
    "id": 302,
    "sentence": "The sheep was driving and needed to make a quick ___",
    "straight": [
      "turn",
      "stop",
      "decision"
    ],
    "punny": [
      "ewe-turn"
    ],
    "original_sentence": "The sheep was a bad driver and made a sudden ___",
    "original_straight": [
      "stop",
      "crash",
      "noise"
    ],
    "original_punny": [
      "ewe-turn"
    ],
    "repair_explanation": "The original setup said the sheep was a 'bad driver' which made the sudden maneuver seem negative, but U-turns aren't inherently bad. Changed to neutral 'needed to make a quick' so the ewe-turn works as both a driving maneuver and sheep wordplay.",
    "claudecode_explanation": "\"Ewe-turn\" sounds like \"U-turn\" and ewe is a female sheep. Cute animal pun with a clean homophone.",
    "claudecode_rating": 6
  },
  {
    "id": 305,
    "sentence": "The bear couldn't find the remote, so he had to use his ___",
    "straight": [
      "hands",
      "claws",
      "fingers"
    ],
    "punny": [
      "paws"
    ],
    "original_sentence": "The bear paused the movie because he wanted to press ___",
    "original_straight": [
      "stop",
      "play",
      "rewind"
    ],
    "original_punny": [
      "paws"
    ],
    "repair_explanation": "The original telegraphed the punchline by already mentioning 'paused.' Now the setup creates a natural reason to mention what body part he'd use, making 'paws' work as both bear anatomy and a play on the pause function.",
    "claudecode_explanation": "\"Paws\" sounds like \"pause\" but \"use his paws to operate the remote\" is just literal — a bear would use his paws. The \"pause\" meaning doesn't naturally emerge from \"use his paws.\"",
    "claudecode_rating": 3
  },
  {
    "id": 309,
    "sentence": "The snake became a librarian because he was great at keeping ___",
    "straight": [
      "quiet",
      "order",
      "records"
    ],
    "punny": [
      "hiss-tory"
    ],
    "original_sentence": "The snake was a history scholar because he loved ___",
    "original_straight": [
      "books",
      "facts",
      "dates"
    ],
    "original_punny": [
      "hiss-tory"
    ],
    "repair_explanation": "Instead of forcing 'hiss-tory' as a fake word for history, this setup makes it work as 'his story' - librarians keep records/stories, and the hiss sound naturally fits the context of maintaining quiet in libraries.",
    "claudecode_explanation": "\"Hiss-tory\" sounds like \"history\" and involves snake hissing. A snake librarian keeping hiss-tory — cute portmanteau pun.",
    "claudecode_rating": 5
  },
  {
    "id": 310,
    "sentence": "The shy turtle finally decided to come out of his ___",
    "straight": [
      "room",
      "house",
      "hiding"
    ],
    "punny": [
      "shell"
    ],
    "original_sentence": "The turtle was homeless because he came out of his ___",
    "original_straight": [
      "house",
      "apartment",
      "shack"
    ],
    "original_punny": [
      "shell"
    ],
    "repair_explanation": "Changed from 'homeless' to 'shy' to align with the common idiom 'come out of one's shell' meaning to become less shy, while also literally referencing where turtles live. Both meanings now work harmoniously.",
    "claudecode_explanation": "\"Come out of his shell\" means become less shy and a turtle's literal shell. Both meanings are strong and the turtle personification is natural.",
    "claudecode_rating": 6
  },
  {
    "id": 311,
    "sentence": "The chicken's favorite type of car was definitely a ___",
    "straight": [
      "sedan",
      "hatchback",
      "convertible"
    ],
    "punny": [
      "coupe"
    ],
    "original_sentence": "The chicken drove a fancy car, specifically a ___",
    "original_straight": [
      "sedan",
      "truck",
      "van"
    ],
    "original_punny": [
      "coupe"
    ],
    "repair_explanation": "Simplified the setup to focus on preference rather than describing a specific fancy car scenario. This makes the coupe/coop pun feel more natural as both a car type and a chicken housing reference.",
    "claudecode_explanation": "\"Coupe\" sounds like \"coop\" (chicken coop) and is a car type. A chicken's favorite car being a coupe/coop — clean homophone.",
    "claudecode_rating": 6
  },
  {
    "id": 312,
    "sentence": "The camping trip was overwhelming because it was so ___",
    "straight": [
      "stressful",
      "chaotic",
      "demanding"
    ],
    "punny": [
      "in tents"
    ],
    "original_sentence": "The camping trip was overwhelming because it was in ___",
    "original_straight": [
      "danger",
      "trouble",
      "jeopardy"
    ],
    "original_punny": [
      "tents"
    ],
    "repair_explanation": "Changed 'in ___' to 'so ___' to make the homophone work better. Now 'so in tents' sounds like 'so intense' while maintaining the camping context.",
    "claudecode_explanation": "\"In tents\" sounds like \"intense.\" A camping trip that's so in-tents/intense — classic homophone pun that's well-known but effective.",
    "claudecode_rating": 6
  },
  {
    "id": 313,
    "sentence": "The shy mountain refused to let anyone ___",
    "straight": [
      "climb",
      "visit",
      "approach"
    ],
    "punny": [
      "peek"
    ],
    "original_sentence": "The mountain was shy and refused to ___",
    "original_straight": [
      "talk",
      "move",
      "interact"
    ],
    "original_punny": [
      "peak"
    ],
    "repair_explanation": "Changed the setup to make 'peek' work as both looking (shy behavior) and 'peak' (mountain top). The double meaning now works naturally with shy mountains not letting people peek/reach their peak.",
    "claudecode_explanation": "\"Peek\" sounds like \"peak\" (mountain peak). A shy mountain that won't let anyone peek/peak — both meanings are activated. Clever.",
    "claudecode_rating": 6
  },
  {
    "id": 317,
    "sentence": "The lost geography student was embarrassed because he had no sense of ___",
    "straight": [
      "direction",
      "location",
      "orientation"
    ],
    "punny": [
      "bearing"
    ],
    "original_sentence": "The geography student was embarrassed because he couldn't find his ___",
    "original_straight": [
      "textbook",
      "homework",
      "seat"
    ],
    "original_punny": [
      "bearing"
    ],
    "repair_explanation": "Reframed to emphasize being lost, making 'bearing' work perfectly as both navigational direction (geography) and composure (embarrassment). The setup now naturally leads to both meanings.",
    "claudecode_explanation": "\"Bearing\" means directional bearing and personal composure. A lost geography student with no sense of bearing — both meanings work for being lost and embarrassed.",
    "claudecode_rating": 5
  },
  {
    "id": 319,
    "sentence": "The artist's competition ended in a ___ because both sketches were equally good",
    "straight": [
      "deadlock",
      "stalemate",
      "draw"
    ],
    "punny": [
      "draw"
    ],
    "original_sentence": "The artist was in a draw so the game ended in a ___",
    "original_straight": [
      "failure",
      "mess",
      "disaster"
    ],
    "original_punny": [
      "tie"
    ],
    "repair_explanation": "Completely restructured to put the pun word in the blank where it belongs. Now 'draw' works as both an art activity (sketches) and a tied competition result, with clear double meaning.",
    "claudecode_explanation": "\"Draw\" means a tie/draw and creating an art drawing. An artist's competition ending in a draw — both meanings are equally strong. Tight and satisfying.",
    "claudecode_rating": 7
  },
  {
    "id": 320,
    "sentence": "The forgetful musician always had to take detailed ___",
    "straight": [
      "reminders",
      "records",
      "memos"
    ],
    "punny": [
      "notes"
    ],
    "original_sentence": "The musician was organized and always took good ___",
    "original_straight": [
      "advice",
      "precautions",
      "care"
    ],
    "original_punny": [
      "notes"
    ],
    "repair_explanation": "Changed 'organized' to 'forgetful' to create better contrast and motivation. Now taking detailed notes makes sense for someone forgetful, while maintaining the musical notes double meaning.",
    "claudecode_explanation": "\"Notes\" means written reminders and musical notes. A forgetful musician taking notes — both meanings work. Standard but clean.",
    "claudecode_rating": 5
  },
  {
    "id": 322,
    "sentence": "The bodybuilder's tantrum was quite the ___",
    "straight": [
      "scene",
      "spectacle",
      "outburst"
    ],
    "punny": [
      "fit"
    ],
    "original_sentence": "The bodybuilder threw a tantrum and pitched a ___",
    "original_straight": [
      "fit",
      "rock",
      "chair"
    ],
    "original_punny": [
      "fit"
    ],
    "repair_explanation": "The original had 'fit' in both straight and punny answers, making it not a pun at all. Now 'fit' only appears as the punny answer, creating a proper double meaning between tantrum (throwing a fit) and physical condition (being fit).",
    "claudecode_explanation": "\"Fit\" means a tantrum/outburst and being physically fit. A bodybuilder's fit — both meanings are equally natural. Concise.",
    "claudecode_rating": 6
  },
  {
    "id": 324,
    "sentence": "The school administrator was known for his strong ___",
    "straight": [
      "leadership",
      "character",
      "discipline"
    ],
    "punny": [
      "principals"
    ],
    "original_sentence": "The principal was a man of strong ___",
    "original_straight": [
      "character",
      "will",
      "faith"
    ],
    "original_punny": [
      "principles"
    ],
    "repair_explanation": "Changed 'principal' to 'school administrator' to avoid having the pun word in the setup, and made it clearer that we're talking about the person's moral foundations while maintaining the homophone pun with 'principals/principles.'",
    "claudecode_explanation": "\"Principals\" sounds like \"principles\" and means school principals. An administrator with strong principals/principles — clean homophone.",
    "claudecode_rating": 6
  },
  {
    "id": 325,
    "sentence": "The refined teacher always brought a lot of ___ to her lessons",
    "straight": [
      "energy",
      "enthusiasm",
      "creativity"
    ],
    "punny": [
      "class"
    ],
    "original_sentence": "The teacher was elegant and had a lot of ___",
    "original_straight": [
      "style",
      "grace",
      "charm"
    ],
    "original_punny": [
      "class"
    ],
    "repair_explanation": "Made the setup more specific to teaching context ('brought to her lessons') so 'class' works both as bringing sophistication to lessons and literally bringing a class of students, creating a stronger double meaning.",
    "claudecode_explanation": "\"Class\" means sophistication/elegance and a classroom lesson. A refined teacher bringing class to her lessons — both meanings work simultaneously.",
    "claudecode_rating": 6
  },
  {
    "id": 326,
    "sentence": "The drama student was always the star of every ___",
    "straight": [
      "performance",
      "show",
      "production"
    ],
    "punny": [
      "play"
    ],
    "original_sentence": "The drama student loved recess because she was always in a ___",
    "original_straight": [
      "hurry",
      "rush",
      "group"
    ],
    "original_punny": [
      "play"
    ],
    "repair_explanation": "Removed the awkward recess reference and made it about being a star, so 'play' works as both a theatrical production (drama context) and the concept of playing/having fun, with a more natural setup.",
    "claudecode_explanation": "\"Play\" means theater performance and... just play. A drama student being the star of every play is purely literal. No second meaning.",
    "claudecode_rating": 3
  },
  {
    "id": 328,
    "sentence": "The baseball player made an impressive ___ on his first fishing trip",
    "straight": [
      "attempt",
      "effort",
      "showing"
    ],
    "punny": [
      "catch"
    ],
    "original_sentence": "The baseball player was a good fisherman because he had a great ___",
    "original_straight": [
      "boat",
      "rod",
      "technique"
    ],
    "original_punny": [
      "catch"
    ],
    "repair_explanation": "Reframed to focus on the fishing trip outcome rather than explaining why he's good at fishing, making 'catch' work as both a fishing achievement and a baseball skill demonstration in a more surprising way.",
    "claudecode_explanation": "\"Catch\" means a baseball catch and a fishing catch. A baseball player making a catch while fishing — clean crossover scenario.",
    "claudecode_rating": 6
  },
  {
    "id": 331,
    "sentence": "The soldier was a musician who played ___",
    "straight": [
      "guitar",
      "piano",
      "drums"
    ],
    "punny": [
      "bass"
    ],
    "original_sentence": "The soldier played guitar on the ___",
    "original_straight": [
      "stage",
      "street",
      "porch"
    ],
    "original_punny": [
      "base"
    ],
    "repair_explanation": "The original had a spelling/pronunciation mismatch between 'base' and 'bass'. Changed to use 'bass' directly, which works as both the bass guitar instrument and sounds like 'base' (military installation).",
    "claudecode_explanation": "\"Bass\" as a musical instrument and \"base\" (military base) are spelled and pronounced differently. The homophone doesn't work for the string instrument meaning.",
    "claudecode_rating": 3
  },
  {
    "id": 332,
    "sentence": "The retired soccer player became a life coach because he was great at helping people reach their ___",
    "straight": [
      "potential",
      "dreams",
      "objectives"
    ],
    "punny": [
      "goals"
    ],
    "original_sentence": "The soccer player was ambitious because he had a life ___",
    "original_straight": [
      "plan",
      "dream",
      "wish"
    ],
    "original_punny": [
      "goal"
    ],
    "repair_explanation": "The original was too predictable and didn't create a meaningful connection. The repair makes the soccer-life coaching connection more logical and natural while maintaining the goal/goals pun.",
    "claudecode_explanation": "\"Goals\" means life goals and soccer goals. A retired soccer player coaching people to reach their goals — both meanings are natural and the career transition makes sense.",
    "claudecode_rating": 6
  },
  {
    "id": 333,
    "sentence": "The fisherman was good at computers because he knew how to work the ___",
    "straight": [
      "keyboard",
      "mouse",
      "software"
    ],
    "punny": [
      "net"
    ],
    "original_sentence": "The fisherman was good at computers because he surfed the ___",
    "original_straight": [
      "web",
      "internet",
      "sites"
    ],
    "original_punny": [
      "net"
    ],
    "repair_explanation": "Removed 'surfed the' which made the pun too obvious and changed to 'work the' to make both meanings (fishing net and internet/network) fit more naturally without telegraphing the answer.",
    "claudecode_explanation": "\"Net\" means internet/network and fishing net. A fisherman working computer nets — both meanings are clean and the crossover is fun.",
    "claudecode_rating": 6
  },
  {
    "id": 335,
    "sentence": "The arsonist quit playing tennis after someone stole his ___",
    "straight": [
      "racket",
      "shoes",
      "bag"
    ],
    "punny": [
      "matches"
    ],
    "original_sentence": "The pyromaniac loved tennis because of the ___",
    "original_straight": [
      "excitement",
      "speed",
      "sweat"
    ],
    "original_punny": [
      "match"
    ],
    "repair_explanation": "Flipped to create a problem scenario rather than enjoyment, making the punchline less predictable. 'Matches' (plural) works for both tennis matches (games) and fire-starting matches, with the theft adding an unexpected twist that makes the double meaning more surprising.",
    "claudecode_explanation": "\"Matches\" means tennis matches and fire matches (for an arsonist). Both meanings are strong and the scenario creates a funny character who loses his tools of both trades.",
    "claudecode_rating": 7
  },
  {
    "id": 336,
    "sentence": "The cat always interrupted the swimmer by sitting on his ___",
    "straight": [
      "towel",
      "goggles",
      "clothes"
    ],
    "punny": [
      "lap"
    ],
    "original_sentence": "The cat sat on the swimmer's ___",
    "original_straight": [
      "towel",
      "bag",
      "clothes"
    ],
    "original_punny": [
      "lap"
    ],
    "repair_explanation": "Added 'always interrupted' and 'by sitting' to make the cat's behavior more specific and logical, strengthening the connection between both meanings of 'lap' (swimming lap and where cats sit).",
    "claudecode_explanation": "\"Lap\" means a swimming lap and a cat's lap (sitting). A cat interrupting a swimmer's lap by sitting on his lap — both meanings work and the image is funny.",
    "claudecode_rating": 7
  },
  {
    "id": 338,
    "sentence": "The detective who loved running always stayed on ___",
    "straight": [
      "schedule",
      "target",
      "course"
    ],
    "punny": [
      "track"
    ],
    "original_sentence": "The detective ran a race to stay on ___",
    "original_straight": [
      "target",
      "schedule",
      "time"
    ],
    "original_punny": [
      "track"
    ],
    "repair_explanation": "The original felt forced because 'ran a race to stay on track' was awkward phrasing. The repair makes it natural by establishing the detective as a runner first, so 'stayed on track' flows as both detective work and running terminology.",
    "claudecode_explanation": "\"Track\" means a running track and staying on track (detective work). Both meanings work but it's a common, unremarkable dual meaning.",
    "claudecode_rating": 5
  },
  {
    "id": 341,
    "sentence": "The dyslexic zombie kept hunting guys named ___",
    "straight": [
      "Steve",
      "Mike",
      "Dave"
    ],
    "punny": [
      "Brian"
    ],
    "original_sentence": "The dyslexic zombie starved because he only ate ___",
    "original_straight": [
      "flesh",
      "meat",
      "limbs"
    ],
    "original_punny": [
      "brians"
    ],
    "repair_explanation": "The original 'brians' wasn't a real word. The repair makes Brian a proper name that works as a real answer, while the joke is that the zombie misspelled 'brains' as 'Brian' and is literally hunting people with that name.",
    "claudecode_explanation": "\"Brian\" sounds like \"brain\" rearranged (dyslexic). A dyslexic zombie hunting Brians instead of brains — dark, surprising, and cleverly constructed.",
    "claudecode_rating": 7
  },
  {
    "id": 342,
    "sentence": "The overworked candle was completely burnt out from working seven days a ___",
    "straight": [
      "month",
      "year",
      "season"
    ],
    "punny": [
      "week",
      "wick"
    ],
    "original_sentence": "The candle was feeling burnt out because it worked on ___",
    "original_straight": [
      "weekends",
      "holidays",
      "Mondays"
    ],
    "original_punny": [
      "wicks"
    ],
    "repair_explanation": "The original 'wicks/weeks' connection was too forced. The repair sets up 'seven days a week' as the natural phrase, where 'wick' sounds like 'week' but also refers to the candle part, making both meanings work clearly.",
    "claudecode_explanation": "\"Wick\" sounds like \"week\" and is a candle part. \"Burnt out\" adds another candle layer. A candle working seven days a wick — multi-layered and fun.",
    "claudecode_rating": 6
  },
  {
    "id": 343,
    "sentence": "The lightbulb got poor performance reviews for being too ___",
    "straight": [
      "hot",
      "fragile",
      "expensive"
    ],
    "punny": [
      "dim"
    ],
    "original_sentence": "The energetic lightbulb was fired for being too ___",
    "original_straight": [
      "noisy",
      "hot",
      "expensive"
    ],
    "original_punny": [
      "dim"
    ],
    "repair_explanation": "The original contradicted itself by calling the lightbulb 'energetic' then saying it was fired for being 'dim.' The repair removes the contradiction and makes 'dim' work as both a lightbulb quality and intelligence critique.",
    "claudecode_explanation": "\"Dim\" means stupid and not bright enough (light). A lightbulb being too dim — both meanings are clear. Simple and effective.",
    "claudecode_rating": 6
  },
  {
    "id": 344,
    "sentence": "The origami artist's business went under due to too many ___",
    "straight": [
      "expenses",
      "competitors",
      "complaints"
    ],
    "punny": [
      "folds"
    ],
    "original_sentence": "The origami teacher folded under ___",
    "original_straight": [
      "stress",
      "scrutiny",
      "questioning"
    ],
    "original_punny": [
      "pressure"
    ],
    "repair_explanation": "The original had the pun in the setup ('folded') rather than the blank. The repair puts the wordplay in the blank where 'folds' means both origami techniques and business failures, while 'went under' sets up the business context.",
    "claudecode_explanation": "\"Folds\" means business folding (closing) and origami folds. An origami business going under due to too many folds — both meanings are strong.",
    "claudecode_rating": 6
  },
  {
    "id": 345,
    "sentence": "The detective artist was great at drawing ___",
    "straight": [
      "suspects",
      "witnesses",
      "crime scenes"
    ],
    "punny": [
      "conclusions"
    ],
    "original_sentence": "The criminal artist was great at drawing ___",
    "original_straight": [
      "landscapes",
      "portraits",
      "cartoons"
    ],
    "original_punny": [
      "conclusions"
    ],
    "repair_explanation": "Changed 'criminal artist' to 'detective artist' so both meanings of 'drawing conclusions' work naturally - detectives draw conclusions from evidence, and this detective also draws pictures.",
    "claudecode_explanation": "\"Drawing conclusions\" means making deductions and literally drawing (art). A detective-artist drawing conclusions — both meanings are equally active. Clever compound.",
    "claudecode_rating": 7
  },
  {
    "id": 347,
    "sentence": "The busy doctor stayed calm because he had a lot of ___",
    "straight": [
      "experience",
      "training",
      "support"
    ],
    "punny": [
      "patients"
    ],
    "original_sentence": "The doctor was calm because he had a lot of ___",
    "original_straight": [
      "experience",
      "knowledge",
      "money"
    ],
    "original_punny": [
      "patients"
    ],
    "repair_explanation": "Added 'busy' to better justify why having patients/patience would be notable for staying calm, making the setup more natural while keeping the classic pun intact.",
    "claudecode_explanation": "\"Patients\" sounds like \"patience.\" A doctor with a lot of patients/patience — classic homophone that works perfectly in context.",
    "claudecode_rating": 6
  },
  {
    "id": 349,
    "sentence": "The astronaut's restaurant was popular because it had great ___",
    "straight": [
      "service",
      "food",
      "ambiance"
    ],
    "punny": [
      "atmosphere"
    ],
    "original_sentence": "The astronaut's podcast was popular because it had great ___",
    "original_straight": [
      "content",
      "guests",
      "sound"
    ],
    "original_punny": [
      "atmosphere"
    ],
    "repair_explanation": "Changed from podcast to restaurant because restaurants are commonly praised for their 'atmosphere,' making the double meaning work more naturally with the space context.",
    "claudecode_explanation": "\"Atmosphere\" means ambiance and literal atmosphere (space). An astronaut's restaurant with great atmosphere — both meanings are strong and the scenario is fun.",
    "claudecode_rating": 7
  },
  {
    "id": 350,
    "sentence": "The corduroy pillows left marks on people's faces because they were ___",
    "straight": [
      "textured",
      "rough",
      "ridged"
    ],
    "punny": [
      "making headlines"
    ],
    "original_sentence": "The corduroy pillows were making headlines because they were ___",
    "original_straight": [
      "popular",
      "selling out",
      "trendy"
    ],
    "original_punny": [
      "making headlines"
    ],
    "repair_explanation": "Fixed the circular structure by moving the pun to the blank and creating a setup that explains why corduroy pillows would literally make 'headlines' (line marks) on faces.",
    "claudecode_explanation": "\"Making headlines\" means being newsworthy and leaving head-lines (marks on heads from corduroy). Multi-layered pun that's clever even if the scenario is absurd.",
    "claudecode_rating": 6
  },
  {
    "id": 351,
    "sentence": "The paper factory workers said their workplace was ___",
    "straight": [
      "dangerous",
      "poorly managed",
      "falling apart"
    ],
    "punny": [
      "tear-able"
    ],
    "original_sentence": "The paper factory collapsed because it was ___",
    "original_straight": [
      "old",
      "unsafe",
      "flimsy"
    ],
    "original_punny": [
      "tear-able"
    ],
    "repair_explanation": "Changed to workers describing their workplace rather than stating it collapsed, so 'tear-able/terrible' works as both a complaint about working conditions and a paper-related pun.",
    "claudecode_explanation": "\"Tear-able\" sounds like \"terrible\" and relates to paper tearing. A paper factory that's tear-able — fun homophone pun.",
    "claudecode_rating": 5
  },
  {
    "id": 355,
    "sentence": "The thief who fell into the river started a new career as a ___",
    "straight": [
      "fisherman",
      "swimmer",
      "diver"
    ],
    "punny": [
      "launderer"
    ],
    "original_sentence": "The thief fell into the water and was known as a ___",
    "original_straight": [
      "swimmer",
      "diver",
      "splasher"
    ],
    "original_punny": [
      "launderer"
    ],
    "repair_explanation": "The original setup was too weak - just falling in water doesn't make someone a launderer. The new version suggests the thief changed careers after the incident, making both meanings work: literally doing laundry/cleaning, and metaphorically laundering money as a new criminal venture.",
    "claudecode_explanation": "\"Launderer\" means money launderer and one who launders/washes clothes. A thief who fell in a river becoming a launderer — both meanings are activated by the water. Clever narrative.",
    "claudecode_rating": 7
  },
  {
    "id": 357,
    "sentence": "The clumsy magician tried to make his assistant disappear but accidentally made her ___",
    "straight": [
      "angry",
      "confused",
      "dizzy"
    ],
    "punny": [
      "appear"
    ],
    "original_sentence": "The magician was walking down the street and turned into a ___",
    "original_straight": [
      "shop",
      "alley",
      "corner"
    ],
    "original_punny": [
      "bar"
    ],
    "repair_explanation": "Completely reframed from the tired 'walked into a bar' format to focus on magical incompetence. 'Appear' creates a perfect magic-themed pun - he failed at making her disappear and instead made her 'appear' (become visible/manifest) or 'a peer' (equal status).",
    "claudecode_explanation": "\"Appear\" is just the opposite of \"disappear.\" There's no double meaning — it's a logical reversal, not a pun.",
    "claudecode_rating": 2
  },
  {
    "id": 358,
    "sentence": "The dyslexic devil kept trying to sell his ___",
    "straight": [
      "pitchfork",
      "horns",
      "powers"
    ],
    "punny": [
      "sole"
    ],
    "original_sentence": "The dyslexic devil sold his ___",
    "original_straight": [
      "car",
      "house",
      "furniture"
    ],
    "original_punny": [
      "soul"
    ],
    "repair_explanation": "The original was confusing because devils buy souls, not sell them, and the dyslexia angle was unclear. Now the devil is trying to sell his 'sole' (bottom of foot) instead of his 'soul' due to dyslexia, which makes the wordplay much clearer and funnier.",
    "claudecode_explanation": "\"Sole\" sounds like \"soul.\" A dyslexic devil selling his sole instead of soul — the dyslexia gimmick makes the homophone substitution work as a joke.",
    "claudecode_rating": 6
  },
  {
    "id": 359,
    "sentence": "The raisin couldn't get a job because it lacked ___",
    "straight": [
      "experience",
      "skills",
      "qualifications"
    ],
    "punny": [
      "current"
    ],
    "original_sentence": "The raisin was sad because it had no ___",
    "original_straight": [
      "friends",
      "family",
      "home"
    ],
    "original_punny": [
      "current"
    ],
    "repair_explanation": "Changed the context from being sad to job hunting, which makes 'current' work better in both senses: lacking current (up-to-date) experience/skills, and the homophone with 'currant' (the fresh fruit that becomes a raisin when dried).",
    "claudecode_explanation": "\"Current\" sounds like \"currant\" (a dried grape/berry). A raisin (dried grape) lacking current/currant — the fruit family connection is clever and the homophone works.",
    "claudecode_rating": 6
  },
  {
    "id": 363,
    "sentence": "The dentist's garden was failing because he kept pulling up the ___",
    "straight": [
      "weeds",
      "seedlings",
      "flowers"
    ],
    "punny": [
      "roots"
    ],
    "original_sentence": "The dentist had a garden and loved his ___",
    "original_straight": [
      "flowers",
      "vegetables",
      "plants"
    ],
    "original_punny": [
      "roots"
    ],
    "repair_explanation": "The original was too predictable and static. The new version creates a scenario where the dentist's professional habit (pulling teeth/roots) interferes with his gardening, making both meanings of 'roots' work actively in the joke rather than just being a simple connection.",
    "claudecode_explanation": "\"Roots\" means pulling teeth (dental roots) and pulling up plant roots. A dentist's garden failing because he keeps pulling up roots — the crossover action is perfect.",
    "claudecode_rating": 6
  },
  {
    "id": 364,
    "sentence": "The traffic light was embarrassed and turned red when it had to ___",
    "straight": [
      "stop traffic",
      "halt cars",
      "work again"
    ],
    "punny": [
      "change"
    ],
    "original_sentence": "The traffic light turned red because it would have to ___",
    "original_straight": [
      "stop cars",
      "halt traffic",
      "wait"
    ],
    "original_punny": [
      "change"
    ],
    "repair_explanation": "The original lacked clear causality between turning red and having to change. The repair establishes that the light turned red from embarrassment about having to change (like changing clothes in public), while maintaining the literal meaning of traffic lights changing colors.",
    "claudecode_explanation": "\"Change\" means changing color (traffic light) and changing clothes/behavior. A traffic light turning red from embarrassment when it had to change — personification plus dual meaning. Charming.",
    "claudecode_rating": 7
  },
  {
    "id": 365,
    "sentence": "The calculus teacher became a DJ because she was great at finding the ___",
    "straight": [
      "tempo",
      "melody",
      "bassline"
    ],
    "punny": [
      "derivative"
    ],
    "original_sentence": "The math teacher was a good dancer because she had ___",
    "original_straight": [
      "practice",
      "training",
      "lessons"
    ],
    "original_punny": [
      "algorithm"
    ],
    "repair_explanation": "Shifted from dancing to DJing for a fresher angle. 'Derivative' works as both a calculus concept and music term (derived/sampled beats). This creates a more natural professional connection than the forced 'algorithm/rhythm' stretch, making both meanings equally strong.",
    "claudecode_explanation": "\"Derivative\" means unoriginal (in DJ context) and a calculus term. A calculus teacher finding derivatives as a DJ — the dual meaning exists but \"finding the derivative\" in DJing is a stretch.",
    "claudecode_rating": 4
  },
  {
    "id": 367,
    "sentence": "The lettuce always won the vegetable debates because it was a ___",
    "straight": [
      "genius",
      "natural",
      "champion"
    ],
    "punny": [
      "head"
    ],
    "original_sentence": "The lettuce was the leader of the vegetables because it was ___",
    "original_straight": [
      "respected",
      "oldest",
      "wisest"
    ],
    "original_punny": [
      "ahead"
    ],
    "repair_explanation": "Changed from the obvious 'ahead' pun to focus on lettuce being 'a head' - both a smart person and literally a head of lettuce. The debate context makes 'head' (smart person) feel more natural.",
    "claudecode_explanation": "\"Head\" means a head of lettuce and being ahead/the leader. Lettuce winning debates because it's a head — clean and funny.",
    "claudecode_rating": 6
  },
  {
    "id": 369,
    "sentence": "The tie didn't want to work and just preferred to ___",
    "straight": [
      "relax",
      "rest",
      "be idle"
    ],
    "punny": [
      "hang around"
    ],
    "original_sentence": "The tie was lazy and just wanted to ___",
    "original_straight": [
      "sleep",
      "rest",
      "relax"
    ],
    "original_punny": [
      "hang around"
    ],
    "repair_explanation": "Changed 'lazy' to 'didn't want to work' and 'wanted to' to 'preferred to' for more natural phrasing. This makes the connection between avoiding work and literally hanging cleaner and less forced.",
    "claudecode_explanation": "\"Hang around\" means loiter and ties literally hanging. A tie that prefers to hang around — both meanings work. Simple personification pun.",
    "claudecode_rating": 5
  },
  {
    "id": 370,
    "sentence": "The paperback novel became a detective because it was great at working ___",
    "straight": [
      "mysteries",
      "cases",
      "investigations"
    ],
    "punny": [
      "undercover"
    ],
    "original_sentence": "The book joined the police because it wanted to go under ___",
    "original_straight": [
      "investigation",
      "ground",
      "oath"
    ],
    "original_punny": [
      "cover"
    ],
    "repair_explanation": "Switched from 'going under cover' to 'working undercover' which flows more naturally, and made it specifically a paperback to strengthen the cover connection while keeping the detective theme.",
    "claudecode_explanation": "\"Undercover\" means secret detective work and literally under a book cover. A paperback detective working undercover — both meanings are activated beautifully. Clever.",
    "claudecode_rating": 7
  },
  {
    "id": 371,
    "sentence": "The dictionary was surprisingly bad at debates because it couldn't find the right ___",
    "straight": [
      "arguments",
      "responses",
      "comebacks"
    ],
    "punny": [
      "words"
    ],
    "original_sentence": "The dictionary was confident because it had a way with ___",
    "original_straight": [
      "people",
      "ladies",
      "negotiation"
    ],
    "original_punny": [
      "words"
    ],
    "repair_explanation": "The original was too obvious and predictable. Now the irony is that a dictionary, despite containing all words, struggles to find the right ones in conversation, making the pun more surprising.",
    "claudecode_explanation": "A dictionary that can't find the right words is ironic, but \"words\" doesn't have a real double meaning here. It's situational irony rather than a pun.",
    "claudecode_rating": 4
  },
  {
    "id": 372,
    "sentence": "The alien felt cramped in his studio apartment because he was used to having infinite ___",
    "straight": [
      "room",
      "freedom",
      "possibilities"
    ],
    "punny": [
      "space"
    ],
    "original_sentence": "The alien moved to a bigger house because he needed more ___",
    "original_straight": [
      "rooms",
      "bedrooms",
      "closets"
    ],
    "original_punny": [
      "space"
    ],
    "repair_explanation": "Enhanced the setup to emphasize the contrast between confined living and the vastness of outer space, making the pun less predictable while keeping the same wordplay.",
    "claudecode_explanation": "\"Space\" means room/living space and outer space. An alien cramped because he's used to infinite space — both meanings work and the scenario is charming.",
    "claudecode_rating": 6
  },
  {
    "id": 374,
    "sentence": "The zombie failed his diet because he couldn't stop craving ___",
    "straight": [
      "junk food",
      "sweets",
      "carbs"
    ],
    "punny": [
      "brains"
    ],
    "original_sentence": "The zombie was smart because he loved ___",
    "original_straight": [
      "reading",
      "school",
      "learning"
    ],
    "original_punny": [
      "brains"
    ],
    "repair_explanation": "Shifted from the obvious 'smart zombie loves brains' to a more unexpected diet context, making the brain-craving pun more surprising while maintaining the double meaning.",
    "claudecode_explanation": "\"Brains\" means intelligence and zombie food. A zombie failing his diet by craving brains — this is more of a literal joke about zombies than a double-meaning pun.",
    "claudecode_rating": 4
  },
  {
    "id": 376,
    "sentence": "The mountain was seeing a therapist because everyone kept telling it to ___",
    "straight": [
      "relax",
      "calm down",
      "move on"
    ],
    "punny": [
      "get over itself"
    ],
    "original_sentence": "The hill was depressed because it couldn't ___",
    "original_straight": [
      "succeed",
      "grow",
      "improve"
    ],
    "original_punny": [
      "get over it"
    ],
    "repair_explanation": "Reframed as therapy advice that mountains literally can't follow. 'Get over itself' is both common self-help advice and physically impossible for a mountain, making the absurdity funnier.",
    "claudecode_explanation": "\"Get over itself\" means stop being self-important and physically climbing over the mountain. Both meanings are strong and the therapy scenario adds humor. Excellent.",
    "claudecode_rating": 8
  },
  {
    "id": 377,
    "sentence": "The beach was terrible at making decisions because it was never ___",
    "straight": [
      "certain",
      "confident",
      "decisive"
    ],
    "punny": [
      "shore"
    ],
    "original_sentence": "The beach was confident because it was ___",
    "original_straight": [
      "beautiful",
      "sunny",
      "warm"
    ],
    "original_punny": [
      "shore"
    ],
    "repair_explanation": "Changed from confident to indecisive to make the 'shore/sure' pun more meaningful - now the beach's literal nature (being a shore) explains its personality flaw (never being sure).",
    "claudecode_explanation": "\"Shore\" sounds like \"sure.\" A beach that's never shore/sure — clean homophone with fun personification.",
    "claudecode_rating": 6
  },
  {
    "id": 379,
    "sentence": "The dolphin approached every task with a clear ___",
    "straight": [
      "goal",
      "intention",
      "objective"
    ],
    "punny": [
      "porpoise"
    ],
    "original_sentence": "The dolphin did everything with a ___",
    "original_straight": [
      "smile",
      "laugh",
      "grin"
    ],
    "original_punny": [
      "porpoise"
    ],
    "repair_explanation": "The original was too generic and predictable. The new setup emphasizes intentionality and clarity, making 'porpoise' (purpose) feel more natural and specific to the context.",
    "claudecode_explanation": "\"Porpoise\" sounds like \"purpose.\" A dolphin with a clear porpoise/purpose — classic animal homophone pun. Clean and fun.",
    "claudecode_rating": 6
  },
  {
    "id": 380,
    "sentence": "The lobster won the storytelling contest with his incredible ___",
    "straight": [
      "narrative",
      "story",
      "performance"
    ],
    "punny": [
      "tale"
    ],
    "original_sentence": "The lobster was a good storyteller because he had a great ___",
    "original_straight": [
      "memory",
      "imagination",
      "voice"
    ],
    "original_punny": [
      "tail"
    ],
    "repair_explanation": "Changed from 'tail' to 'tale' to make the pun clearer, and improved the setup to emphasize winning a contest, making the punchline feel more earned and specific.",
    "claudecode_explanation": "\"Tale\" sounds like \"tail.\" A lobster winning a storytelling contest with an incredible tale/tail — both meanings are strong. Clean.",
    "claudecode_rating": 6
  },
  {
    "id": 382,
    "sentence": "The health-conscious lizard stepped on the bathroom ___",
    "straight": [
      "mat",
      "floor",
      "tiles"
    ],
    "punny": [
      "scales"
    ],
    "original_sentence": "The lizard was worried about his weight so he bought ___",
    "original_straight": [
      "diet pills",
      "gym membership",
      "vegetables"
    ],
    "original_punny": [
      "scales"
    ],
    "repair_explanation": "Made the setup more specific and natural by focusing on the action of weighing oneself, which directly connects to both meanings of 'scales' without forcing the weight concern angle.",
    "claudecode_explanation": "\"Scales\" means weighing scales and lizard scales. A health-conscious lizard on a bathroom scale — both meanings are perfectly natural. Fun personification.",
    "claudecode_rating": 7
  },
  {
    "id": 383,
    "sentence": "The zebra couldn't get through security because he looked like a ___",
    "straight": [
      "criminal",
      "suspect",
      "threat"
    ],
    "punny": [
      "barcode"
    ],
    "original_sentence": "The zebra couldn't be scanned because he was a ___",
    "original_straight": [
      "animal",
      "horse",
      "mammal"
    ],
    "original_punny": [
      "barcode"
    ],
    "repair_explanation": "Fixed the logical contradiction by changing the scenario to security screening, where looking like a barcode would actually cause scanning/identification problems, making both meanings work together.",
    "claudecode_explanation": "\"Barcode\" looks like black and white stripes, just like a zebra. A zebra looking like a barcode at security — visual humor with a clever connection. Not a traditional pun but very funny.",
    "claudecode_rating": 7
  },
  {
    "id": 385,
    "sentence": "The insomniac mattress salesman finally found his ___",
    "straight": [
      "calling",
      "passion",
      "purpose"
    ],
    "punny": [
      "sleep"
    ],
    "original_sentence": "The mattress salesman was the best because he never lost any ___",
    "original_straight": [
      "customers",
      "deals",
      "money"
    ],
    "original_punny": [
      "sleep"
    ],
    "repair_explanation": "Reframed as an insomniac finding their calling in mattress sales, making the connection between personal need (sleep) and professional expertise more meaningful and ironic.",
    "claudecode_explanation": "\"Found his sleep\" means fell asleep and... mattress sleep? There's no meaningful double meaning. A mattress salesman finding sleep is just literal.",
    "claudecode_rating": 3
  },
  {
    "id": 386,
    "sentence": "The electrician was surprisingly good at romance because he always brought the ___",
    "straight": [
      "passion",
      "chemistry",
      "energy"
    ],
    "punny": [
      "spark"
    ],
    "original_sentence": "The electrician was a great date because he always brought a ___",
    "original_straight": [
      "gift",
      "surprise",
      "smile"
    ],
    "original_punny": [
      "spark"
    ],
    "repair_explanation": "The original was too predictable and the setup didn't create enough surprise. By focusing on romance and making it unexpected ('surprisingly good'), the pun becomes more satisfying when 'spark' delivers both romantic chemistry and his electrical expertise.",
    "claudecode_explanation": "\"Spark\" means romantic spark and electrical spark. Both meanings work naturally for an electrician in a romantic context.",
    "claudecode_rating": 6
  },
  {
    "id": 388,
    "sentence": "The calendar was the most sought-after student because it always had ___",
    "straight": [
      "plans",
      "activities",
      "events"
    ],
    "punny": [
      "dates"
    ],
    "original_sentence": "The calendar was popular at school because it had so many ___",
    "original_straight": [
      "fans",
      "features",
      "friends"
    ],
    "original_punny": [
      "dates"
    ],
    "repair_explanation": "Changed from 'popular' to 'most sought-after' to better emphasize the dating angle, and 'always had dates' works better than 'so many dates' for both meanings - having romantic dates makes you desirable, and calendars always have calendar dates.",
    "claudecode_explanation": "\"Dates\" means romantic dates and calendar dates. A calendar always having dates — both meanings work. Classic and clean.",
    "claudecode_rating": 6
  },
  {
    "id": 389,
    "sentence": "The statistics teacher was impossible to befriend because she was so ___",
    "straight": [
      "harsh",
      "cruel",
      "nasty"
    ],
    "punny": [
      "mean"
    ],
    "original_sentence": "The math teacher had no friends because she was incredibly ___",
    "original_straight": [
      "strict",
      "cold",
      "boring"
    ],
    "original_punny": [
      "mean"
    ],
    "repair_explanation": "Specified 'statistics teacher' instead of generic 'math teacher' to make the 'mean' (average) connection more precise and immediate. The setup now flows more naturally while strengthening both meanings of the pun.",
    "claudecode_explanation": "\"Mean\" means unkind and the statistical mean (average). A statistics teacher being mean — both meanings are equally strong. Clever and concise.",
    "claudecode_rating": 7
  },
  {
    "id": 390,
    "sentence": "The dentist became a successful football coach because he was obsessed with ___",
    "straight": [
      "repetition",
      "fundamentals",
      "precision"
    ],
    "punny": [
      "drills"
    ],
    "original_sentence": "The dentist made a great football coach because he believed in ___",
    "original_straight": [
      "teamwork",
      "practice",
      "discipline"
    ],
    "original_punny": [
      "drills"
    ],
    "repair_explanation": "Changed 'believed in' to 'obsessed with' to make the sentence more dynamic and natural-sounding. The obsession works for both dental drills (professional tool) and football drills (practice method), creating a stronger character-driven setup.",
    "claudecode_explanation": "\"Drills\" means dental drills and practice drills. Both meanings are strong for a dentist turned football coach.",
    "claudecode_rating": 6
  },
  {
    "id": 392,
    "sentence": "The undertaker took his work very seriously - you could say he was quite ___",
    "straight": [
      "solemn",
      "dignified",
      "professional"
    ],
    "punny": [
      "grave"
    ],
    "original_sentence": "The undertaker's demeanor was always very ___",
    "original_straight": [
      "quiet",
      "calm",
      "reserved"
    ],
    "original_punny": [
      "grave"
    ],
    "repair_explanation": "Added 'you could say' to create a more conversational, less predictable setup that acknowledges the wordplay. This makes the pun feel more intentional and playful while maintaining the natural flow of both meanings.",
    "claudecode_explanation": "\"Grave\" means serious and cemetery graves. An undertaker being grave — classic and clean. Both meanings fire simultaneously.",
    "claudecode_rating": 6
  },
  {
    "id": 393,
    "sentence": "The barber's stories were always engaging because they had such a good ___",
    "straight": [
      "plot",
      "ending",
      "flow"
    ],
    "punny": [
      "twist"
    ],
    "original_sentence": "The barber was a great storyteller because his tales always had a new ___",
    "original_straight": [
      "angle",
      "perspective",
      "ending"
    ],
    "original_punny": [
      "twist"
    ],
    "repair_explanation": "The original was too loose since barbers don't primarily twist hair. Changed to focus on story quality where 'twist' works naturally for both plot twists and the twisting motion in hair styling.",
    "claudecode_explanation": "\"Twist\" means a plot twist in stories and a hair twist. Both meanings work for a barber's stories, though the connection is mild.",
    "claudecode_rating": 5
  },
  {
    "id": 394,
    "sentence": "The coal miner's dating profile said he was looking for someone who didn't find him ___",
    "straight": [
      "unattractive",
      "annoying",
      "disappointing"
    ],
    "punny": [
      "boring"
    ],
    "original_sentence": "The miner quit his job because the work was incredibly ___",
    "original_straight": [
      "tedious",
      "exhausting",
      "repetitive"
    ],
    "original_punny": [
      "boring"
    ],
    "repair_explanation": "Moved to a dating context where 'boring' as personality trait feels more natural and relatable, while maintaining the mining/drilling double meaning. The personal angle makes it less predictable.",
    "claudecode_explanation": "\"Boring\" means dull personality and boring/drilling in mining. A coal miner's dating profile — both meanings work and the scenario is funny.",
    "claudecode_rating": 6
  },
  {
    "id": 396,
    "sentence": "The Swiss cheese maker's alibis were always ___",
    "straight": [
      "suspicious",
      "unconvincing",
      "questionable"
    ],
    "punny": [
      "full of holes"
    ],
    "original_sentence": "The cheese maker's excuses were always full of ___",
    "original_straight": [
      "lies",
      "nonsense",
      "contradictions"
    ],
    "original_punny": [
      "holes"
    ],
    "repair_explanation": "Specified Swiss cheese maker and changed to 'alibis' to create a crime/mystery context, making 'full of holes' feel more dramatic while strengthening the cheese connection.",
    "claudecode_explanation": "\"Full of holes\" means logically weak and Swiss cheese literally has holes. Both meanings are equally strong. Classic and satisfying.",
    "claudecode_rating": 7
  },
  {
    "id": 397,
    "sentence": "The newspaper boy was great at poker because he knew how to ___",
    "straight": [
      "win",
      "compete",
      "bluff"
    ],
    "punny": [
      "deal"
    ],
    "original_sentence": "The paper delivery boy was great at poker because he knew how to ___",
    "original_straight": [
      "win",
      "compete",
      "bluff"
    ],
    "original_punny": [
      "deal"
    ],
    "repair_explanation": "Changed 'paper delivery boy' to 'newspaper boy' to make the connection more natural, since we commonly say 'deal newspapers' alongside 'deal cards.'",
    "claudecode_explanation": "\"Deal\" means deal cards and deal/deliver newspapers. Both meanings work for a newspaper boy at poker. Clean.",
    "claudecode_rating": 5
  },
  {
    "id": 398,
    "sentence": "The submarine captain was terrible at ordering lunch because he could never decide on a ___",
    "straight": [
      "meal",
      "entree",
      "dish"
    ],
    "punny": [
      "sub"
    ],
    "original_sentence": "The submarine captain's favorite sandwich was a ___",
    "original_straight": [
      "club",
      "BLT",
      "turkey"
    ],
    "original_punny": [
      "sub"
    ],
    "repair_explanation": "The original was too obvious and predictable. Added indecision element to create misdirection and surprise, while maintaining the submarine/sandwich double meaning.",
    "claudecode_explanation": "\"Sub\" means submarine and a sandwich sub. A submarine captain ordering a sub for lunch — both meanings are clear and the confusion is funny.",
    "claudecode_rating": 6
  },
  {
    "id": 399,
    "sentence": "The fireworks manufacturer's quarterly report showed sales were absolutely ___",
    "straight": [
      "spectacular",
      "explosive",
      "impressive"
    ],
    "punny": [
      "booming"
    ],
    "original_sentence": "The fireworks company had a great year because business was ___",
    "original_straight": [
      "successful",
      "profitable",
      "growing"
    ],
    "original_punny": [
      "booming"
    ],
    "repair_explanation": "Changed from generic 'great year/business' to a more specific corporate context with 'quarterly report' and 'sales were absolutely' which makes the punchline feel more surprising and natural.",
    "claudecode_explanation": "\"Booming\" means thriving and explosions booming. Fireworks sales that are booming — both meanings are perfectly natural.",
    "claudecode_rating": 7
  },
  {
    "id": 401,
    "sentence": "The railroad worker couldn't save his marriage once it went off the ___",
    "straight": [
      "deep end",
      "edge",
      "cliff"
    ],
    "punny": [
      "rails"
    ],
    "original_sentence": "The railroad worker's marriage failed because he went off the ___",
    "original_straight": [
      "deep end",
      "handle",
      "edge"
    ],
    "original_punny": [
      "rails"
    ],
    "repair_explanation": "Changed the subject from 'he' to 'it' (the marriage) to make the idiom 'went off the rails' more natural while maintaining the railroad connection.",
    "claudecode_explanation": "\"Off the rails\" means out of control and literal railroad rails. A railroad worker's marriage going off the rails — clean idiom play.",
    "claudecode_rating": 6
  },
  {
    "id": 403,
    "sentence": "The tailor dominated every poker night because he knew exactly which cards to ___",
    "straight": [
      "play",
      "hold",
      "fold"
    ],
    "punny": [
      "suit"
    ],
    "original_sentence": "The tailor was great at poker because he always had a winning ___",
    "original_straight": [
      "strategy",
      "smile",
      "attitude"
    ],
    "original_punny": [
      "suit"
    ],
    "repair_explanation": "Reframed from 'having a winning suit' to 'which cards to suit' which creates a more active verb form and makes the tailor's skill feel more strategic and specific.",
    "claudecode_explanation": "\"Suit\" means card suits and clothing suits. A tailor knowing which cards to suit — both meanings are active. Creative crossover.",
    "claudecode_rating": 7
  },
  {
    "id": 404,
    "sentence": "The anger management counselor quit working with the volcano because it kept losing its ___",
    "straight": [
      "temper",
      "cool",
      "composure"
    ],
    "punny": [
      "top"
    ],
    "original_sentence": "The volcano was unreliable because it kept blowing its ___",
    "original_straight": [
      "chance",
      "opportunity",
      "budget"
    ],
    "original_punny": [
      "top"
    ],
    "repair_explanation": "Added the unexpected context of anger management therapy, which makes the 'losing its top' pun work on multiple levels and creates a more absurd, memorable scenario.",
    "claudecode_explanation": "\"Losing its top\" means losing its temper and a volcanic eruption (blowing its top). An anger management counselor with a volcano client — the scenario is hilarious and both meanings are strong.",
    "claudecode_rating": 7
  },
  {
    "id": 405,
    "sentence": "The music store owner was stuck in a rut, always playing the same old ___",
    "straight": [
      "songs",
      "tunes",
      "playlist"
    ],
    "punny": [
      "records"
    ],
    "original_sentence": "The music store was failing because it kept going through the same old ___",
    "original_straight": [
      "problems",
      "struggles",
      "staff"
    ],
    "original_punny": [
      "records"
    ],
    "repair_explanation": "Changed 'going through' to 'playing' to make the music connection more natural, and reframed as being stuck in repetitive patterns rather than having problems.",
    "claudecode_explanation": "\"Records\" means vinyl records and business records. But a music store owner playing records is just literal — there's no meaningful second meaning in context.",
    "claudecode_rating": 4
  },
  {
    "id": 406,
    "sentence": "The undertaker had a great sense of humor, but it was completely ___",
    "straight": [
      "hidden",
      "concealed",
      "suppressed"
    ],
    "punny": [
      "buried"
    ],
    "original_sentence": "The undertaker's sense of humor was completely ___",
    "original_straight": [
      "gone",
      "absent",
      "nonexistent"
    ],
    "original_punny": [
      "buried"
    ],
    "repair_explanation": "The original setup was contradictory - if his humor was 'completely buried' it suggests it was hidden/suppressed, not absent. Changed to acknowledge he has humor that's buried/hidden, making both meanings work positively.",
    "claudecode_explanation": "\"Buried\" means hidden/suppressed and burying bodies (undertaker). An undertaker with buried humor — both meanings are strong. Clean.",
    "claudecode_rating": 6
  },
  {
    "id": 408,
    "sentence": "The librarian's therapist said her anxiety stemmed from feeling constantly ___",
    "straight": [
      "behind",
      "pressured",
      "overwhelmed"
    ],
    "punny": [
      "overdue"
    ],
    "original_sentence": "The librarian was stressed because all her work was ___",
    "original_straight": [
      "unfinished",
      "neglected",
      "incomplete"
    ],
    "original_punny": [
      "overdue"
    ],
    "repair_explanation": "Shifted from work stress to personal therapy context, making 'feeling overdue' more emotionally resonant while maintaining the library book connection in a fresher way.",
    "claudecode_explanation": "\"Overdue\" means behind schedule/late and overdue library books. A librarian feeling constantly overdue — both meanings are equally natural. Tight.",
    "claudecode_rating": 7
  },
  {
    "id": 409,
    "sentence": "The stockbroker was a terrible chef because he could never make good ___",
    "straight": [
      "soup",
      "broth",
      "sauce"
    ],
    "punny": [
      "stock"
    ],
    "original_sentence": "The stockbroker was a terrible chef because he could never handle the ___",
    "original_straight": [
      "pressure",
      "heat",
      "mess"
    ],
    "original_punny": [
      "stock"
    ],
    "repair_explanation": "Fixed the awkward phrasing 'handle the stock' to 'make good stock' which is natural cooking language. Now both meanings work: making cooking stock (broth) and making good financial stock picks.",
    "claudecode_explanation": "\"Stock\" means financial stock and cooking stock/broth. A stockbroker making bad stock in the kitchen — both meanings are perfectly natural. Great crossover.",
    "claudecode_rating": 7
  },
  {
    "id": 410,
    "sentence": "The magician was frustrated with his new fishing hobby because his catches kept ___",
    "straight": [
      "escaping",
      "getting away",
      "slipping off"
    ],
    "punny": [
      "vanishing"
    ],
    "original_sentence": "The magician was a terrible fisherman because everything kept ___",
    "original_straight": [
      "escaping",
      "breaking free",
      "slipping away"
    ],
    "original_punny": [
      "disappearing"
    ],
    "repair_explanation": "Changed 'disappearing' to 'vanishing' which is more specifically magical terminology, and reframed as his catches vanishing rather than everything disappearing, creating a stronger connection between magic tricks and lost fish.",
    "claudecode_explanation": "\"Vanishing\" means disappearing (magic) and fish getting away. A magician whose catches vanish — both meanings work and the frustration is relatable.",
    "claudecode_rating": 6
  },
  {
    "id": 411,
    "sentence": "The coffee shop owner's dating profile warned that her last three relationships had gone ___",
    "straight": [
      "wrong",
      "badly",
      "nowhere"
    ],
    "punny": [
      "bitter"
    ],
    "original_sentence": "The barista was always single because her relationships turned ___",
    "original_straight": [
      "sour",
      "bad",
      "toxic"
    ],
    "original_punny": [
      "bitter"
    ],
    "repair_explanation": "Changed from generic barista to coffee shop owner and added the dating profile context, which makes the 'gone bitter' revelation feel like a humorous warning rather than just an observation.",
    "claudecode_explanation": "\"Bitter\" means resentful and bitter-tasting coffee. A coffee shop owner whose relationships went bitter — both meanings are strong. Good personal ad humor.",
    "claudecode_rating": 7
  },
  {
    "id": 412,
    "sentence": "The wool farmer was devastated because his sweater business was ___",
    "straight": [
      "failing",
      "collapsing",
      "declining"
    ],
    "punny": [
      "shrinking"
    ],
    "original_sentence": "The wool farmer panicked because his profits were ___",
    "original_straight": [
      "falling",
      "declining",
      "dropping"
    ],
    "original_punny": [
      "shrinking"
    ],
    "repair_explanation": "The original was actually quite good, but making it specifically about a sweater business strengthens the wool-shrinking connection. This makes the shrinking reference more directly tied to the actual problem wool farmers face with their products.",
    "claudecode_explanation": "\"Shrinking\" means declining and wool shrinking in the wash. A wool farmer's sweater business shrinking — both meanings are equally natural. Good.",
    "claudecode_rating": 7
  },
  {
    "id": 413,
    "sentence": "The gardener's prize roses deteriorated and ___",
    "straight": [
      "withered",
      "died",
      "failed"
    ],
    "punny": [
      "went to seed"
    ],
    "original_sentence": "The gardener's career went to ___",
    "original_straight": [
      "waste",
      "ruin",
      "nothing"
    ],
    "original_punny": [
      "seed"
    ],
    "repair_explanation": "Changed from the vague 'career went to' to 'roses deteriorated and' to make the 'went to seed' phrase feel more natural and directly connected to actual gardening, where plants literally go to seed when they deteriorate.",
    "claudecode_explanation": "\"Went to seed\" means deteriorated and plants literally going to seed. A gardener's roses going to seed — classic idiom that maps perfectly to the profession.",
    "claudecode_rating": 5
  },
  {
    "id": 414,
    "sentence": "The cattle rancher was proud when food critics called his steaks ___",
    "straight": [
      "exceptional",
      "outstanding",
      "perfect"
    ],
    "punny": [
      "rare"
    ],
    "original_sentence": "The cattle rancher was upset because critics called his work ___",
    "original_straight": [
      "poor",
      "mediocre",
      "sloppy"
    ],
    "original_punny": [
      "rare"
    ],
    "repair_explanation": "Flipped from negative to positive context since 'rare' steaks are actually desirable and high-quality. Now both meanings work: the rancher is proud of rare (excellent) steaks that are also rare (cooking style).",
    "claudecode_explanation": "\"Rare\" means exceptional and steak doneness. A cattle rancher proud of rare steaks — both meanings work simultaneously. Clean and satisfying.",
    "claudecode_rating": 7
  },
  {
    "id": 415,
    "sentence": "When the egg farmer tried to organize his inventory, everything turned into a complete ___",
    "straight": [
      "disaster",
      "mess",
      "chaos"
    ],
    "punny": [
      "scramble"
    ],
    "original_sentence": "The egg farmer's morning was chaotic and turned into a total ___",
    "original_straight": [
      "disaster",
      "mess",
      "nightmare"
    ],
    "original_punny": [
      "scramble"
    ],
    "repair_explanation": "Changed from a generic 'chaotic morning' to the specific scenario of organizing inventory, making the scramble pun more surprising and contextually richer. The setup now has a clearer cause-and-effect relationship.",
    "claudecode_explanation": "\"Scramble\" means chaos and scrambled eggs. Egg farmer inventory turning into a scramble — both meanings are natural and vivid.",
    "claudecode_rating": 7
  },
  {
    "id": 416,
    "sentence": "The pencil artist made so many mistakes that she had to constantly ___",
    "straight": [
      "restart",
      "correct",
      "redo"
    ],
    "punny": [
      "erase"
    ],
    "original_sentence": "The artist couldn't forget her ex because the memories were hard to ___",
    "original_straight": [
      "ignore",
      "forget",
      "process"
    ],
    "original_punny": [
      "erase"
    ],
    "repair_explanation": "Shifted from emotional memories to practical art-making to make 'erase' feel more naturally connected to the artist's work. Now it's about literally erasing pencil marks rather than the weaker metaphor of erasing memories.",
    "claudecode_explanation": "A pencil artist erasing mistakes is just literal — erasing is what pencil artists do. There's no real double meaning.",
    "claudecode_rating": 3
  },
  {
    "id": 417,
    "sentence": "The fruit vendor's new smoothie recipe made all his customers go ___",
    "straight": [
      "crazy",
      "wild",
      "nuts"
    ],
    "punny": [
      "bananas"
    ],
    "original_sentence": "The fruit farmer lost his temper and went completely ___",
    "original_straight": [
      "crazy",
      "wild",
      "berserk"
    ],
    "original_punny": [
      "bananas"
    ],
    "repair_explanation": "Shifted from the predictable 'farmer losing temper' setup to customers' reactions to a smoothie, making the bananas punchline feel more organic and unexpected while maintaining the fruit business connection.",
    "claudecode_explanation": "\"Go bananas\" means go crazy and literal bananas. A fruit vendor's customers going bananas — clean idiom play. Fun.",
    "claudecode_rating": 6
  },
  {
    "id": 418,
    "sentence": "The road construction worker was always complaining because his job was full of ___",
    "straight": [
      "problems",
      "challenges",
      "difficulties"
    ],
    "punny": [
      "bumps"
    ],
    "original_sentence": "The road construction worker was always grumpy because life was full of ___",
    "original_straight": [
      "problems",
      "setbacks",
      "hassles"
    ],
    "original_punny": [
      "bumps"
    ],
    "repair_explanation": "Changed from 'life was full of' to 'job was full of' to make the connection more direct and natural, and 'complaining' instead of 'grumpy' flows better with the setup.",
    "claudecode_explanation": "\"Bumps\" means difficulties and road bumps. Both meanings are natural for a road construction worker. Standard but works.",
    "claudecode_rating": 5
  },
  {
    "id": 419,
    "sentence": "The fabric store owner said their new inventory was really ___",
    "straight": [
      "impressive",
      "high-quality",
      "popular"
    ],
    "punny": [
      "material"
    ],
    "original_sentence": "The fabric store's new campaign succeeded because the ads were truly ___",
    "original_straight": [
      "effective",
      "creative",
      "impressive"
    ],
    "original_punny": [
      "material"
    ],
    "repair_explanation": "The original phrasing 'ads were truly material' was forced and unnatural. Changed to 'inventory was really material' which flows better and makes both meanings work naturally.",
    "claudecode_explanation": "\"Material\" means significant/important and fabric material. New fabric inventory that's really material — both meanings work. Clean.",
    "claudecode_rating": 6
  },
  {
    "id": 420,
    "sentence": "The cemetery worker's social life was ___",
    "straight": [
      "nonexistent",
      "boring",
      "lifeless"
    ],
    "punny": [
      "dead"
    ],
    "original_sentence": "The cemetery worker was lonely because everyone around him was ___",
    "original_straight": [
      "unfriendly",
      "quiet",
      "distant"
    ],
    "original_punny": [
      "dead"
    ],
    "repair_explanation": "Removed the obvious setup about being surrounded by dead people and made it about his social life being 'dead,' creating actual wordplay rather than just stating the obvious.",
    "claudecode_explanation": "\"Dead\" means nonexistent/boring and cemetery dead. A cemetery worker's dead social life — both meanings work but it's extremely predictable.",
    "claudecode_rating": 4
  },
  {
    "id": 421,
    "sentence": "The software developer's new puppy kept giving him too many ___",
    "straight": [
      "problems",
      "headaches",
      "interruptions"
    ],
    "punny": [
      "bugs"
    ],
    "original_sentence": "The computer programmer's dog had too many ___",
    "original_straight": [
      "toys",
      "treats",
      "habits"
    ],
    "original_punny": [
      "bytes"
    ],
    "repair_explanation": "Changed from the overused bytes/bites pun to bugs, which works both as software errors and literal insects that puppies might bring in. More surprising and creates a fresher double meaning.",
    "claudecode_explanation": "\"Bugs\" means software bugs and literal insects (puppy chasing bugs). A developer's puppy giving him bugs — both meanings work and the scenario is cute.",
    "claudecode_rating": 6
  },
  {
    "id": 422,
    "sentence": "The mime's autobiography was a bestseller despite having no ___",
    "straight": [
      "pictures",
      "index",
      "citations"
    ],
    "punny": [
      "words"
    ],
    "original_sentence": "The mime's autobiography was controversial because it had no ___",
    "original_straight": [
      "pictures",
      "index",
      "citations"
    ],
    "original_punny": [
      "words"
    ],
    "repair_explanation": "Changed 'controversial because' to 'bestseller despite' to create genuine irony. Now both meanings work: an autobiography with no words is literally impossible but perfectly fitting for a silent mime, making the success surprising and funny.",
    "claudecode_explanation": "A mime's autobiography with no words is funny as irony, but \"words\" doesn't have a double meaning. It's situational humor, not a pun.",
    "claudecode_rating": 4
  },
  {
    "id": 423,
    "sentence": "The salt mine worker was hard to work with because he was always ___",
    "straight": [
      "angry",
      "grumpy",
      "irritable"
    ],
    "punny": [
      "salty"
    ],
    "original_sentence": "The pepper farmer was hard to work with because he was always ___",
    "original_straight": [
      "angry",
      "grumpy",
      "irritable"
    ],
    "original_punny": [
      "salty"
    ],
    "repair_explanation": "Changed from pepper farmer to salt mine worker to fix the mismatched seasoning connection. Now 'salty' works perfectly for both the worker's attitude and his actual work environment with salt.",
    "claudecode_explanation": "\"Salty\" means bitter/resentful and literally salty. A salt mine worker being salty — both meanings work perfectly.",
    "claudecode_rating": 6
  },
  {
    "id": 424,
    "sentence": "The manicurist's relationship ended because her boyfriend thought she was too ___",
    "straight": [
      "demanding",
      "controlling",
      "critical"
    ],
    "punny": [
      "polished"
    ],
    "original_sentence": "The nail salon's reputation suffered because the quality was starting to ___",
    "original_straight": [
      "decline",
      "slip",
      "fade"
    ],
    "original_punny": [
      "chip"
    ],
    "repair_explanation": "Moved away from the business reputation angle to a personal relationship story, using 'polished' to mean both nail polish (professional) and overly refined/perfect (personality trait). Creates a more character-driven and surprising pun.",
    "claudecode_explanation": "\"Polished\" means overly refined/fake and nail polish. A manicurist being too polished — both meanings work in the relationship context.",
    "claudecode_rating": 5
  },
  {
    "id": 426,
    "sentence": "The corn farmer's jokes were terrible because they were always ___",
    "straight": [
      "bad",
      "stale",
      "predictable"
    ],
    "punny": [
      "corny"
    ],
    "original_sentence": "The farmer's jokes were terrible because they were always ___",
    "original_straight": [
      "bad",
      "stale",
      "predictable"
    ],
    "original_punny": [
      "corny"
    ],
    "repair_explanation": "Added 'corn' to make the farmer's specialty explicit, strengthening the pun connection. This makes the double meaning more direct while keeping the classic wordplay that works well.",
    "claudecode_explanation": "\"Corny\" means cheesy/bad jokes and corn-related. A corn farmer telling corny jokes — both meanings work but it's extremely obvious and self-referential.",
    "claudecode_rating": 5
  },
  {
    "id": 427,
    "sentence": "The magazine editor was overwhelmed because there were too many ___",
    "straight": [
      "demands",
      "deadlines",
      "tasks"
    ],
    "punny": [
      "issues"
    ],
    "original_sentence": "The reporter was overwhelmed because there were too many ___",
    "original_straight": [
      "demands",
      "deadlines",
      "tasks"
    ],
    "original_punny": [
      "issues"
    ],
    "repair_explanation": "Changed from reporter to magazine editor to better match the professional context. Editors directly manage magazine issues (editions) while dealing with issues (problems), making both meanings of the pun work naturally.",
    "claudecode_explanation": "\"Issues\" means problems and magazine issues/editions. A magazine editor with too many issues — both meanings are equally strong and natural.",
    "claudecode_rating": 7
  },
  {
    "id": 429,
    "sentence": "The garbage man's comedy routine was always ___",
    "straight": [
      "hilarious",
      "popular",
      "well-received"
    ],
    "punny": [
      "trashy"
    ],
    "original_sentence": "The garbage man's humor was always ___",
    "original_straight": [
      "bad",
      "terrible",
      "offensive"
    ],
    "original_punny": [
      "trashy"
    ],
    "repair_explanation": "The original setup implied trashy humor was bad, but 'trashy' can also mean authentically crude/edgy comedy that's actually entertaining. Changed to 'comedy routine' and positive straight answers to make both meanings work.",
    "claudecode_explanation": "\"Trashy\" means low-quality and garbage/trash. A garbage man's trashy comedy — both meanings work. Predictable but clean.",
    "claudecode_rating": 5
  },
  {
    "id": 430,
    "sentence": "The locksmith was great at networking events because he always found the perfect ___",
    "straight": [
      "connections",
      "partnerships",
      "matches"
    ],
    "punny": [
      "combination"
    ],
    "original_sentence": "The locksmith was popular at parties because he always knew the right ___",
    "original_straight": [
      "people",
      "words",
      "moves"
    ],
    "original_punny": [
      "combination"
    ],
    "repair_explanation": "The original phrase 'knew the right combination' was unnatural for describing social skills. Changed to 'found the perfect combination' which flows better and works for both finding the right mix of people/elements and lock combinations.",
    "claudecode_explanation": "\"Combination\" means social match/pairing and lock combination. A locksmith finding the perfect combination at networking events — both meanings are strong.",
    "claudecode_rating": 6
  },
  {
    "id": 431,
    "sentence": "The bowling alley worker's career hit rock bottom when he ended up in the ___",
    "straight": [
      "basement",
      "storage room",
      "back office"
    ],
    "punny": [
      "gutter"
    ],
    "original_sentence": "The bowling alley worker quit because he was sick of working in the ___",
    "original_straight": [
      "noise",
      "dark",
      "cold"
    ],
    "original_punny": [
      "gutter"
    ],
    "repair_explanation": "The original setup about working conditions felt forced. Reframed as a career trajectory metaphor where 'hitting rock bottom' and 'ending up in the gutter' both describe failure, while gutter also refers to bowling lane gutters.",
    "claudecode_explanation": "\"Gutter\" means rock bottom/low point and a bowling gutter. A bowling alley worker ending up in the gutter — both meanings are natural. Good.",
    "claudecode_rating": 7
  },
  {
    "id": 432,
    "sentence": "The lemon farmer's business was thriving because customers kept asking for more ___",
    "straight": [
      "citrus",
      "fruit",
      "produce"
    ],
    "punny": [
      "lemons"
    ],
    "original_sentence": "The lemon farmer was frustrated because life kept giving him ___",
    "original_straight": [
      "problems",
      "setbacks",
      "headaches"
    ],
    "original_punny": [
      "lemons"
    ],
    "repair_explanation": "The original was too predictable with the 'life gives you lemons' setup. Flipped it so getting lemons is positive for his business (literal lemons) while 'asking for more lemons' could mean seeking out problems, creating ironic humor.",
    "claudecode_explanation": "A lemon farmer whose customers want more lemons is just... successful business. There's no pun here. \"Lemons\" doesn't have a relevant second meaning.",
    "claudecode_rating": 1
  },
  {
    "id": 433,
    "sentence": "The insurance salesman was successful because his policies provided excellent ___",
    "straight": [
      "protection",
      "benefits",
      "value"
    ],
    "punny": [
      "coverage"
    ],
    "original_sentence": "The insurance salesman was hard to trust because his promises had no ___",
    "original_straight": [
      "value",
      "backing",
      "substance"
    ],
    "original_punny": [
      "coverage"
    ],
    "repair_explanation": "The original portrayed him negatively, but 'coverage' works better when both meanings are positive - good insurance coverage and comprehensive coverage of needs. Made him successful to align both interpretations positively.",
    "claudecode_explanation": "Insurance coverage is already what insurance provides. There's no second meaning — it's just a literal description of the business.",
    "claudecode_rating": 2
  },
  {
    "id": 434,
    "sentence": "The referee's wife divorced him because he kept making the wrong ___",
    "straight": [
      "decisions",
      "choices",
      "moves"
    ],
    "punny": [
      "calls"
    ],
    "original_sentence": "The baseball umpire was terrible at relationships because he always made bad ___",
    "original_straight": [
      "decisions",
      "choices",
      "moves"
    ],
    "original_punny": [
      "calls"
    ],
    "repair_explanation": "Changed from baseball umpire to referee and made it about divorce rather than general relationship problems, creating higher stakes and a more dramatic setup that makes the calls pun land harder.",
    "claudecode_explanation": "\"Calls\" means life decisions and referee calls. A referee making wrong calls in his marriage — both meanings are strong and the domestic scenario adds humor.",
    "claudecode_rating": 7
  },
  {
    "id": 436,
    "sentence": "The printer couldn't relax because he always felt ___",
    "straight": [
      "stressed",
      "tense",
      "anxious"
    ],
    "punny": [
      "pressed"
    ],
    "original_sentence": "The printer was depressed because he always felt ___",
    "original_straight": [
      "hopeless",
      "empty",
      "worthless"
    ],
    "original_punny": [
      "pressed"
    ],
    "repair_explanation": "Changed 'depressed' to 'couldn't relax' because 'felt pressed' is more natural for describing stress/pressure, and it better connects to the printing press mechanism.",
    "claudecode_explanation": "\"Pressed\" means stressed and printing press. A printer feeling pressed — both meanings work naturally.",
    "claudecode_rating": 6
  },
  {
    "id": 439,
    "sentence": "The podiatrist called off the wedding because he got cold ___",
    "straight": [
      "thoughts",
      "doubts",
      "nerves"
    ],
    "punny": [
      "feet"
    ],
    "original_sentence": "The surgeon called off the wedding because he got cold ___",
    "original_straight": [
      "thoughts",
      "doubts",
      "nerves"
    ],
    "original_punny": [
      "feet"
    ],
    "repair_explanation": "Changed from surgeon to podiatrist (foot doctor) to create a genuine professional connection to feet, making both meanings of 'cold feet' work simultaneously.",
    "claudecode_explanation": "\"Cold feet\" means nervousness about commitment and literal cold feet (podiatry). A podiatrist getting cold feet before a wedding — both meanings are perfectly activated.",
    "claudecode_rating": 7
  },
  {
    "id": 445,
    "sentence": "The vampire's comedy club went out of business because all the shows ___",
    "straight": [
      "failed miserably",
      "were disasters",
      "bombed completely"
    ],
    "punny": [
      "sucked"
    ],
    "original_sentence": "The vampire was a terrible comedian because all his jokes ___",
    "original_straight": [
      "failed",
      "bombed",
      "flopped"
    ],
    "original_punny": [
      "sucked"
    ],
    "repair_explanation": "Changed from focusing on the vampire as comedian to the vampire's business venture, making the failure more dramatic and the 'sucked' punchline hit harder with the business context.",
    "claudecode_explanation": "\"Sucked\" means were terrible and vampire sucking blood. Both meanings work clearly. Crude but effective.",
    "claudecode_rating": 6
  },
  {
    "id": 446,
    "sentence": "The fire chief's autobiography was exciting because every chapter was ___",
    "straight": [
      "intense",
      "gripping",
      "riveting"
    ],
    "punny": [
      "blazing"
    ],
    "original_sentence": "The fire chief's autobiography was thrilling because every chapter was ___",
    "original_straight": [
      "intense",
      "dramatic",
      "riveting"
    ],
    "original_punny": [
      "blazing"
    ],
    "repair_explanation": "Changed 'thrilling' to 'exciting' to make 'blazing' feel more natural as a description of exciting chapters, while maintaining the fire chief connection.",
    "claudecode_explanation": "\"Blazing\" means exciting and fire blazing. Both meanings work for a fire chief's autobiography. Standard.",
    "claudecode_rating": 5
  },
  {
    "id": 448,
    "sentence": "The flag store owner was thrilled because his new designs were absolutely ___",
    "straight": [
      "popular",
      "successful",
      "amazing"
    ],
    "punny": [
      "flying"
    ],
    "original_sentence": "The flag maker's business was doing great because sales were really ___",
    "original_straight": [
      "growing",
      "increasing",
      "climbing"
    ],
    "original_punny": [
      "flying"
    ],
    "repair_explanation": "Shifted from business sales to product success, making 'flying' work better as both 'extremely popular' and literal flag movement, with more enthusiasm in the setup.",
    "claudecode_explanation": "\"Flying\" means selling well (flying off the shelves) and flags flying. Both meanings work for a flag store. Clean.",
    "claudecode_rating": 6
  },
  {
    "id": 451,
    "sentence": "The astronaut threw a birthday party that was truly out of this ___",
    "straight": [
      "league",
      "category",
      "dimension"
    ],
    "punny": [
      "world"
    ],
    "original_sentence": "The astronaut's birthday party was out of this ___",
    "original_straight": [
      "league",
      "category",
      "ordinary"
    ],
    "original_punny": [
      "world"
    ],
    "repair_explanation": "The original was too predictable and cliché. The slight rewording makes it feel more natural while keeping the same solid double meaning - 'out of this world' as extraordinary and astronauts literally being out of this world.",
    "claudecode_explanation": "\"Out of this world\" means amazing and literally outer space. Classic idiom play for an astronaut. Well-known but clean.",
    "claudecode_rating": 5
  },
  {
    "id": 452,
    "sentence": "The meteorologist got fired because his forecasts were consistently ___",
    "straight": [
      "unclear",
      "confusing",
      "vague"
    ],
    "punny": [
      "cloudy"
    ],
    "original_sentence": "The weatherman was unreliable because his judgment was always ___",
    "original_straight": [
      "wrong",
      "inaccurate",
      "off"
    ],
    "original_punny": [
      "cloudy"
    ],
    "repair_explanation": "Changed to focus on forecast quality rather than judgment, making 'cloudy' work better as both 'unclear/confusing' predictions and literal weather conditions he should be predicting.",
    "claudecode_explanation": "\"Cloudy\" means unclear/vague and weather clouds. A meteorologist with cloudy forecasts — both meanings are strong. Nice irony.",
    "claudecode_rating": 6
  },
  {
    "id": 455,
    "sentence": "After every climb, the rock climber was always down to ___",
    "straight": [
      "chat",
      "relax",
      "celebrate"
    ],
    "punny": [
      "earth"
    ],
    "original_sentence": "The rock climber was easy to talk to because he was very down to ___",
    "original_straight": [
      "business",
      "reality",
      "basics"
    ],
    "original_punny": [
      "earth"
    ],
    "repair_explanation": "The original fought against rock climbing being about going UP. The repair focuses on the post-climb moment when climbers literally come down to earth, making both meanings (humble/approachable and physically returning to ground level) work together.",
    "claudecode_explanation": "\"Down to earth\" means humble/grounded and literally returning to the ground after climbing. The post-climb context makes both meanings work simultaneously.",
    "claudecode_rating": 7
  },
  {
    "id": 458,
    "sentence": "The marathon-running banker said her two passions went together because she was always running ___",
    "straight": [
      "races",
      "miles",
      "daily"
    ],
    "punny": [
      "numbers"
    ],
    "original_sentence": "The banker loved exercise because she was always running the ___",
    "original_straight": [
      "show",
      "office",
      "meeting"
    ],
    "original_punny": [
      "numbers"
    ],
    "repair_explanation": "The original forced a connection between 'running the numbers' (calculations) and physical exercise. The repair establishes her as an actual runner first, so 'running numbers' works both as her athletic activity (mile times, pace numbers) and her banking work.",
    "claudecode_explanation": "\"Running numbers\" means calculating and she runs marathons. But \"running\" is the pun and it's in the setup, not in the blank. The blank is just \"numbers\" which is one-dimensional.",
    "claudecode_rating": 4
  },
  {
    "id": 460,
    "sentence": "The soap maker's testimony was weak because it couldn't stand up to ___",
    "straight": [
      "pressure",
      "questioning",
      "scrutiny"
    ],
    "punny": [
      "lather"
    ],
    "original_sentence": "The soap maker's alibi fell apart because it wouldn't hold up under ___",
    "original_straight": [
      "pressure",
      "questioning",
      "scrutiny"
    ],
    "original_punny": [
      "lather"
    ],
    "repair_explanation": "The original 'wouldn't hold up under lather' was unnatural phrasing. Changed to 'couldn't stand up to lather' which works better since soap makers work with lather, and testimonies that can't stand up to something are weak.",
    "claudecode_explanation": "\"Lather\" means scrutiny (in a lather) and soap lather. But \"stand up to lather\" isn't how either meaning is naturally used. Awkward phrasing.",
    "claudecode_rating": 3
  },
  {
    "id": 462,
    "sentence": "After 40 years of teaching archaeology, the professor's retirement party banner read 'You're ___'",
    "straight": [
      "done",
      "finished",
      "retired"
    ],
    "punny": [
      "history"
    ],
    "original_sentence": "The archaeology professor's career was ___",
    "original_straight": [
      "over",
      "finished",
      "done"
    ],
    "original_punny": [
      "history"
    ],
    "repair_explanation": "Reframed as a retirement celebration with a banner message, making 'You're history' work as both a retirement congratulation and a reference to the subject he taught.",
    "claudecode_explanation": "\"You're history\" means you're done/finished and archaeology is the study of history. Both meanings work perfectly in the retirement party context. Fun and warm.",
    "claudecode_rating": 7
  },
  {
    "id": 465,
    "sentence": "The math teacher was mesmerized by the ocean's perfect ___",
    "straight": [
      "rhythm",
      "patterns",
      "motion"
    ],
    "punny": [
      "waves"
    ],
    "original_sentence": "The math teacher loved the ocean because of the beautiful ___",
    "original_straight": [
      "scenery",
      "sunsets",
      "views"
    ],
    "original_punny": [
      "waves"
    ],
    "repair_explanation": "The original focused on beauty which maps weakly to mathematical waves. 'Perfect waves' works better since math teachers appreciate precision, and wave functions in math are indeed about perfection and patterns.",
    "claudecode_explanation": "\"Waves\" means mathematical wave functions and ocean waves. A math teacher mesmerized by ocean waves — both meanings are natural. Clean.",
    "claudecode_rating": 6
  },
  {
    "id": 474,
    "sentence": "After Thanksgiving dinner, the pillow couldn't sleep because it was too ___",
    "straight": [
      "full",
      "uncomfortable",
      "restless"
    ],
    "punny": [
      "stuffed"
    ],
    "original_sentence": "The pillow couldn't sleep at night because it was too ___",
    "original_straight": [
      "anxious",
      "worried",
      "excited"
    ],
    "original_punny": [
      "stuffed"
    ],
    "repair_explanation": "Added 'After Thanksgiving dinner' to make the 'too stuffed to sleep' meaning more natural and relatable, while maintaining that pillows are literally stuffed with filling.",
    "claudecode_explanation": "\"Stuffed\" means full from eating and pillow stuffing. A pillow too stuffed to sleep after Thanksgiving — both meanings fire simultaneously. Fun personification.",
    "claudecode_rating": 7
  },
  {
    "id": 477,
    "sentence": "The clothing iron filed a complaint with HR because its job had too many ___",
    "straight": [
      "problems",
      "complications",
      "issues"
    ],
    "punny": [
      "wrinkles"
    ],
    "original_sentence": "The iron was stressed out because it had too many ___",
    "original_straight": [
      "tasks",
      "deadlines",
      "complaints"
    ],
    "original_punny": [
      "wrinkles"
    ],
    "repair_explanation": "Added the HR complaint angle to make it more absurd and workplace-focused, strengthening 'wrinkles' as both job complications and the literal thing an iron removes.",
    "claudecode_explanation": "\"Wrinkles\" means problems/complications and fabric wrinkles. A clothing iron dealing with too many wrinkles — both meanings are natural and the HR complaint adds humor.",
    "claudecode_rating": 6
  },
  {
    "id": 478,
    "sentence": "The farmer always said the secret to success was to make ___ while the sun shines",
    "straight": [
      "money",
      "progress",
      "deals"
    ],
    "punny": [
      "hay"
    ],
    "original_sentence": "The farmer woke up early every morning because he had to make ___",
    "original_straight": [
      "breakfast",
      "money",
      "progress"
    ],
    "original_punny": [
      "hay"
    ],
    "repair_explanation": "The original setup didn't complete the familiar idiom 'make hay while the sun shines.' The repaired version uses this complete phrase, making 'hay' work both as the literal farm product and as part of the well-known expression about seizing opportunities.",
    "claudecode_explanation": "\"Make hay while the sun shines\" is an existing proverb. Adding a farmer just makes it literal. The joke IS the proverb — there's no surprising recontextualization.",
    "claudecode_rating": 4
  },
  {
    "id": 479,
    "sentence": "The door salesman was so good at his job because he knew exactly when to ___",
    "straight": [
      "negotiate",
      "persist",
      "walk away"
    ],
    "punny": [
      "close"
    ],
    "original_sentence": "The door salesman was the best closer because he always knew how to ___",
    "original_straight": [
      "sell",
      "negotiate",
      "convince"
    ],
    "original_punny": [
      "close"
    ],
    "repair_explanation": "The original telegraphed the punchline by using 'closer' in the setup. Removing that word and changing to 'when to ___' creates surprise while maintaining both meanings of 'close' (finalizing sales and shutting doors).",
    "claudecode_explanation": "\"Close\" means close a sale and close a door. Both meanings work perfectly for a door salesman. Clean, tight, satisfying.",
    "claudecode_rating": 7
  },
  {
    "id": 483,
    "sentence": "The astronaut kept getting dumped because his relationships always felt ___",
    "straight": [
      "hollow",
      "empty",
      "meaningless"
    ],
    "punny": [
      "spacey"
    ],
    "original_sentence": "The astronaut's girlfriend left him because he was too emotionally ___",
    "original_straight": [
      "unavailable",
      "cold",
      "closed off"
    ],
    "original_punny": [
      "distant"
    ],
    "repair_explanation": "Changed from the obvious 'distant' to 'spacey' which works better as slang for being absent-minded/unfocused while connecting to space travel. The framing around repeated relationship failures makes it funnier.",
    "claudecode_explanation": "\"Spacey\" means distracted/absent-minded and space-related. An astronaut being spacey — both meanings work. Fun though predictable.",
    "claudecode_rating": 5
  },
  {
    "id": 484,
    "sentence": "The fisherman never worried about his problems because he knew they'd eventually ___",
    "straight": [
      "pass",
      "resolve",
      "disappear"
    ],
    "punny": [
      "scale"
    ],
    "original_sentence": "The fisherman's life had its ups and downs but he stayed on an even ___",
    "original_straight": [
      "path",
      "course",
      "footing"
    ],
    "original_punny": [
      "keel"
    ],
    "repair_explanation": "Switched from the clichéd 'even keel' setup to use 'scale' which means both to climb/overcome something and fish scales. The optimistic framing about problems resolving feels more natural and conversational.",
    "claudecode_explanation": "\"Scale\" should mean grow bigger and fish scales, but \"problems eventually scale\" meaning they resolve doesn't work. The intended meaning is unclear.",
    "claudecode_rating": 3
  },
  {
    "id": 486,
    "sentence": "The blood bank went out of business because it lost all its ___",
    "straight": [
      "donors",
      "funding",
      "staff"
    ],
    "punny": [
      "circulation"
    ],
    "original_sentence": "The newspaper went out of business because it lost all its ___",
    "original_straight": [
      "readers",
      "advertisers",
      "funding"
    ],
    "original_punny": [
      "circulation"
    ],
    "repair_explanation": "The original used 'circulation' too literally for newspapers. Changing to 'blood bank' creates a genuine double meaning where 'circulation' refers both to blood flow (medical) and customer/donor distribution (business).",
    "claudecode_explanation": "\"Circulation\" means customers/business circulation and blood circulation. A blood bank losing circulation — both meanings are equally strong. Clever.",
    "claudecode_rating": 7
  },
  {
    "id": 487,
    "sentence": "The refrigerator was a great horror movie host because every story gave the audience ___",
    "straight": [
      "goosebumps",
      "shivers",
      "frights"
    ],
    "punny": [
      "chills"
    ],
    "original_sentence": "The refrigerator was a great comedian because every joke gave the audience ___",
    "original_straight": [
      "goosebumps",
      "shivers",
      "thrills"
    ],
    "original_punny": [
      "chills"
    ],
    "repair_explanation": "Changed from comedian to horror movie host because 'chills' naturally describes both the cold from a refrigerator and the thrilling fear response to horror stories, making both meanings work perfectly together.",
    "claudecode_explanation": "\"Chills\" means fear/horror and refrigerator cold. A refrigerator hosting horror movies that give chills — both meanings work and the scenario is fun.",
    "claudecode_rating": 6
  },
  {
    "id": 489,
    "sentence": "The scuba instructor's students loved her because she never made them feel ___",
    "straight": [
      "stupid",
      "embarrassed",
      "inadequate"
    ],
    "punny": [
      "shallow"
    ],
    "original_sentence": "The scuba diver was always calm because no problem was too ___",
    "original_straight": [
      "big",
      "difficult",
      "complex"
    ],
    "original_punny": [
      "deep"
    ],
    "repair_explanation": "Changed from 'deep problems' to 'shallow feelings' which flips the water depth pun while using shallow's meaning of superficial/inadequate. The teaching context makes the emotional meaning stronger and more relatable.",
    "claudecode_explanation": "\"Shallow\" means superficial/inadequate and shallow water. A scuba instructor who never makes students feel shallow — both meanings are strong. Clever inversion of the expected 'deep' pun.",
    "claudecode_rating": 7
  },
  {
    "id": 491,
    "sentence": "The hot air balloon operator was terrible at his job because he always ___",
    "straight": [
      "panicked",
      "failed",
      "screwed up"
    ],
    "punny": [
      "cracked under pressure"
    ],
    "original_sentence": "The balloon was depressed because his friends kept letting him ___",
    "original_straight": [
      "go",
      "suffer",
      "fail"
    ],
    "original_punny": [
      "down"
    ],
    "repair_explanation": "Completely reframed to use 'cracked under pressure' which works for both psychological stress and the literal air pressure that inflates balloons. The professional incompetence angle is funnier than the friendship disappointment setup.",
    "claudecode_explanation": "\"Cracked under pressure\" means couldn't handle stress and balloons cracking from air pressure. Both meanings work for a balloon operator. Multi-word pun but effective.",
    "claudecode_rating": 6
  },
  {
    "id": 492,
    "sentence": "The airplane mechanic was frustrated because his career never got off the ___",
    "straight": [
      "runway",
      "tarmac",
      "launchpad"
    ],
    "punny": [
      "ground"
    ],
    "original_sentence": "The airplane mechanic was depressed because his ideas never got off the ___",
    "original_straight": [
      "table",
      "list",
      "agenda"
    ],
    "original_punny": [
      "ground"
    ],
    "repair_explanation": "Changed 'ideas' to 'career' and 'depressed' to 'frustrated' to make the setup more personal and relatable, while keeping the strong double meaning of 'ground' as both literal takeoff surface and metaphorical starting point for success.",
    "claudecode_explanation": "\"Got off the ground\" means never started and planes literally leaving the ground. An airplane mechanic whose career never got off the ground — both meanings are perfect. Clean idiom play.",
    "claudecode_rating": 7
  },
  {
    "id": 493,
    "sentence": "The tornado was a terrible therapist because all his advice was ___",
    "straight": [
      "confusing",
      "backwards",
      "warped"
    ],
    "punny": [
      "twisted"
    ],
    "original_sentence": "The tornado's personal life was a mess because everything was always ___",
    "original_straight": [
      "chaotic",
      "unpredictable",
      "ruined"
    ],
    "original_punny": [
      "twisted"
    ],
    "repair_explanation": "Reframed from personal life to professional role as therapist, making 'twisted' work as both literally describing tornado motion and figuratively describing bad/distorted advice, creating a more focused and surprising pun.",
    "claudecode_explanation": "\"Twisted\" means wrong/perverse and tornado twisting. Both meanings are natural for a tornado therapist.",
    "claudecode_rating": 6
  },
  {
    "id": 497,
    "sentence": "The baker quit his day job to become a loan officer because he already knew how to make ___",
    "straight": [
      "money",
      "profit",
      "cash"
    ],
    "punny": [
      "dough"
    ],
    "original_sentence": "The baker was also a great banker because he understood ___",
    "original_straight": [
      "money",
      "finances",
      "investments"
    ],
    "original_punny": [
      "bread"
    ],
    "repair_explanation": "Changed from 'bread' to 'dough' which is more natural slang for money and literally what bakers work with. Also reframed the setup to make the career transition more logical and natural.",
    "claudecode_explanation": "\"Dough\" means money and bread dough. The fifth dough pun in this set. Even the career-switch angle can't save this overused pun word.",
    "claudecode_rating": 3
  },
  {
    "id": 498,
    "sentence": "The telephone was ignored all day because nobody answered its ___",
    "straight": [
      "calls",
      "attempts",
      "signals"
    ],
    "punny": [
      "rings"
    ],
    "original_sentence": "The telephone was sad because nobody picked up on its ___",
    "original_straight": [
      "hints",
      "signals",
      "feelings"
    ],
    "original_punny": [
      "rings"
    ],
    "repair_explanation": "Changed 'picked up on' to 'answered' to make both meanings work more naturally - answering rings (phone calls) and answering rings (responding to signals). This creates clearer parallel meanings.",
    "claudecode_explanation": "\"Rings\" means phone ringing and... just phone ringing. There's no second meaning. A telephone's rings being ignored is purely literal.",
    "claudecode_rating": 2
  },
  {
    "id": 499,
    "sentence": "The fence couldn't make up its mind and remained sitting on the ___",
    "straight": [
      "issue",
      "question",
      "problem"
    ],
    "punny": [
      "post"
    ],
    "original_sentence": "The fence was completely undecided and stuck on the ___",
    "original_straight": [
      "problem",
      "issue",
      "question"
    ],
    "original_punny": [
      "post"
    ],
    "repair_explanation": "Used the established idiom 'sitting on the fence' (being undecided) and changed it to 'sitting on the post' so both meanings work - literally sitting on a fence post, and figuratively remaining undecided about an issue.",
    "claudecode_explanation": "\"Post\" as in fence post and \"sitting on the post\" trying to reference \"sitting on the fence.\" But the idiom is about the fence, not the post. The substitution doesn't land.",
    "claudecode_rating": 4
  },
  {
    "id": 500,
    "sentence": "The elevator operator's jokes were brilliant because they worked on so many ___",
    "straight": [
      "people",
      "audiences",
      "topics"
    ],
    "punny": [
      "levels"
    ],
    "original_sentence": "The elevator operator's jokes were bad because they worked on too many ___",
    "original_straight": [
      "people",
      "topics",
      "audiences"
    ],
    "original_punny": [
      "levels"
    ],
    "repair_explanation": "Changed 'bad' to 'brilliant' to fix the logical contradiction - jokes that work on multiple levels are good, not bad. Now both meanings align: elevators work on multiple floors/levels, and sophisticated jokes work on multiple levels of meaning.",
    "claudecode_explanation": "\"Levels\" means layers of meaning and elevator levels/floors. An elevator operator's jokes working on many levels — both meanings are equally strong and the meta-humor about jokes having levels is delightful.",
    "claudecode_rating": 8
  }
]